{
  "wikiSummary": "Gweler Cymru a\u0027r Ail Ryfel Byd am effaith y rhyfel ar Gymru.\nYr Ail Ryfel Byd oedd y rhyfel mwyaf eang a chostus mewn hanes. Bu ymladd ar draws rhan helaeth o\u0027r byd, o Norwy hyd ynys Gini Newydd, ac amcangyfrifir i tua 60 miliwn o bobl gael eu lladd neu farw o newyn a achoswyd gan y rhyfel. Ar un ochr yn y rhyfel roedd y Deyrnas Unedig a\u0027r Gymanwlad Brydeinig, Ffrainc, yr Unol Daleithiau, yr Undeb Sofietaidd a Tsieina, gyda nifer o wledydd llai. Cyfeirir at yr ochr yma yn aml fel \u0022y Cyngheiriaid\u0022. Ar yr ochr arall roedd yr Almaen, yr Eidal a Siapan, gyda nifer o wledydd llai. Prif ardaloedd y brwydro oedd Ewrop, Dwyrain Asia a\u0027r Cefnfor Tawel.\nNid oes cytundeb ar union ddyddiad dechrau\u0027r rhyfel. Y dyddiad mwyaf cyffredin a dderbynnir yw 1 Medi 1939, pan ymosododd yr Almaen ar Wlad Pwyl, gyda Phrydain a Ffrainc yn cyhoeddi rhyfel ar yr Almaen ddau ddiwrnod yn ddiweddarach. Mae eraill yn crybwyll y 7 Gorffennaf 1937 fel dyddiad dechrau\u0027r rhyfel, pan ymosododd Siapan ar Tsieina ac eraill wedyn yn nodi Mawrth 1939 a\u0027r adeg yr aeth byddinoedd Hitler i mewn i Prag, Tsiecoslofacia. Dim ond yn 1941 y daeth y rhyfel yn wirioneddol fyd-eang. Ym Mehefin y flwyddyn honno, ymosododd yr Almaen ar yr Undeb Sofietaidd, tra ym mis Rhagfyr ymosododd Japan ar lynges yr Unol Daleithiau yn Pearl Harbor. Yn fuan wedyn, cyhoeddodd yr Almaen ryfel ar yr Unol Daleithiau i gefnogi Japan. Ystyrir fel rheol fod y rhyfel wedi dod i ben ar 2 Medi 1945, pan ildiodd Japan i\u0027r Cyngheiriaid.\nRoedd technoleg filwrol wedi datblygu yn sylweddol ers y Rhyfel Byd Cyntaf, ac roedd awyrennau wedi dod yn llawer mwy pwysig. Daeth cyrchoedd awyr ar ddinasoedd y gelyn yn elfen bwysig yn strategaeth y ddwy ochr, ac roedd hyn yn un o\u0027r rhesyymau fod y cyfanswm colledion ymhlith y boblogaeth sifil yn llawer uwch yn y rhyfel yma nag yn y Rhyfel Byd Cyntaf. Daeth y rhyfel i ben pan ollyngodd America fomiau atomig ar ddinasoedd Hiroshima a Nagasaki yn Japan.\nYn ystod y rhyfel hwn lladdwyd miliynau o bobl yng ngwersylloedd crynhoi a gwersylloedd difa yr Almaen. Lladdwyd tua 6 miliwn o Iddewon yn yr Holocost, a niferoedd llai ond sylweddol o nifer o grwpiau eraill. Erbyn diwedd y rhyfel, yr Unol Daleithiau a\u0027r Undeb Sofietaidd oedd y ddau bŵer mawr, gan osod patrwm a barhaodd am rai degawdau. Rhannwyd yr Almaen yn ddwy, rhaniad a barhaodd hyd 1990. Er i\u0027r hen bwerau ymerodrol fel y Deyrnas Unedig a Ffrainc fod ar yr ochr fuddugol, cawsant eu gwanhau yn sylweddol gan y rhyfel, ac yn ystod yr ugain mlynedd dilynol dadfeiliodd eu hymerodraethau yn raddol.",
  "wikiArticle": "Gweler Cymru a\u0027r Ail Ryfel Byd am effaith y rhyfel ar Gymru.\nYr Ail Ryfel Byd oedd y rhyfel mwyaf eang a chostus mewn hanes. Bu ymladd ar draws rhan helaeth o\u0027r byd, o Norwy hyd ynys Gini Newydd, ac amcangyfrifir i tua 60 miliwn o bobl gael eu lladd neu farw o newyn a achoswyd gan y rhyfel. Ar un ochr yn y rhyfel roedd y Deyrnas Unedig a\u0027r Gymanwlad Brydeinig, Ffrainc, yr Unol Daleithiau, yr Undeb Sofietaidd a Tsieina, gyda nifer o wledydd llai. Cyfeirir at yr ochr yma yn aml fel \u0022y Cyngheiriaid\u0022. Ar yr ochr arall roedd yr Almaen, yr Eidal a Siapan, gyda nifer o wledydd llai. Prif ardaloedd y brwydro oedd Ewrop, Dwyrain Asia a\u0027r Cefnfor Tawel.\nNid oes cytundeb ar union ddyddiad dechrau\u0027r rhyfel. Y dyddiad mwyaf cyffredin a dderbynnir yw 1 Medi 1939, pan ymosododd yr Almaen ar Wlad Pwyl, gyda Phrydain a Ffrainc yn cyhoeddi rhyfel ar yr Almaen ddau ddiwrnod yn ddiweddarach. Mae eraill yn crybwyll y 7 Gorffennaf 1937 fel dyddiad dechrau\u0027r rhyfel, pan ymosododd Siapan ar Tsieina ac eraill wedyn yn nodi Mawrth 1939 a\u0027r adeg yr aeth byddinoedd Hitler i mewn i Prag, Tsiecoslofacia. Dim ond yn 1941 y daeth y rhyfel yn wirioneddol fyd-eang. Ym Mehefin y flwyddyn honno, ymosododd yr Almaen ar yr Undeb Sofietaidd, tra ym mis Rhagfyr ymosododd Japan ar lynges yr Unol Daleithiau yn Pearl Harbor. Yn fuan wedyn, cyhoeddodd yr Almaen ryfel ar yr Unol Daleithiau i gefnogi Japan. Ystyrir fel rheol fod y rhyfel wedi dod i ben ar 2 Medi 1945, pan ildiodd Japan i\u0027r Cyngheiriaid.\nRoedd technoleg filwrol wedi datblygu yn sylweddol ers y Rhyfel Byd Cyntaf, ac roedd awyrennau wedi dod yn llawer mwy pwysig. Daeth cyrchoedd awyr ar ddinasoedd y gelyn yn elfen bwysig yn strategaeth y ddwy ochr, ac roedd hyn yn un o\u0027r rhesyymau fod y cyfanswm colledion ymhlith y boblogaeth sifil yn llawer uwch yn y rhyfel yma nag yn y Rhyfel Byd Cyntaf. Daeth y rhyfel i ben pan ollyngodd America fomiau atomig ar ddinasoedd Hiroshima a Nagasaki yn Japan.\nYn ystod y rhyfel hwn lladdwyd miliynau o bobl yng ngwersylloedd crynhoi a gwersylloedd difa yr Almaen. Lladdwyd tua 6 miliwn o Iddewon yn yr Holocost, a niferoedd llai ond sylweddol o nifer o grwpiau eraill. Erbyn diwedd y rhyfel, yr Unol Daleithiau a\u0027r Undeb Sofietaidd oedd y ddau bŵer mawr, gan osod patrwm a barhaodd am rai degawdau. Rhannwyd yr Almaen yn ddwy, rhaniad a barhaodd hyd 1990. Er i\u0027r hen bwerau ymerodrol fel y Deyrnas Unedig a Ffrainc fod ar yr ochr fuddugol, cawsant eu gwanhau yn sylweddol gan y rhyfel, ac yn ystod yr ugain mlynedd dilynol dadfeiliodd eu hymerodraethau yn raddol.\r\n\r\n== Achosion y Rhyfel ==\n\nRoedd nifer o resymau am y rhyfel hwn. Gwelodd y cyfnod yn dilyn y Rhyfel Byd Cyntaf dŵf dwy ideoleg: Comiwnyddiaeth yn dilyn Chwyldro 1917 a ffurfio\u0027r Undeb Sofietaidd, a Ffasgaeth mewn rhai gwledydd yng ngorllewin Ewrop. Daeth Benito Mussolini, arweinydd plaid y Ffasgwyr yn yr Eidal, yn brifweinidog yr Eidal yn 1922. Rheolodd y wlad fel unben.\nGwelwyd tŵf pleidiau adain dde yn yr Almaen yn y cyfnod yma hefyd. Roedd Gweriniaeth Weimar wedi ei ffurfio yn 1919, ond ni lwyddodd i ennill cefnogaeth rhan helaeth o boblogaeth yr Almaen. Dan delerau Cytundeb Versailles, a arwyddwyd ar ddiwedd y Rhyfel Byd Cyntaf, roedd yr Almaen wedi colli tua 13% o\u0027i thiriogaeth a\u0027r cyfan o\u0027i threfedigaeth. Trosglwyddyd rhan o\u0027i thiriogaeth i Ffrainc a Gwlad Pwyl, tra cymerodd Prydain nifer o\u0027i threfedigaethau. Roedd llawer o anfodlonrwydd yn yr Almaen ynghylch hyn, yn enwedig ymhilth cyn-filwyr. Tyfodd y syniad nad oedd yr Almaen wedi ei gorchfygu yn filwrol yn y rhyfel, ond yn hytrach wedi ei bradychu gan y gwleidyddion.\nBu dirwasgiad difrifol yn yr Almaen rhwng y ddwy ryfel byd. Roedd hyn yn waeth yn y 1920au nac yng ngweddill Ewrop. Erbyn y 1930au fodd bynnag roedd rhan sylweddol o\u0027r byd datblygedig yn dioddef caledi ac anghydfod gwleidyddol a cymdeithasol y Dirwasgiad Mawr. Ar y chwith, roedd y Comiwnyddion yn ennill tir, tra ar y dde roedd nifer o bleidiau, yn eu plith Plaid y Gweithwyr Sosialaidd Cenedlaethol Almaenig dan arweiniad Adolf Hitler. Ar y cyntaf, ni chafodd lawer o lwyddiant etholiadol, ond yn etholiad Gorffennaf 1932 enillodd 37.4% o\u0027r bleidlaid a 230 o seddi yn y Reichstag. Yn etholiad Tachwedd yr un flwyddyn, gostyngodd ei phleidlais ychydig. Ar 30 Ionawr 1933, apwyntiodd yr Arlywydd, Paul von Hindenburg, Hitler yn Ganghellor yr Almaen. Credai y pleidiau adainodde mwy cymedrol y gallent reoli Hitler, ond ni allasant wneud hynny. Wedi i Hindenburg farw, cyhoeddodd Hitler ei fod yn gadael y swydd o Arlywydd yn wag, a chyhoeddodd ei hyn yn arweinydd yr Almaen fel Führer und Reichskanzler.\n\nBu nifer o ryfeloedd yn ail ran degawd y 1930au. Ym mis Hydref 1935, ymosododd yr Eidal ar Ethiopia, gan feddiannu\u0027r wlad erbyn mis Mai 1936. Dangosodd y rhyfel yma aneffeithiolrwydd Cynghrair y Cenhedloedd; er bod Ethiopia yn aelod, ni allodd y Cynghrair wneud dim effeithiol i\u0027w hamddiffyn rhag yr ymosodiad. Ar 17 Gorffennaf 1936, dechreuodd Rhyfel Cartref Sbaen. Rhoddodd Hitler a Mussolini gefnogaeth filwrol i wrthryfel adain-dde y Cadfridog Francisco Franco, tra rhoddodd yr Undeb Sofietaidd gefnogaeth i\u0027r llywodraeth weriniaethol. Ystyrir y rhyfel yma, a barhaodd hyd 1 Ebrill 1939, yn fath o ragarweiniad i\u0027r Ail Ryfel Byd, gan iddo roi cyfle i\u0027r Almaen, yr Eidal a\u0027r Undeb Sofietaidd brofi eu harfau.\nYn y dwyrain pell, roedd Japan wedi cipio Manshwria oddi ar Tsieina yn 1931. Ar 7 Gorffennaf 1937, ymosododd Japan ar Tsieina, gyda\u0027r bwriad o feddiannu\u0027r holl wlad. Er i\u0027r Siapaneaid ennill llawr o dir, parhaodd y rhyfel yma hyd nes iddo ddod yn rhan o\u0027r Ail Ryfel Byd ei hyn.\n\n\n=== Rol Hitler ===\nO dan arweiniad Adolf Hitler, arweinydd y Blaid Natsiaidd, roedd yr Almaen ers 1933 yn wlad a oedd wedi achosi tensiwn cynyddol yn Ewrop.  Roedd Hitler wedi dangos yn glir ers iddo ddod I bwer yn yr Almaen ei fod yn casau Cytundeb Versailles oherwydd y ffordd roedd yr Almaen wedi cael ei chywilyddio ar ôl y Rhyfel Byd Cyntaf.  Cosbwyd yr Almaen yn llym gan y cytundeb.  Collodd llawer o dir a’I lluoedd arfog, bu’n rhaid iddi dalu iawndal, a derbyn y bai am gychwyn y Rhyfel Byd Cyntaf.  Nid oedd ychwaith wedi cael gwahoddiad I fod yn rhan o’r trafodaethau yn Versailles. Roedd Hitler eisiau gwrthdroi Cytundeb Versailles, ailarfogi’r Almaen, ennill y tiroedd yma nol er mwyn creu un Almaen fawr Almaeneg ei hiaith.  Roedd eisiau creu ‘Lebensraum’, sef gofod byw I’r Almaenwyr pur fyddai’n byw yn y math yma o\u0027r Almaen. Golygai hynny feddiannu tiroedd ble roedd pobl Almaenig yn byw, er enghraifft, Tir y Swdeten , uno gyda Awstria ac ennill tir ychwanegol I’r dwyrain o’r Almaen. Roedd gwledydd fel Prydain, wedi oedi rhag atal cynlluniau Hitler.  Credent y gallai hynny arwain at achosi ryfel byd arall mor fuan ar ôl y Rhyfel Byd Cyntaf.\r\n\r\n== Dechrau\u0027r Rhyfel ==\n\n\n=== Dechrau\u0027r Rhyfel yn Ewrop ===\n\nWedi i Hitler ddod i rym, torrodd Gytundeb Versailles trwy yrru\u0027r fyddin i\u0027r Rheindir, oedd i fod yn ardal anfilwrol, ym mis Mawrth 1936. Ychydig fisoedd wedyn, dechreuodd Rhyfel Cartref Sbaen, a chefnogodd Hitler a Benito Mussolini, arweinydd yr Eidal, wrthryfel Francisco Franco.\nYn y blynyddoedd nesaf, dechreuodd Hitler ar ymgyrch i geisio ymestyn tiriogaeth yr Almaen. Un ardal oedd o ddiddordeb arbennig iddo oedd y Sudetenland, lle\u0027r oedd mwyafrif y trigolion yn Almaenwyr ethnig. Ar un adeg, roedd y Sudetenland yn perthyn i Awstria-Hwngari. Ar ddiwedd y Rhyfel Byd Cyntaf, daeth yr ardaloedd hyn yn eiddo Tsiecoslofacia. Pan ddaeth Hitler  i rym yn yr Almaen, dechreuodd annog trigolion Almaeneg y Sudetenland i alw am gael dod yn rhan o\u0027r Almaen. Datblygodd plaid Natsïaidd gref yno dan arweiniad Konrad Henlein. Cyfarfu Henlein a Hitler ar 28 Mawrth 1938, a dywedwyd wrth Henlein am fynnu hunanlywodraeth i\u0027r Sudetenland a\u0027r hawl i ddilyn polisiau Natsïaidd, gan wybod y byddai hyn yn annerbyniol i lywodraeth Edvard Beneš yn Tsiecoslofacia. Gwnaeth Henlein hyn ar 24 Ebrill. Cyhoeddodd yr Undeb Sofietaidd y byddai\u0027n barod i ymladd i amddiffyn Tsiecoslofacia, ond dim ond os byddai Ffrainc a Phrydain yn ymuno â hi. Ar 29 Medi, arwyddwyd Cytundeb München rhwng Hitler a\u0027i gynghreiriad Benito Mussolini a Neville Chamberlain, prif weinidog y Deyrnas Unedig, a Raymond Daladier, prif weinidog Ffrainc. Daethant i gytundeb y byddai raid i Tsiecoslofacia ildio\u0027r Sudetenland i\u0027r Almaen, gyda\u0027r Almaen i gymyryd meddiant o\u0027r diriogaeth erbyn 10 Hydref. Yn fuan wedyn yn 1939 meddiannodd Hitler y gweddill o Tsiecoslofacia  hefyd.\nAr 1 Medi 1939, ymosododd yr Almaen ar Wlad Pwyl. Ar 3 Medi, cyhoeddodd Ffrainc a\u0027r Deyrnas Unedig ryfel yn erbyn yr Almaen. Mae lle i gredu nad oedd Hitler wedi rhagweld hyn, gan nad oeddynt wedi ymateb i\u0027w ymosodiad ar Tsiecoslofacia. Parhaodd yr ymladd yn erbyn y Pwyliaid am bedair wythnos. Meddiannodd yr Almaen ran orllewinol y wlad, tra yn unol â\u0027r cytundeb rhwng Molotov a Ribbentrop. Meddiannodd yr Undeb Sofietaidd ran ddwyreiniol y wlad ar 17 Medi. Ac eithrio un ymosodiad yn ardal y Saar gan Ffrainc ni fu llawer o ymateb gan y cynghreiriad, ac ildiodd y fyddin Bwylaidd ar 6 Hydref 1939.\n\n\n=== Dechrau\u0027r Rhyfel yn Asia ===\nRoedd Japan wedi mabwysiadu polisi tramor ymosodol ers cychwyn yr 20g. Gosododd ei rheolaeth dros Corea yn 1905, goresgynodd Manshwria yn 1931 er mwyn darparu haearn a glo ar gyfer ei marchnadoedd. Fel pŵer diwydiannol pwysig yn y rhan yna o’r byd roedd Japan hefyd yn awyddus i ddangos ei hawdurdod.\nAchosodd hyn wrthdaro a thensiynau cynyddol gyda gwledydd fel UDA. Rheolwyd Llywodraeth Japan yn y cyfnod yma gan y fyddin a oedd yn awyddus i ymestyn pŵer Japan.  Roedd y wlad yn cael ei pharatoi ar gyfer rhyfel ac roedd y Llywodraeth eisiau cael gafael ar fwy o olew, haearn crai, glo a thir ar gyfer ehangu ei dinasoedd a’u phŵer diwydiannol.  Siomwyd Japan wedi Cytundeb Versailles. Roedd wedi gobeithio cael tir fel gwobr am ymladd ar ochr y Cynghreiriaid yn y rhyfel ac wedi’r siom trodd ei safiad a’i hymddygiad yn fwy milwrol.\nGyda goresgyn Manshwria yn 1931 a Tsieina ar 7 Gorffennaf 1937 roedd arwyddion clir bod ymddygiad Japan yn peri gofid i’r UDA. Llofnododd gytundeb gyda Hitler yn 1936 ac yng Ngorffennaf 1941 ymosododd milwyr Japaneaidd ar Indochina Ffrengig .  Credai UDA fod Japan am feddiannu de-ddwyrain Asia er mwyn cael cyflenwadau o rwber ac olew. Ymatebodd UDA drwy atal cyflenwadau o olew i Japan fel ei bod yn methu masnachu.  Ceisiwyd cynnal trafodaethau er mwyn datrys yr argyfwng ond yn y cyfamser roedd Llywodraeth Japan yn trefnu cynlluniau ar gyfer yr ymosodiad ar Pearl Harbor, Hawäii.\nFel rhan o\u0027r ymgyrch yn erbyn Tsieina, cipiodd Japan dde Indotsieina yn 1940. Gwaethygodd hyn ei pherthynas a\u0027r Unol Daleithiau a\u0027r pwerau gorllewinol eraill, ac yn 1941 gwrthodasant gyflenwi olew i Japan. Y bwriad oedd gorfodi Japan i roi\u0027r gorau i\u0027w hymosodiadau yn Tsieina a\u0027r gwledydd cyfagos, ond dewisodd llywodraeth Japan ymosod ar yr Unol Daleithiau a\u0027i chynghreiriad.\r\n\r\n== Y Rhyfel yn Ewrop ==\n\n\n=== Cwymp Ffrainc ===\n\nNi fu fawr o ymladd hyd wanwyn 1940. Ar 9 Ebrill, ymosododd yr Almaen ar Norwy, gan lanio milwyr yn Oslo, Bergen, Trondheim a Narvik, ac ar Denmarc. Ildiodd Denmarc bron yn syth, ac ildiodd Norwy ar 9 Mehefin.\nAr 10 Mai, ymosododd byddin yr Almaen ar yr Iseldiroedd, Gwlad Belg a Lwcsembwrg. Ar yr un dyddiad, daeth Winston Churchill yn Brif Weinidog y Deyrnas Unedig yn lle Neville Chamberlain. Ar 14 Mai, bu cyrch awyr yn erbyn Rotterdam, a\u0027r diwrnod wedyn ildiodd byddin yr Iseldiroedd.  Ar 28 Mai, gorfodwyd byddin Gwlad Belg i ildio.\nRoedd Ffrainc yn dibynnu ar Linell Maginot fel amddiffynfa yn erbyn yr Almaen, ond llwyddodd yr Almaenwyr i dorri trwodd gerllaw Sedan. Gorfodwyd byddinoedd Ffrainc, a byddin Brydeinig oedd wedi cyrraedd Ffrainc i gynorthwyo, i encilio. Ar 2 Mehefin, llwyddwyd i achub tua 330,000 o filwyr Prydeinig a Ffrengig mewn cychod o Dunkerque. Ar 14 Mehefin, cipiwyd dinas Paris gan y fyddin yr Almaen, ac ar 22 Mehefin ildiodd Ffrainc. Gosodwyd 60% o Ffrainc dan lywodraeth filwrol yr Almaen, tra sefydlwyd gwladwriaeth hanner-annibynnol yn y de-ddwyrain dan Philippe Pétain, gyda Vichy fel prifddinas.\nDilynwyd hyn gan frwydrau yn yr awyr rhwng lluoedd awyr y Deyrnas Unedig a\u0027r Almaen, yn arbennig Brwydr Prydain yn ystod haf a hydref 1940. Ni lwyddodd yr Almaen i ennill yr oruchafiaeth yn yr awyr a fyddai wedi gwneud glanio milwyr ar dir mawr Prydain yn bosibl. Am gryn gyfnod wedi hyn, dim ond yn yr awyr y bu\u0027r brwydro yng ngorllewin Ewrop, gyda chyrchoedd bomio gan lu awyr ar Almaen ar ddinasoedd ym Mhrydain a chyrchoedd gan y llu awyr Prydeinig, ac yn ddiweddarach llu awyr yr Unol Daleithiau, ar ddinasoedd yr Almaen.\n\n\n=== Rhyfel diarbed ===\nYstyr rhyfel diarbed yw pan fydd holl adnoddau cymdeithas yn cael eu defnyddio i drechu gwrthwynebydd. O ganlyniad, mae ffatrïoedd, piblinellau, rheilffyrdd, pontydd, dociau ac ardaloedd poblog iawn yn dod yn dargedau. Mae rhyfel diarbed yn cael yr effaith fwyaf ar y bobl sy’n byw nôl ar y Ffrynt Cartref, sef y sifiliaid.  Y syniad yw os pobl y wlad yn byw mewn ofn parhaus o farwolaeth annisgwyl a threisgar, bydd hyn yn rhoi pwysau ar ei llywodraeth i ildio.  Holl bwynt ymgyrch fomio barhaus oedd dinistrio ysbryd cenedl. Yn ystod yr Ail Ryfel Byd roedd Llundain – prifddinas Prydain, canolbwynt llywodraeth, diwydiant a masnach a chartref nifer mawr o bobl – yn darged strategol a hawdd. Roedd gan yr Almaen ganolfannau awyrennau bomio wedi eu lleoli yn rhai o’r gwledydd yn Ewrop a feddiannwyd ganddynt.  Gallai rhain lansio ymosodiadau ar draws y Sianel gan ddilyn llwybr Afon Tafwys i Lundain. Roedd y paratoadau felly ar gyfer y rhyfel yn Llundain wedi cynnwys symud plant a sifiliad a oedd yn agored i niwed i ardaloedd diogel. Digwyddodd hyn yn ysbeidiol yn dilyn cwymp Ffrainc a dechrau’r Blitz yn 1940 ac yn ystod cyfnod y bomiau hedegog yn 1944. Fel rhan o’r paratoadau roedd y Ddeddf Rhagofalon Cyrchoedd Awyr yn rhoi cyfrifoldeb i awdurdodau lleol dros sefydlu systemau Amddiffyn Sifil, dosbarthu mygydau nwy, darparu llochesau cyrchoedd awyr i gartrefi a threfnu gwaith y Wardeiniaid Cyrchoedd Awyr i orfodi rheoliadau’r blacowt yn ystod y Blitz.\n\n\n=== Brwydr Prydain ===\nYn ystod Haf 1940 roedd brwydr awyr rhwng yr RAF, sef llu awyr Prydain, a’r Luftwaffe, llu awyr yr Almaen Natsiaidd.  Bwriad y Natsiaid oedd lansio ymgyrch awyr drom ar Brydain a fyddai’n ei gorfodi i ildio ac yna derbyn telerau cytundeb heddwch.  Roedd y ‘Blitz’ yn rhan o’r frwydr hon.  Ar ôl i Ffrainc ildio ym mis Mehefin 1940, rhybuddiodd llywodraeth Prydain ei phobl i ddisgwyl y gwaethaf, sef ymgyrch fomio enfawr yn erbyn y porthladdoedd a’r dinasoedd.  I gychwyn, roedd y cyngor yn anghywir. Er bod Hitler wedi gorchymyn ymosodiad cyfun o’r awyr yn erbyn Prydain ar 31 Gorffennaf a goresgyniad ym mis Medi, dau brif darged y Luftwaffe oedd y meysydd awyr lle’r oedd yr RAF yn rheoli’r awyrennau ymladd a llongau Prydain yn y Sianel. Byddai clirio llongau rhyfel Prydain o’r Sianel, a rheoli’r awyr uwch ei phen ar ôl hynny, yn galluogi llu goresgyn yr Almaen i wneud ei waith heb rwystr. Roedd Brwydr Prydain wedi dechrau. Cafodd Brwydr Prydain ei hymladd uwchben cefn gwlad de Lloegr, a’i gwylio gan y cyhoedd. Roedd llawer llai o awyrennau gan yr RAF na’r Luftwaffe. Dim ond 2,915 o awyrennau oedd gan yr RAF a dim ond ychydig dros 1,200 ohonyn nhw oedd yn awyrennau ymladd. Roedd 4,550 o awyrennau gan y Luftwaffe. Yn ystod pum wythnos gyntaf y frwydr, hyd at 6 Medi, collodd yr RAF bron 20% o’i gryfder. Saethwyd 185 o awyrennau Spitfire a Hurricane i lawr mewn wythnos. Roedd colledion yr Almaen yr un mor drwm, ond roedd yr Almaenwyr yn dal ati gan gredu na fyddai’r RAF yn gallu eu gwrthwynebu’n llawer hirach. Roedden nhw’n iawn, ond nid oedden nhw’n gwybod hynny.\nNewid tactegau Achubwyd yr RAF rhag dinistr llwyr pan newidiodd yr Almaenwyr eu tactegau, gan fomio dinasoedd yn lle meysydd awyr.  Ar 7 Medi roedd Hitler yn gandryll, a gorchmynnodd i’r Luftwaffe fomio Llundain i ddial ar Brydain ar ôl i’r RAF fomio Berlin. Roedd y Blitz, y gair Almaeneg am ‘fellt’, wedi dechrau. Bathwyd y term ‘Blitz’ gan wasg Prydain, a defnyddiwyd y term i ddisgrifio’r cyrchoedd bomio trwm ac aml ar Brydain yn 1940 ac 1941.  Roedd Hitler am ddinistrio diwydiant Prydain a’i threfi a’i dinasoedd gan obeithio gorfodi Llywodraeth Prydain i ildio drwy fomio sifiliaid yn barhaus a thrwy hynny dorri eu hysbryd.\n\n\n=== Y ffrynt dwyreiniol ===\nAr 22 Mehefin 1941, ymosododd yr Almaen yn ddirybudd ar yr Undeb Sofietaidd mewn ymgyrch a elwid yn Gyrch Barbarossa. Nôd Cyrch Barbarossa oedd meddiannu rhan Ewropeaidd yr Undeb Sofietaidd. Roedd yr ymosodiad yn torri cytundeb heddwch rhwng Adolf Hitler a Stalin. Ar y cychwyn, enillodd yr Almaenwyr fuddugoliaethau mawr, gan lwyddo i amgylchynu nifer fawr o filwyr Rwsiaidd a\u0027u cymyryd yn garcharorion. Fodd bynnag, erbyn mis Hydref roedd yr ymosodiadau Almaenig yn cael llai o lwyddiant, yn rhannol oherwydd y mwd oedd wedi dilyn glawogydd yr hydref. Cyrhaeddodd yr Almaenwyr hyd gyrion Moscfa, ond ni allasant fynd ymhellach. Gwrthododd Hitler ganiatâd iddynt i encilio i safleoedd mwy pwrpasol ar gyfer y gaeaf.\nDioddefodd y ddwy ochr golledion trwm, a dilynwyd yr ymgyrch yma gan frwydrau ar raddfa enfawr yn ystod 1942 a 1943. Un o\u0027r brrwydrau tyngedfennol oedd Brwydr Stalingrad. Yn ystod haf 1942, ymosododd Chweched Fyddin yr Almaen dan Friedrich Paulus yn y de. Dechreuodd yr ymgyrch ar 28 Mehefin. Ar 19 Awst gorchymynnwyd cipio dinas Stalingrad. Ar 12 Medi, penodwyd Vasily Chukov i arwain yr amddiffynwyr yn y ddinas. Dros y misoedd nesaf bu brwydro caled o gwmpas ac yn adfeilion Stalingrad. Bu colledion trwm ar y ddwy ochr, a lladdwyd tua 40,000 o drigolion y ddinas. \n\nTra roedd yr ymladd yn parhau yn y ddinas, cynlluniodd y cadfridog Georgi Zhukov wrth-ymosodiad i godi\u0027r gwarchae ar Stalingrad ac amgylchynu\u0027r Chweched Fyddin. Dechreuodd yr ymosodiad hwn ar 19 Tachwedd. Ar 23 Tachwedd, gorchymynnodd Hitler nad oedd y Chweched Fyddin i encilio, ond i amddiffyn eu safleoedd hyd angau. Llwyddodd y Fyddin Goch i amgylchynu\u0027r Almaenwyr. Ym mis Chwefror, ildiodd Paulus a gweddillion ei fyddin i\u0027r Fyddin Goch. Dyma\u0027r tro cyntaf i\u0027r Almaen golli brwydr ar raddfa fawr yn yr Ail Ryfel Byd, a Paulus oedd y cadlywydd Almaenig cyntaf erioed i\u0027w gymyryd yn garcharor.\nYn haf 1943, ymosododd yr Almaenwyr eto. Rhwng 4 Gorffennaf a 22 Gorffennaf, ymladdwyd Brwydr Kursk, y frwydr danciau fwyaf erioed. Roedd gan yr Almaenwyr tua 800,000 o droedfilwyr, 3,000 o danciau a 2,000 o awyrennau, tra\u0027r oedd gan y Fyddin Goch tua 1,3000,000 o droedfilwyr, 3,6000 o danciau a 2,400 o awyrennau. Er i\u0027r Fyddin Goch ddioddef mwy o golledion na\u0027r Almaenwyr, methodd yr ymosodiad a thorri trwy eu llinellau amddiffynnol. Dyma\u0027r tro olaf i fyddin yr Almaen fedru ymosod yn strategol ar raddfa fawr ar y ffrynt dwyreiniol, ac o hyn ymlaen fe\u0027u gorfodwyd i encilio yn raddol o Rwsia a thrwy ddwyrain Ewrop. Aeth y Fyddin Goch ymlaen i feddiannu rhan ddwyreiniol yr Almaen. Lladdodd Hitler ei hun ar 30 Ebrill 1945 wrth i danciau\u0027r Fyddin Goch nesáu at ganol Berlin.\n\n\n=== Y ffrynt gorllewinol ===\n\nAr 6 Mehefin 1944, glaniodd milwyr yr Unol Daleithiau, y Deyrnas Unedig a nifer o gynghreiriaid eraill dan Dwight D. Eisenhower ar draethau Normandi yng ngogledd Ffrainc, gan ddefnyddio 6,000 o longau a chychod. Glaniodd 160,000 o filwyr ar y diwrnod cyntaf, ac erbyn diwedd Awst roedd y nifer wedi cynyddu i 3 miliwn. Er eu bod yn llawer mwy niferus na\u0027r milwyr Almaeneg oedd yn ei gwrthwynebu, bu ymladd caled am y ddau fis nesaf. Tua diwedd Gorffennaf, llwyddodd y Cynghreiriaid i dorri trwy linellau amddiffynnol y fyddin Almaenig, a dechreuasant ennill tir yn gyflymach. Cipiwyd Paris oddi ar yr Almaenwyr ar 25 Awst 1944. Tua\u0027r adeg yma, ymddangosai fel bod diwedd y rhyfel yn nesáu, ond ym mis Medi methodd Cyrch Market Garden, ymosodiad oedd wedi ei fwriadu i groesu Afon Rhein yn Arnhem. Gwrth-ymosododd yr Almaenwyr yn yr Ardennes ym mis Rhagfyr, ond er iddynt gael cryn lwyddiant yn y dyddiau cyntaf, fe\u0027u gorfodwyd i encilio. Ym mis Mawrth 1945, croesodd y Cynghreiriaid afon Rhein ger Wesel, ac ar 25 Ebrill, cyraeddasant afon Elbe a chyfarfod y Fyddin Goch.\nDaeth y rhyfel i ben yn Ewrop ar 18 Mai 1945 pan ildiodd yr Almaen.\r\n\r\n== Y Rhyfel yn y Môr Canoldir a Gogledd Affrica ==\n\n\n=== Y Balcanau ===\nRoedd Albania eisoes wedi ei meddiannu gan yr Eidal yn Ebrill 1939. Roedd Mussolini yn awyddus i efelychu llwyddiannau\u0027r Almaen yn 1940, ac ar 28 Hydref 1940, ymosododd yr Eidalwyr ar Wlad Groeg. Cawsant beth llwyddiant ar y cychwyn, ond bu raid iddynt encilio yn wyneb gwrth-ymosodiad y Groegiaid, a ddechreuodd ar  14 Tachwedd. Ymunodd Hwngari, Rwmania a Bwlgaria a\u0027r Axis, ac ymosododd yr Almaenwyr ar Wlad Groeg o Bwlgaria. Er gwaethaf cymorth Prydeinig i\u0027r Groegwyr, cipiwyd Athen gan yr Almaenwyr ar 27 Ebrill 1941, ac ym mis Mai cipwyd ynys Creta.\n\n\n=== Gogledd Affrica a\u0027r Eidal ===\nAr 13 Medi 1940, ymosododd mwy na 200,000 o filwyr yr Eidal ar yr Aifft, gyda\u0027r bwriad o gael rheolaeth tros Gamlas Suez a meysydd olew\u0027r Dwyrain Canol. Gorchfygwyd hwy mewn nifer o frwydrau gan y fyddin Brydeinig, a bu raid i Mussolini alw ar Hitler am gymorth. Gyrrwyd yr Afrikakorps i Ogledd Affrica, a than Erwin Rommel gyrrodd y Prydeinwyr yn ôl am gyfnod. Ni allai\u0027r Almaen ei atgyfnerthu, fodd bynnag, ac roedd yn brin o olew. Yn 1942, gorchfygwyd yr Afrikakorps gan y Prydeinwyr dan Bernard Montgomery ym mrwydr El Alamein. Glaniodd yr Americanwyr yn Algeria a Moroco, ac yn raddol gyrrwyd yr Almaenwyr o Ogledd Affrica. Ym mis Mai 1943, ildiodd yr Almaenwyr ac Eidalwyr olaf yn Tiwnisia.\nGwnaeth hyn ymosodiad ar yr Eidal yn bosibl. Ar 10 Gorffennaf 1943, glaniodd y cynghreiriaid ar ynys Sicilia, ac ar 3 Medi, gallasant groesi Culfor Messina i\u0027r tir mawr. Wedi naw mis o ymladd, cipiwyd dinas Rhufain ar 4 Mehefin 1944. Ildiodd yr Eidal, ac yna cyhoeddodd ryfel yn erbyn yr Almaen. Diarfogwyd byddin yr Eidal gan yr Almaenwyr, a pharhaodd yr ymladd yng ngogledd yr Eidal. Daeth y ffrynt yma yn llai pwysig wedi i\u0027r Cynghreiriaid lanio yn Normandi, ond parhaodd yr ymladd yma hyd fis Mai, 1945.\r\n\r\n== Y Rhyfel yn y Cefnfor Tawel ac Asia ==\n\nAr 7 Rhagfyr 1941, ymosododd Japan ar nifer o dargedau, yn eu plith cyrch awyr ar lynges yr Unol Daleithiau yn Pearl Harbor. Yr un pryd, glaniwyd milwyr yn Malaya, oedd yn drefedigaeth Brydeinig. Pedwar diwrnod yn ddiweddarach, cyhoeddodd yr Almaen ryfel ar yr Unol Daleithiau, i gefnogi Japan. Ar 10 Rhagfyr, suddodd llu awyr Japan y llongau rhyfel Prydeinig Prince of Wales a Repulse, ac yn fuan wedyn syrthiodd Singapôr i fyddin Siapan. Ym mis Ionawr 1942, ymosododd Japan ar Burma, Ynysoedd Solomon ac  India\u0027r Dwyrain Iseldiraidd. Roedd Japan erbyn hynny hefyd yn bygwth India ac Awstralia a bu rhyfel y Cynghreiriaid yn y Dwyrain Pell yn ddibynnol ar ymdrechion milwyr Awstralia ac America. Roedd Prydain yn brwydro yn Burma er mwyn amddiffyn India.\nDechreuodd y llanw droi gyda buddugoliaeth llynges yr Unol Daleithiau dros lynges Japan ym Mrwydr Midway rhwng 4 a 7 Mehefin 1942. Dioddefodd llynges Japan golledion mawr, ac o hyn ymlaen llwyddodd yr Unol Daleithiau i gipio ynysoedd y Cefnfor Tawel oddi arnynt fesul un, yn dilyn brwydro ffyrnig. Yn Awst 1942, dechreuodd ymladd ffyrnig rhwng byddinoedd America a Japan am feddiant o ynys Guadalcanal, un o Ynysoedd Solomon. Parhaodd yr ymladd am chwe mis, a lladdwyd dros 40,000; yn y diwedd cafodd yr Americanwyr y fuddugoliaeth.\nO hyn ymlaen, gotfodwyd y Siapaneiad i encilio\u0027n raddol. Ar 19 Hydref 1944, gwnaeth llu awyr Japan yr ymosodiad Kamikaze cyntaf ar lynges yr Unol Daleithiau. Yr ymosodiadau hyn, byddai\u0027r awyrennwr, mewn awyren oedd wedi ei llenwi a deunydd ffrwydrol, yn ceisio taro llong â\u0027r awyren, gan ei ladd ei hun er mwyn niwedio\u0027r gelyn. Cafodd y tactegau hyn beth llwyddiant, ond yn Chwwefror - Mawrth 1945, cipiodd yr Americanwyr Iwo Jima, yna rhwng Ebrill a Mehefin, cipiasant Okinawa. Roedd y colledion yn yr ymladd yma tua 20,000 o Americanwyr a  130.000 o Siapanea\r\n\r\n== Hanes y Faciwî yng Nghymru ==\r\n\r\n== Diwedd y Rhyfel ==\n\nLladdodd Adolf Hitler ei hun ar 30 Ebrill 1945 wrth i danciau\u0027r Fyddin Goch nesáu at ganol Berlin. Olynwyd ef fel Canghellor yr Almaen gan y Llyngesydd Doenitz. Ychydig ddyddiad yn ddiweddarach, ar 7 Mai, ildiodd yr Almaen yn ddiamod i\u0027r Cynghreiriad. Rhannwyd yr Almaen yn bedwar rhanbarth dan feddiant milwrol yr Unol Daleithiau, Prydain, Ffrainc a\u0027r Undeb Sofietaidd. Yn 1949, unwyd y rhanbarthau oedd dan reolaeth y pwerau gorllewinol fel Gweriniaeth Ffederal yr Almaen, gyda Konrad Adenauer fel Canghellor. Daeth y rhan oedd ym meddiant yr Undeb Sofietaidd yn wladwriaeth ar wahân, Gweriniaeth Ddemocrataidd yr Almaen. Nid adunwyd y ddwy ran hyd 1990. Collodd yr Almaen diriogaethau helaeth yn y dwyrain i Wlad Pwyl, gyda Gwlad Pwyl yn colli rhai o\u0027i thiriogaethau dwyreiniol hithau i\u0027r Undeb Sofietaidd.\n\nParhaodd y rhyfel yn Asia a\u0027r Cefnfor Tawel am rai misoedd. Gollyngodd yr Unol Daleithiau fom atomig ar ddinas Hiroshima ar 6 Awst 1945, yna un arall ar ddinas Nagasaki ar 9 Awst. Lladdwyd tua 165,000 o bobl yn yr ymosodiadau, a bu farw tua 145,000 arall yn yr wythnosau dilynol o effeithiau\u0027r bomiau. Hefyd ar 9 Awst, ymosododd byddin yr Undeb Sofietaidd ar Manshwria, oedd ar y pryd ym meddiant Japan.  Cyhoeddodd lywodraeth Japan ei bod yn barod i ildio ar 15 Awst, ac arwyddwyd y ddogfen ar 2 Medi. Meddiannwyd Japan yn filwrol gan yr Unol Daleithiau am gyfnod wedi iddi ildio, a dienyddiwyd rhai o uchel swyddogion y lluoedd arfog wedi eu cael yn euog o droseddau thyfel, ond gadwyd i\u0027r ymerawdwr Hirohito barhau fel pennaeth y wladwriaeth.\r\n\r\n== Colledion ==\n\nAmcangyfrifir i tua 60 miliwn o bobl golli eu bywydau o ganlyniad i\u0027r Ail Ryfel Byd, y cyfanswm uchaf o unrhyw ryfel mewn hanes. Yn wahanol i\u0027r Rhyfel Byd Cyntaf, roedd canran uchel o\u0027r colledion hyn ymysg y boblogaeth sifil. Yr Undeb Sofietaidd a ddiddefodd fwyaf o golledion, gyda rhwng 8 a 10 miliwn o golledion milwrol, yn cynnwys nifer fawr o garcharorion rhyfel a fu farw yng ngwersylloedd crynhoi yr Almaen, a 10 - 15 miliwn o golledion sifil. Collodd Tsieina yn agos at 20 miliwn o\u0027i phoblogaeth i gyd, y mwyafrif ymhlith y boblogaeth sifil. Roedd colledion milwrol yr Almaen dros 5 miliwn, y mwyafrif o\u0027r rhain ar y ffrynt dwyreiniol., a cholledion milwrol Japan dros 2 filiwn.\nRoedd y colledion sifil yn cynnwys pobl a laddwyd mewn cyrchoedd awyr. Ymhlith y cyrchoedd awyr a achosodd fwyaf o golledion, roedd cyrchoedd awyr Prydain ac America ar ddinasoedd Hamburg a Dresden yn yr Almaen, a\u0027r ymosodiadau atomig ar Hiroshima a Nagasaki. Lladdwyd miliynau yng ngwesylloedd yr Almaen , a bu farw miliymau eraill o newyn o ganlyniad i\u0027r rhyfel mewn gwledydd fel Tsieina ac India.\r\n\r\n== Yr Holocost ==\n\nYr Holocost yw\u0027r term a ddefnyddir am ladd tua chwe miliwn o Iddewon Ewropeaidd yn ystod yr Ail Ryfel Byd, fel rhan o raglen fwriadol o hil-laddiad gan y Natsïaid. Lladdwyd nifer fawr o bobloedd a grwpiau eraill gan y Natsïaid hefyd, yn cynnwys y Roma, carcharorion rhyfel o\u0027r Undeb Sofietaidd, pobl hoyw, pobl anabl, Tystion Jehovah ac eraill. Mae rhywfaint o anghytundeb ymysg ysgolheigion a ddylid cynnwys y rhain yn y term \u0022Holocost\u0022, neu a ddylid ei ddefnyddio am yr Iddewon yn unig.\nDechreuodd yr erlid ar yr Iddewon a grwpiau eraill yn raddol wedi i\u0027r Natsïaid ddod i rym yn yr Almaen, ond dim ond wedi dechrau\u0027r rhyfel y bu lladd ar raddfa fawr. Erbyn y 1940au roedd gwersylloedd difa megis Auschwitz a Treblinka wedi eu sefydlu, lle lladdwyd miliynau trwy ddefnyddio nwy a dulliau eraill. Credir i 1.4 miliwn o bobl gael eu lladd yn Auschwitz yn unig, a thuag 800,000 yn Treblinka. Cysylltir y rhaglen yma yn arbennig â Heinrich Himmler a\u0027r SS.\r\n\r\n== Effeithiau\u0027r Rhyfel ==\n\nRoedd nifer o\u0027r prif arweinwyr megis Hitler ei hun, Heinrich Himmler a Joseph Goebbels wedi ei lladd ei hunain cyn cael eu dal gan y cyngheiriaid neu yn fuan wedyn, ac ni wyddai neb beth oedd hanes Martin Bormann. Cynhaliwyd cyfres o achosion llys gan y Cynghreiriaid, yn enwedig Profion Nuremberg, yn erbyn y gweddill o arweinwyr llywodraeth Natsiaidd yr Almaen. Dedfrydwyd nifer ohonynt i farwolaeth, a charcharwyd eraill am wahanol gyfnodau. Ystyrir y rhain yn ddatblygiad pwysig ym maes cyfraith ryngwladol.\nO ganlyniad i\u0027r rhyfel hwn daeth ynysiaeth yr Unol Daleithiau i ben, ail-adeiladwyd yr Almaen a Siapan fel gwledydd diwydiannol pwysig iawn, daeth yr Unol Daleithiau a\u0027r Undeb Sofietaidd yn ddwy arch bŵer, a sefydlwyd y Cenhedloedd Unedig er mwyn ceisio rhwystro rhyfel byd yn y dyfodol. Yn Tsieina, cipiwyd gryn gan y Comiwnyddion dan Mao Zedong, ac yn 1949 cyhoeddodd Mao, a oedd erbyn hynny\u0027n Gadeirydd y Blaid Gomiwnyddol, Weriniaeth Pobl Tsieina. Roedd Prydain a Ffrainc wedi eu gwanhau yn fawr o ganlyniaid i\u0027r rhyfel, ac yn y blynyddoedd nesaf dechreuasant golli gafael ar eu hymerodraethau. Daeth India yn annibynnol yn 1947. Un arall o ganlyniadau\u0027r rhyfel oedd ffurfio gwladwriaeth Israel.\nYn fuan datblygodd cystadleuaeth rhwng yr Undeb Sofietaidd a gwledydd Cytundeb Warsaw ar y naill ochr a\u0027r Unol Daleithiau a gwledydd  NATO ar y llall a elwir y Rhyfel Oer. Parhaodd o tua 1945 hyd i tua 1990.",
  "imageNames": [
    "228_regiment_in_HK.jpg",
    "8th_AF_Bombing_Marienburg.JPEG",
    "Approaching_Omaha.jpg",
    "Bundesarchiv_Bild_101I-031-2436-03A_Russland_Hinrichtung_von_Partisanen_retouched.jpg",
    "Bundesarchiv_Bild_101I-646-5188-17_Flugzeuge_Junkers_Ju_87.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1939,
  "end": 1945,
  "categoryId": "milwrol",
  "id": "ail-rhyfel-byd",
  "label": "Ail Ryfel Byd"
}