{
  "wikiSummary": "Cymro a gwleidydd Llafur oedd Aneurin \u0027Nye\u0027 Bevan . Bu\u0027n aelod seneddol dros y Blaid Lafur, yn etholaeth Glynebwy o 1929 tan 1960. Roedd yn arwr i\u0027r chwith gwleidyddol, yn arbennig am ei weithgarwch yn sefydlu y Gwasanaeth Iechyd Gwladol . Roedd yn areithiwr huawdl iawn er fod ganddo atal dweud pan yn ifanc. Fe ddaeth yn gyntaf mewn arolwg o arwyr Cymru.",
  "wikiArticle": "Cymro a gwleidydd Llafur oedd Aneurin \u0027Nye\u0027 Bevan . Bu\u0027n aelod seneddol dros y Blaid Lafur, yn etholaeth Glynebwy o 1929 tan 1960. Roedd yn arwr i\u0027r chwith gwleidyddol, yn arbennig am ei weithgarwch yn sefydlu y Gwasanaeth Iechyd Gwladol . Roedd yn areithiwr huawdl iawn er fod ganddo atal dweud pan yn ifanc. Fe ddaeth yn gyntaf mewn arolwg o arwyr Cymru.\r\n\r\n== Ieuenctid ==\nGanwyd Bevan yn Nhredregar yn fab i lowr a Bedyddiwr, David Bowen. Roedd ei fam yn Fethodist. Yn un o ddeg o blant ni chafodd fawr o lwyddiant yn yr ysgol. Yn dair ar ddeg oed aeth i weithio yn y pwll glo lleol. Rhyddfrydwr oedd ei dad pan yn ifanc ond yn ddiweddarach ymunodd â\u0027r Blaid Lafur Annibynnol.\r\n\r\n== Llywodraeth ==\nRoedd etholiad cyffredinol 1945 yn llwyddiant ysgybol i\u0027r Blaid Lafur, gan eu galluogi i greu diwygiad cymdeithasol. Clement Attlee oedd y Prif Weinidog newydd, ac fe apwyntiodd Aneurin Bevan yn Gweinidog Iechyd. Fe\u0027i heriwyd i greu Gwasanaeth Iechyd Gwladol, a arianwyd gan drethi, er mwyn darparu gwasanaeth safonol i\u0027r boblogaeth am ddim. Daeth y Gwasanaeth i fodolaeth ar y 5 Gorffennaf, 1948. Fe wladolwyd 2,688 o ysbytai yng Nghymru a Lloegr, a daethant dan orychwyliaeth Bevan. Ar yr un pryd, roedd yn gyfrifol am dai - a oedd yn bwnc problemus yn sgil dinistr yr Ail Ryfel Byd.\nYn 1951, fe\u0027i ostyngwyd i fod yn Weinidog Llafur, ond yn fuan iawn fe ymddiswyddodd mewn safiad yn erbyn cyflwyniad taliadau presgripsiwn ar gyfer dentyddiaeth a sbectol.",
  "imageNames": [
    "Anenurin_Bevan_Minister_of_Health_on_the_first_day_of_the_National_Health_Service_5_July_1948_at_Park_Hospital_Davyhulme_near_Manchester_14465908720.jpg",
    "Aneurin_Bevan_1943.jpg",
    "Aneurin_Bevan_crop.jpg",
    "Aneurin_Bevan_and_his_wife_Jenny_Lee_in_Corwen_15368872658.jpg",
    "Aneurin_Bevan_signature.png"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1897,
  "end": 1960,
  "categoryId": "unigolion-nodedig",
  "id": "aneurin-bevan",
  "label": "Aneurin Bevan"
}