{
  "wikiSummary": "Anthem genedlaethol Cymru yw Hen Wlad fy Nhadau. Ysgrifennwyd y geiriau gan Evan James , a chyfansoddwyd y dôn gan ei fab James James ym mis Ionawr 1856. Roedd y ddau yn drigolion o Bontypridd. Gwehydd a bardd oedd y mab, a thelynor oedd y tad.\nYmddengys y sgwennwyd y geiriau fel ymateb i wahoddiad gan y bardd a dderbyniasai gan ei frawd i ymuno ag ef yn yr Unol Daleithiau, lle’r oedd cynifer o Gymry’r cyfnod yn chwilio am well byd, a bod y gân yn ddatganiad fod gwlad genedigaeth y bardd yn ddigon da iddo ef. Rhoddwyd iddi yr enw ‘Glan Rhondda’, gan mai ar lannau’r afon, yn ôl traddodiad, y daeth yr alaw i feddwl y cyfansoddwr.\nPerfformiwyd y gân, neu \u0027Glan Rhondda\u0027 fel y gelwid hi\u0027n wreiddiol, am y tro cyntaf yn festri Capel Tabor, Maesteg yn Ionawr neu Chwefror 1856, gan gantores leol, Elizabeth John. Argraffwyd y geiriau\u0027n unigrhagor ar ffurf baled, ac wedi hynny, daeth y gân yn boblogaidd drwy\u0027r ardal. Daeth hi\u0027n fwy adnabyddus fyth yn Eisteddfod Llangollen, 1858, ar ôl i Llewelyn Alaw  o Aberdâr ddod yn fuddugol mewn cystadleuaeth yn gofyn am gasgliad o alawon Cymreig oedd heb eu cyhoeddi. Fodd bynnag, ni phriodolwyd y geiriau i Evan a James James!\nCynhwyswyd y geiriau a\u0027r alaw, eto yn ddienw, gan feirniad y gystadleuaeth, John Owen yn ei gasgliad cyntaf o Gems of Welsh Melody a gyhoeddwyd gan Isaac Clarke yn Rhuthun yn 1860. Dyma\u0027r argraffiad cyntaf o\u0027r geiriau a\u0027r alaw ac fe\u0027u hargraffwyd yn yr adeilad du-a-gwyn a elwir heddiw yn \u0027Siop Nain\u0027.\nOwain Alaw oedd yn gyfrifol am drefnu fersiwn gwreiddiol James James a rhoi i’r gân y naws emynyddol a’i gwnaeth yn gân dorfol boblogaidd: mae copïau llawysgrif cynnar yn awgrymu mai alaw ddawns ysgafn yn amseriad cyfansawdd 6/8 oedd ei ffurf wreiddiol gan James James, a oedd yn delynor poblogaidd a chwaraeai mewn tafarndai yn ei ardal. O fewn ychydig flynyddoedd, daeth y gân yn adnabyddus mewn eisteddfodau, a’i defnyddio’n gân gystadleuol gan gorau yn ogystal ag yn gân i’w chanu i gloi defodau a chyngherddau. Ceir tystiolaeth er enghraifft iddi gael ei chanu fwy nag unwaith yn Eisteddfod Genedlaethol Aberystwyth yn 1865, ac fe’i poblogeiddiwyd gan Eos Morlais wedi iddo ei chanu yn Eisteddfod Genedlaethol Bangor yn 1874.\nFe’i canwyd am y tro cyntaf mewn gêm rygbi ryngwladol ar achlysur gornest fawr Cymru yn erbyn Seland Newydd yn 1905 a hi oedd yr anthem genedlaethol gyntaf i gael ei chanu ar ddechrau gêm fawr. Mae ei phoblogrwydd mewn gemau rygbi rhyngwladol yn yr 20g. wedi sicrhau ei bod yn adnabyddus fel anthem ar draws y byd, ac fe’i cynhwysir yn rheolaidd mewn casgliadau printiedig o anthemau cenedlaethol y gwledydd. Mae ei symudiad llyfn a’r uchafbwyntiau a geir yn y gytgan yn ei gwneud yn gân addas tu hwnt i dorfeydd, ac fe’i hystyrir yn gyffredinol yn un o’r goreuon o blith anthemau cenedlaethol.",
  "wikiArticle": "Anthem genedlaethol Cymru yw Hen Wlad fy Nhadau. Ysgrifennwyd y geiriau gan Evan James , a chyfansoddwyd y dôn gan ei fab James James ym mis Ionawr 1856. Roedd y ddau yn drigolion o Bontypridd. Gwehydd a bardd oedd y mab, a thelynor oedd y tad.\nYmddengys y sgwennwyd y geiriau fel ymateb i wahoddiad gan y bardd a dderbyniasai gan ei frawd i ymuno ag ef yn yr Unol Daleithiau, lle’r oedd cynifer o Gymry’r cyfnod yn chwilio am well byd, a bod y gân yn ddatganiad fod gwlad genedigaeth y bardd yn ddigon da iddo ef. Rhoddwyd iddi yr enw ‘Glan Rhondda’, gan mai ar lannau’r afon, yn ôl traddodiad, y daeth yr alaw i feddwl y cyfansoddwr.\nPerfformiwyd y gân, neu \u0027Glan Rhondda\u0027 fel y gelwid hi\u0027n wreiddiol, am y tro cyntaf yn festri Capel Tabor, Maesteg yn Ionawr neu Chwefror 1856, gan gantores leol, Elizabeth John. Argraffwyd y geiriau\u0027n unigrhagor ar ffurf baled, ac wedi hynny, daeth y gân yn boblogaidd drwy\u0027r ardal. Daeth hi\u0027n fwy adnabyddus fyth yn Eisteddfod Llangollen, 1858, ar ôl i Llewelyn Alaw  o Aberdâr ddod yn fuddugol mewn cystadleuaeth yn gofyn am gasgliad o alawon Cymreig oedd heb eu cyhoeddi. Fodd bynnag, ni phriodolwyd y geiriau i Evan a James James!\nCynhwyswyd y geiriau a\u0027r alaw, eto yn ddienw, gan feirniad y gystadleuaeth, John Owen yn ei gasgliad cyntaf o Gems of Welsh Melody a gyhoeddwyd gan Isaac Clarke yn Rhuthun yn 1860. Dyma\u0027r argraffiad cyntaf o\u0027r geiriau a\u0027r alaw ac fe\u0027u hargraffwyd yn yr adeilad du-a-gwyn a elwir heddiw yn \u0027Siop Nain\u0027.\nOwain Alaw oedd yn gyfrifol am drefnu fersiwn gwreiddiol James James a rhoi i’r gân y naws emynyddol a’i gwnaeth yn gân dorfol boblogaidd: mae copïau llawysgrif cynnar yn awgrymu mai alaw ddawns ysgafn yn amseriad cyfansawdd 6/8 oedd ei ffurf wreiddiol gan James James, a oedd yn delynor poblogaidd a chwaraeai mewn tafarndai yn ei ardal. O fewn ychydig flynyddoedd, daeth y gân yn adnabyddus mewn eisteddfodau, a’i defnyddio’n gân gystadleuol gan gorau yn ogystal ag yn gân i’w chanu i gloi defodau a chyngherddau. Ceir tystiolaeth er enghraifft iddi gael ei chanu fwy nag unwaith yn Eisteddfod Genedlaethol Aberystwyth yn 1865, ac fe’i poblogeiddiwyd gan Eos Morlais wedi iddo ei chanu yn Eisteddfod Genedlaethol Bangor yn 1874.\nFe’i canwyd am y tro cyntaf mewn gêm rygbi ryngwladol ar achlysur gornest fawr Cymru yn erbyn Seland Newydd yn 1905 a hi oedd yr anthem genedlaethol gyntaf i gael ei chanu ar ddechrau gêm fawr. Mae ei phoblogrwydd mewn gemau rygbi rhyngwladol yn yr 20g. wedi sicrhau ei bod yn adnabyddus fel anthem ar draws y byd, ac fe’i cynhwysir yn rheolaidd mewn casgliadau printiedig o anthemau cenedlaethol y gwledydd. Mae ei symudiad llyfn a’r uchafbwyntiau a geir yn y gytgan yn ei gwneud yn gân addas tu hwnt i dorfeydd, ac fe’i hystyrir yn gyffredinol yn un o’r goreuon o blith anthemau cenedlaethol.\r\n\r\n== Recordiad cyntaf ==\n\nGwnaed y recordiad Cymraeg cyntaf, sydd yn hysbys, yn Llundain ar 11 Mawrth 1899, pan recordiwyd y gantores Madge Breese gan y Gramophone Company. Ymhlith y caneuon roedd yr anthem genedlaethol, a gwnaed y recordiad gwreiddiol ar ddisg unochrog 7 modfedd ac mae copi o’r anthem yn dal i oroesi hyd heddiw, ac yn rhan o gasgliadau y Llyfrgell Genedlaethol.\r\n\r\n== Amrywiadau ==\nDefnyddir fersiynau o’r anthem gan Gernyw, Bro Goth Agan Tasow ac yn Llydaw ers 1902, Bro Gozh ma Zadoù. Mae’n debyg fod fersiwn i’w chael yn India yn ogystal. Mae pobl y Khasi, yng ngogledd ddwyrain y wlad wedi mabwysiadu ein hanthem ni fel un eu hunain. Enw eu hanthem yw Ri Khasi, ac aiff y traddoddiad nôl i’r 1800au, pan aeth cenhadon meddygol Cymraeg drosodd i’r ardal.\nYn y 1970au cafwyd fersiwn roc ohoni gan Tich Gwilym yn null Jimi Hendrix.\nBu cryn dynnu coes ar John Redwood am ei ymdrechion i ganu\u0027r anthem yn ystod cynhadledd Gymreig y Blaid Geidwadol. Yn anffodus, doedd ddim yn gwybod y geiriau, ac ni lwyddodd guddio\u0027r ffaith mai meimio oedd o.\r\n\r\n== Geiriau ==\nMae hen wlad fy nhadau yn annwyl i mi,\nGwlad beirdd a chantorion, enwogion o fri;\nEi gwrol ryfelwyr, gwladgarwyr tra mad,\nDros ryddid collasant eu gwaed.\nCytgan\nGwlad, Gwlad, pleidiol wyf i\u0027m gwlad.\nTra môr yn fur i\u0027r bur hoff bau,\nO bydded i\u0027r heniaith barhau.\nHen Gymru fynyddig, paradwys y bardd,\nPob dyffryn, pob clogwyn, i\u0027m golwg sydd hardd;\nTrwy deimlad gwladgarol, mor swynol yw si\nEi nentydd, afonydd, i mi.\n\nCytgan\nOs treisiodd y gelyn fy ngwlad tan ei droed,\nMae heniaith y Cymry mor fyw ag erioed,\nNi luddiwyd yr awen gan erchyll law brad,\nNa thelyn berseiniol fy ngwlad.\n\nCytgan\nCyfieithiadau:",
  "imageNames": [
    "Patagonia_Anthem.JPG",
    "Photo_of_Y_Ddraig_Goch.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1865,
  "categoryId": "diwylliant",
  "id": "anthem",
  "label": "Hen Wlad fy Nhadau"
}