{
  "wikiSummary": "Daeth baner Cymru yn faner swyddogol Cymru yn 1959. Mae\u0027n dangos draig goch ar faes gwyrdd a gwyn. Am gyfnod, ymddangosodd y ddraig ar fryn gwyrdd, ond mae\u0027r hanneriad llorweddol yn draddodiadol. Hi yw\u0027r unig faner o un o wledydd y Deyrnas Unedig nad yw\u0027n ymddangos ar Faner yr Undeb. Y rheswm hanesyddol am hyn oedd statws gwleidyddol Cymru yng nghyfundrefn gyfreithiol a gweinyddol coron Loegr yn dilyn y Deddfau Uno .\nCymru, Bhwtan a Malta yw\u0027r unig wledydd cyfredol sydd â draig ar eu baneri, er y bu ddraig ar faner Tsieina yn ystod Brenhinllin Qing.",
  "wikiArticle": "Daeth baner Cymru yn faner swyddogol Cymru yn 1959. Mae\u0027n dangos draig goch ar faes gwyrdd a gwyn. Am gyfnod, ymddangosodd y ddraig ar fryn gwyrdd, ond mae\u0027r hanneriad llorweddol yn draddodiadol. Hi yw\u0027r unig faner o un o wledydd y Deyrnas Unedig nad yw\u0027n ymddangos ar Faner yr Undeb. Y rheswm hanesyddol am hyn oedd statws gwleidyddol Cymru yng nghyfundrefn gyfreithiol a gweinyddol coron Loegr yn dilyn y Deddfau Uno .\nCymru, Bhwtan a Malta yw\u0027r unig wledydd cyfredol sydd â draig ar eu baneri, er y bu ddraig ar faner Tsieina yn ystod Brenhinllin Qing.\r\n\r\n== Y Ddraig Goch fel baner y Cymry ==\n\n\n=== Baner cyntaf o\u0027r Ddraig Goch? ===\nFe sonir am y ddraig goch yn hedfan yn yr awel yn y gerdd \u0022Gwarchan Maelderw\u0022 yn ystod Brwydr Catraeth.Yn ogystal fe sonir am yr haul a\u0027r Duw \u0022Hu\u0022. Ysgrifenwyd y gerdd gan Taliesin ond mae\u0027n ymddangos yn y Llyfr Aneirin. Crewyd y faner gan \u0022Archimagus\u0022 neu archdderwydd ar gyfer Maelderw, arweinydd y lluoedd brodorol er mwyn amddiffyn y Brythoniaid. Mae\u0027r faner hon yn cynnwys delwedd o\u0027r arweinydd, yr haul a\u0027r ddraig goch. Roedd y derwyddon Gwyddelig hefyd yn paratoi baneri\u0027r haul i\u0027w harweinwyr, sef y faner \u0022Dal-greine\u0022.\nMae\u0027r cyfeiriad yn darllen mewn Cymraeg Canol \u0022Disgleiryawr ac archawr tal achon//arrud dhreic fud pharaon\u0022, sydd yn anodd ei chyfiethu\u0027n gywir, ond mae \u0022rud dhreic\u0022 yn gallu cael ei chyfieithu i \u0022draig goch\u0022. Mae \u0022pharaon\u0022 i\u0027w weld yn Lludd and Llefelys, am y ddwy ddraig dan adeilad Gwrtheyrn, gan awgrymu fod y dyfyniad hwn yn ffynhonnel ar gyfer stori\u0027r Mabinogi, lle mae\u0027r ddraig yn goch unwaith eto. Mae\u0027n bosib mai dyma\u0027r cyfeiriad cyntaf at ddraig goch yn llenyddiaeth Cymru yn y 6g. Y gair \u0022pharaon\u0022 yw\u0027r enw hynafol ar Ddinas Emrys, ac mae\u0027r cyfeiriad hon dwy ganrif cyn cofnod Nennius yn Historia Brittonum o stori Lludd a Llefelys; arwydd posib o darddiad hyd yn oed hŷn na hyn.\nGwelir y farddoniaeth gwreiddiol o Gwarchan Maeldrw ac ymdrech i\u0027w gyfieithu .\n\n\n=== Owain Glyndŵr ===\n\nAdnabuwyd baner Owain Glyndŵr fel \u0027Y Ddraig Aur\u0027. Fe\u0027i codwyd yn enwog dros Gaernarfon yn ystod Brwydr Tuthill yn 1401 yn erbyn y Saeson. Dewisodd Glyndŵr i chwifio safon draig aur ar gefndir gwyn, y safon draddodiadol a ddefnyddiodd Uthr Benddraig, fel arewinydd y Brythoniaid Celtaidd cyntaf wrth iddynt frwydro yn erbyn y Sacsoniaid bron i 1,000 o flynyddoedd ynghynt, cyn iddo drosglwyddo\u0027r symbol i’w fab y Brenin Arthur.\nAdroddir Adam o Wysg mai draig aur Glyndwr oedd y defnydd cyntaf o safon draig a ddefnyddiwyd mewn rhyfel gan filwyr Cymru ar y 1af o Dachwedd, 1401.  Ychwanega\u0027r hanesydd John Davies fod y ddraig a godwyd gan Glyndŵr yn symbol o fuddugoliaeth i\u0027r Brythoniaid Celtaidd.\n\n\n=== Hari Tudur ===\n\nAr feddrod Edmwnd Tudur, mae ei ddelw yn gwisgo coron wedi\u0027i gosod gyda \u0022draig Cadwaladr\u0022.  Yn dilyn buddugoliaeth ei fab ym Mrwydr Maes Bosworth, defnyddiodd Harri VII ddraig goch ar gefndir gwyn a gwyrdd wrth fynd i mewn i Eglwys Gadeiriol Sant Pawl. Defnyddiodd Harri’r VII fotiff y ddraig fel rhan o herodraeth tŷ Tuduraiddyn hytrach na Chymru. Defnyddiwyd \u0022draig Cadwaladr\u0022 fel cefnogwr ar arfbeisiau brenhinol holl sofraniaid Tuduraidd Lloegr ac ymddangosodd hefyd ar safonau Harri VII a Harri VIII.\n\n\n=== Defnydd fodern cyntaf ===\nYn Eisteddfod Lerpwl yn 1840, defnyddiwyd \u0022safon sidan a osodwyd dros gadair y llywydd, ar yr hon a banetiwyd ddraig goch, ar ddaear werdd, gyda ffîn wen - hon, y dywedodd, oedd wedi\u0027i hanfon ato gan Mr Davies o Cheltenham, a oedd o hyd yn barod i gynnal cofiant a dewrder ei ac ein gwlad.\u0022 Roedd y safon sidan hefyd yn cynnwys yr arwyddair \u0022y ddraig goch ddyle gychwyn\u0022. Yn wreiddol awgrymwyd draig aur ac \u0022urdd marchog i Gymru\u0022. Dwy flynydd yn ddiweddarach, defnyddiwyd baneri gyda\u0027r ddraig goch yn Eisteddfod Cymreigyddion y Fenni,1842. Yna, yn 1865, hwyliodd long y Mimosa i Batagonia gan hedfan baner y ddraig goch.\n\n\n=== Bathodyn brenhinol ===\nNi ddaeth y ddraig goch yn fathodyn herodrol brenhinol swyddogol tan 1800, pan gyhoeddodd Siôr III warant brenhinol yn cadarnhau\u0027r bathodyn.\nYn 1901, ychwanegwyd y ddraig goch i arfbais Tywysog Cymru Brenhiniaeth Prydain gan y brenin.\nYn y pen draw, cynigiodd y palas Brydeinig gyfaddawd ar ffurf bathodyn brenhinol newydd yn ystod blwyddyn y coroni yn 1953. Ailgynlluniwyd y ddraig draddodiadol ac ychwanegwyd coron gyda\u0027r arwyddair \u0027Y DDRAIG GOCH DDYRY CYCHWYN\u0027.\n\nDirmygodd Winston Churchill, y prif weinidog ar y pryd, gynllun y bathodyn, fel y datgelir yng nghofnod canlynol y Cabinet o 1953:\n\n\n=== Baner fodern ===\n\nYm phasiant cenedlaethol Cymru 1909, mae\u0027r ddraig Gymreig yn ymddangos yn sefyll ar gefndir gwyn. Mae\u0027r ddraig Gymreig sy\u0027n ymddangos ar y faner ar fwrdd Terra Nova Capten Scott hefyd yn ddraig sefyll ar gefndir gwyn a gwyrdd. Hyd at y pwynt hwn, nid oedd fersiwn safonol o\u0027r ddraig Gymreig.\nDefnyddiwyd y ddraig ar faneri yn ystod digwyddiadau\u0027r bleidlais i fenywod yng Nghymru yn y 1900au a\u0027r 1910au. Roedd dogfennau derbyn y faner yn sywddogol yn cynnwys un nodyn gan un o gyn-aelodau “Gweithiwyd y faner gan Mrs Henry Lewis… [hi] hefyd oedd Llywydd Ffederasiwn Cymdeithasau Pleidlais Merched De Cymru \u002B bu’n arwain adran De Cymru o’r Bleidlais Fawr Gorymdaith yn Llundain ar 17 Mehefin 1911, yn cerdded o flaen ei baner hardd ei hun… Bu’n achlysur gwych, rhyw 40,000 i 50,000 o ddynion \u002B merched yn cymryd rhan yn y daith gerdded o Whitehall drwy Pall Mall, St James’s Street \u002B Piccadilly i’r Albert Hall. Denodd y ddraig lawer o sylw – “Dyma’r Diafol” oedd cyfarchiad un grŵp o wylwyr.” \n\n\n==== Dydd Gwyl Dewi 1910-33 ====\nRhwng 1910 ac 1916 bu sawl apêl gan gyngor trêf Caernarfon i godi baner y ddraig goch ar ben tŵr Eryr castell Caernarfon i gymryd lle baner yr undeb. Dywedodd y maer a dirprwy gwnstabl y castell, Charles A Jones, fod \u0022yr awdurdodau wedi\u0027u cynghori fod dim fath beth â baner Gymreig... dim ond bathodyn\u0022.\nAr Ddydd Gŵyl Dewi 1932, wedi gwisgo mewn dillad beic modur, dringodd John Edward Jones i ben Tŵr yr Eryr, Castell Caernarfon gyda thri arall, gan gynnwys nai David Lloyd George, William RP George. Yno fe wnaethon nhw ostwng Jac yr Undeb, a chodi’r Ddraig Goch a hoelio\u0027r rhaffau i’r poly gyda styfflau a morthwyl. Arweiniodd hyn at ganu Hen Wlad Fy Nhadau gan dyrfa islaw. Wedi hyn, daeth y gwnstabliaeth leol gan roi baner yr undeb yn ôl i fyny. Yn hwyrach, daeth criw o fyfyrwyr Plaid Cymru o Fangor i’r amlwg ar gefn lori, gan dynnu baner yr undeb i lawr unwaith eto, a\u0027i rwygo i ddarnau ar y maes. \nAr ddydd Gwyl Dewi 1933, codwyd baner y Ddraig Goch yngyd a baner yr undeb a pherfformiwyd y seremoni gan David Lloyd-George. Yn fuan wedyn, chwifiwyd baner Cymru ar holl adeiladau\u0027r llywodraeth ar Fawrth y 1af. Sicrhaodd JE Jones fod canghennau Plaid Cymru ar draws y wlad yn pwyso ar yr awdurdodau lleol i wneud yr un peth. Yna trefnodd gynhyrchu mwy o faneri, a\u0027u gwerthu gan wneud elw.\n\n\n=== Defnydd swyddogol ===\nYm 1959, gollyngwyd defnydd y Llywodraeth o faner y bathodyn brenhinol o blaid y faner bresennol ar anogaeth Gorsedd y Beirdd.\nFel arwyddlun, mae draig goch Cymru yn bresennol ar faner genedlaethol Cymru, a ddaeth yn faner swyddogol yn 1959.\r\n\r\n== Diwylliant boblogaidd ==\nYn y ffilm Black Panther, ymddengys baner Cymru yn cynrychioli Cymru annibynnol yn y Cenhedloedd Unedig.",
  "imageNames": [
    "ArbfaisTuduriaid.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1959,
  "categoryId": "diwylliant",
  "id": "baner",
  "label": "Baner Cymru"
}