{
  "wikiSummary": "Roedd Bartholomew Roberts , o Gasnewydd-bach, Sir Benfro, yn fôr-leidr llwyddiannus dros ben yn y Caribî a Gorllewin Affrica rhwng 1719 a 1722. Ei enw genedigol oedd John Roberts ond mae\u0027n fwy adnabyddus dan yr enw Barti Ddu er na ddefnyddiwyd yr enw hwnnw yn ystod ei fywyd . Ef oedd y môr-leidr mwyaf llwyddiannus yn ôl y nifer o longau a gipiodd sef 470 yn ystod ei fywyd.",
  "wikiArticle": "Roedd Bartholomew Roberts , o Gasnewydd-bach, Sir Benfro, yn fôr-leidr llwyddiannus dros ben yn y Caribî a Gorllewin Affrica rhwng 1719 a 1722. Ei enw genedigol oedd John Roberts ond mae\u0027n fwy adnabyddus dan yr enw Barti Ddu er na ddefnyddiwyd yr enw hwnnw yn ystod ei fywyd . Ef oedd y môr-leidr mwyaf llwyddiannus yn ôl y nifer o longau a gipiodd sef 470 yn ystod ei fywyd.\r\n\r\n== Ei fywyd cynnar ==\nGanwyd Bartholomew Roberts ym 1682 yng Nghasnewydd-bach, rhwng Dinbych-y-pysgod a Hwlffordd yn Sir Benfro. Ei enw genedigol oedd John Roberts, a chredir mai ei dad oedd George Roberts mwy na thebyg. Nid yw\u0027n wybyddus pam y newidiodd ei enw o John i Bartholomew, ond roedd yn arfer ymhlith môr-ladron i gymryd ffugenwau, ac mae\u0027n bosib iddo gymryd yr enw hwnnw ar ôl y môr-leidr adnabyddus Bartholomew Sharp.  Credir iddo ddechrau ei fywyd ar y môr pan oedd yn 13 yn 1695 ond nid oes unrhyw gofnod arall ohono tan 1718, pan oedd yn fêt ar slŵp ym Marbados.\nYn 1719, roedd Roberts yn ail fêt ar y llong gaethwasaeth Princess, dan arweiniad y Capten Abraham Plumb. Ar ddechrau mis Mehefin, pan oedd y llong wedi\u0027i hangori yn Anomabu yng Ngorllewin Affrica, ymosododd y môr-leidr o Gymru Hywel Davies arni. Roedd Plumb a\u0027i griw ar ddwy long wahanol, y Royal Rover a\u0027r Royal James. Wedi cipio\u0027r llong, gorfodwyd ef i ymuno â chriw y môr-ladron. Pan laddwyd Hywel Davies, chwech wythnos yn ddiweddarach, dewisodd y môr-ladron Roberts i fod yn gapten yn ei le.\nCyn hir yr oedd llawer o siarad am orchestion Barti Ddu a\u0027i long Royal Fortune. Hwyliodd i mewn i lynges o 42 o longau Portiwgal, daliodd garcharor i\u0027w holi pa un o\u0027r llongau oedd y gyfoethocaf ac yna cipiodd y llong honno a\u0027i hwylio ymaith. Dro arall daeth i borthladd yn Newfoundland lle roedd 22 o longau, a ffodd criw pob un ohonynt mewn ofn. Dywedir ei fod yn cadw disgyblaeth dda ar ei griw, ac yn gwahardd diodydd meddwol ar fwrdd ei long.\n\nGyrrodd y Llynges Frenhinol long ryfel, HMS Swallow dan y Capten Chaloner Ogle, i geisio ei ddal, ac yn 1722 bu brwydr rhwng y llong yma a\u0027r Royal Fortune ger Cape Lopez, Gabon. Ar ddechrau\u0027r ymladd safai Roberts yn ei wisg wychaf yn annog ei griw, ond tarawyd ef yn ei wddf gan fwled a\u0027i ladd. Taflwyd ei gorff i\u0027r môr yn ôl ei ddymuniad. Heb eu capten, ildiodd y gweddill o\u0027r criw, a chrogwyd nifer ohonynt.\r\n\r\n== Penglog ac esgyrn ==\n\nDywedir mai ar un o longau Barti y chwifiwyd baner y Penglog a\u0027r Esgyrn am y tro cyntaf. Dywed eraill mai tarddiad y faner ydyw\u0027r Seiri Rhyddion.\r\n\r\n== Ffynhonnell y wybodaeth amdano ==\nY ffynhonnell bwysicaf ar gyfer hanes Roberts yw\u0027r llyfr A General History of the Pyrates, a gyhoeddwyd ychydig flynyddoedd wedi ei farwolaeth. Ar dudalen deitl yn argraffiad cyntaf yn 1724, rhoir yr awdur fel Capten Charles Johnson; mae rhai ysgolheigion yn credu mai Daniel Defoe, yn ysgrifennu dan ffugenw, oedd yr awdur. Rhoddodd Johnson fwy o le yn ei lyfr i Roberts nag i unrhyw un o\u0027r môr-ladron eraill, gan ei ddisgrifio fel:\n\n ... a tall black man, near forty years of age ... of good natural parts and personal bravery, though he applied them to such wicked purposes as made them of no commendation, frequently drinking \u0022Damn to him who ever lived to wear a halter.\u0022\r\n\r\n== Mewn ffuglen ==\nYsgrifennodd T. Llew Jones nofel i blant am Roberts o\u0027r enw Barti Ddu.\r\n\r\n== Rỳm Barti Ddu ==\nYn 2018 lansiwyd rym Barti Ddu Rum gan Jonathan Williams, wedi ei enwi ar ôl y môr-leidr. Mae\u0027r rhym yn cynnwys gwymon a ceir gwahnol flasau. Bu\u0027n rhaid newid enw\u0027r rhym i \u0027Barti Spiced\u0027 oherwydd rheolau Safonnau Masnach sy\u0027n mynnu bod \u0027rhym\u0027 yn 37.5% ABV alcohol. Mae\u0027r ddiod yn cynnwys rwm Caribïaidd wedi\u0027i wneud yn arbenigol, gyda fanila, clof ac oren cynnil, ond gyda bara lawr wedi\u0027i gasglu â llaw.",
  "imageNames": [
    "BartRobCrew.jpg",
    "Bart_Roberts_Trying_Deserters_from_the_Pirates_of_the_Spanish_Main_series_N19_for_Allen_and_Ginter_Cigarettes_MET_DP835008.jpg",
    "Bart_Roberts.jpg",
    "BartholomewRoberts.jpg",
    "General_History_of_the_Pyrates_-_Captain_Bartholomew_Roberts_with_two_Ships.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1682,
  "end": 1722,
  "categoryId": "milwrol",
  "id": "barti-ddu",
  "label": "Barti Ddu"
}