{
  "wikiSummary": "Nyrs yn Rhyfel y Crimea oedd Elizabeth \u0022Betsi\u0022 Cadwaladr . Newidiodd ei henw i Elizabeth Davies pan oedd yn gweithio yn Lerpwl am nad oedd y Saeson yn gallu ynganu ei henw. Enwir Bwrdd Iechyd Prifysgol Betsi Cadwaladr ar ei hôl.\nBrodor o ardal Llanycil ger y Bala oedd Betsi ac yn ferch i weinidog o\u0027r enw Dafydd Cadwaladr . Ym 1854, a hithau\u0027n chwe-deg-pump oed, penderfynodd fynd yn nyrs i Ryfel y Crimea ar ôl darllen am ddioddefaint y milwyr yno. Roedd cannoedd o filwyr yn marw am nad oedd digon o nyrsys a meddygon ar gael.",
  "wikiArticle": "Nyrs yn Rhyfel y Crimea oedd Elizabeth \u0022Betsi\u0022 Cadwaladr . Newidiodd ei henw i Elizabeth Davies pan oedd yn gweithio yn Lerpwl am nad oedd y Saeson yn gallu ynganu ei henw. Enwir Bwrdd Iechyd Prifysgol Betsi Cadwaladr ar ei hôl.\nBrodor o ardal Llanycil ger y Bala oedd Betsi ac yn ferch i weinidog o\u0027r enw Dafydd Cadwaladr . Ym 1854, a hithau\u0027n chwe-deg-pump oed, penderfynodd fynd yn nyrs i Ryfel y Crimea ar ôl darllen am ddioddefaint y milwyr yno. Roedd cannoedd o filwyr yn marw am nad oedd digon o nyrsys a meddygon ar gael.\r\n\r\n== Plentyndod ac ieuenctid ==\nBu farw ei mam tua 1795-6, a bu o dan ofal chwaer hyn nas hoffai. Derbyniwyd hi ar aelwyd Simon Lloyd o Blas-yn-dre, perchen tyddyn ei thad, a thriniwyd hi\u0027n garedig yno, ble dysgodd ddawnsio a chanu\u0027r delyn, ond ffodd i Lerpwl yn bedair-ar-ddeg oed; glynodd yn dynn yno wrth yr achos Methodistaidd. Bu ar nifer o deithiau gyda theulu ei meistr gan ymweld ag amryw o wledydd ar y Cyfandir. Dychwelodd i\u0027r Bala, ond ffodd drachefn, i Gaer, ac er mwyn osgoi priodi, dihangodd i Lundain, lle y bu\u0027n aros yng nghartref John Jones, Glan-y-gors, Pentrefoelas. Honnai ei bod yn perthyn o bell iddo.\r\n\r\n== Crwydro\u0027r byd a Shakespeare ==\nYmwelodd a\u0027r Bala yn 1820, a disgrifiodd y lle fel \u0027lle diflas\u0027. Yna aeth yn forwyn i deulu capten llong, a bu\u0027n crwydro\u0027r byd am flynyddoedd, gan gyfarfod pob math o bobl . Actiodd rhannau o ddramâu Shakespeare ar fwrdd y llong a \u0027mynd drwy anturiaethau cynhyrfus\u0027. Ymdyngodd yn erbyn priodi a chredir ei bod yn ferch wrywaidd braidd. Wedi dychwelyd i Loegr, collodd ei henillion, ac aeth drachefn i wasnaethu. Dywedodd Charles Kemble iddi actio rhannau allan o Hamlet yng nghegin ei meistr, a chynigiodd iddi le yn ei gwmni drama gyda thâl o £50 yr wythnos. Bu yng Ngogledd Cymru yn 1844-5, ac yn y De yn 1849, gan fynychu sasiynau hefyd. Gadawodd ei meistr lawer o arian iddi, ond collodd hwnnw drwy driciau cyfreithiol mae\u0027n debyg. Wedi hynny aeth yn weinyddes yn Guy\u0027s Hospital, Llundain ac arweiniodd hynny iddi dderbyn cynnig i fynd i weini i\u0027r Crimea yn 1854.\r\n\r\n== Cyrraedd Twrci ==\nYng nghanol Rhyfel y Crimea , cyrhaeddodd Beti Cadwaladr ysbyty baracs Selimiye , Twrci lle roedd Florence Nightingale yng ngofal y nyrsys. Dros gyfnod y rhyfel bu farw 6,000 o filwyr yn y baracs hwn. Gwrthododd Florence Nightingale gymorth Beti a\u0027r nyrsys eraill a ddaeth drosodd, gan ddweud bod digon o nyrsys ar gael.\nRoedd hi\u0027n daith chwe niwrnod i\u0027r milwyr clwyfedig ddod o\u0027r Crimea, ac roedd Beti yn gweld hyn yn ffolineb llwyr. Fe benderfynodd fynd dros y môr i\u0027r Crimea atynt, ac aeth â nyrsys eraill gyda hi i ysbyty yn Balaclava. Gweithiodd Beti a\u0027r lleill yn galed mewn amgylchiadau anodd iawn. Yn wir o fewn blwyddyn yr oedd yn sâl ei hun, a bu\u0027n rhaid iddi ddod adre at ei chwaer yn Llundain.\nBu farw yn Llundain ar 17 Gorffennaf 1860. Cafodd ei chladdu yn Llundain, ble ceir cofeb iddi.",
  "imageNames": [
    "Betsi_Cadwaladr_grave.jpg",
    "Betsi_Cadwaladr.JPG"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1789,
  "end": 1860,
  "categoryId": "unigolion-nodedig",
  "id": "betsi-cadwaladr",
  "label": "Betsi Cadwaladr"
}