{
  "wikiSummary": "Ar 14 Hydref 1066, trechodd llu o Normaniaid dan arweiniad Gwilym, Dug Normandi, y Saeson ym Mrwydr Hastings. Glaniodd Gwilym a\u0027i wŷr yn Pevensey, ger Hastings, ar ôl hwylio o Normandi. Roedd Gwilym am hawlio coron Lloegr ac roedd yn benderfynol o\u0027i chipio a rheoli teyrnas Lloegr. Wynebodd y Normaniaid a\u0027r Saeson ei gilydd ar Fryn Senlac, ger Hastings, ac yno yr ymladdwyd un o\u0027r brwydrau enwocaf erioed. Yn y frwydr, lladdwyd brenin Lloegr, Harold II, a daeth Gwilym yn frenin Lloegr yn ei le, gan ddod yn Wiliam I .\nDominyddwyd y frwydr gan dactegau\u0027r Normaniaid. Defnyddiasant eu gwŷr saeth a\u0027u marchogion i dorri drwy rengoedd milwyr traed y fyddin Seisnig, a ddibynai bron yn llwyr ar filwyr traed yn absenoldeb saethwyr a heb lawer o farchogion. Bu colledion trwm ar y ddwy ochr. Saethwyd y brenin Harold yn ei lygad, ac fe\u0027i lladdwyd.\nEr bod gwrthryfeloedd a gwrthwynebiad wedi bod yn nodweddion yn nheyrnasiad Wiliam, roedd ei fuddugoliaeth gadarn yn Hastings yn garreg filltir bwysig yn ei goncwest o Loegr. Mae rhai haneswyr yn amcangyfrif bod tua 2,000 o’r goresgynwyr Normanaidd wedi marw adeg y frwydr ond bod dwywaith cymaint o Saeson wedi marw. Sefydlodd Wiliam fynachlog ar safle’r frwydr, gyda’r allor uchaf yn eglwys y fynachlog yn cael ei leoli yn yr union fan lle bu Harold farw.\nCoffeir Brwydr Hastings ym mrodwaith enwog Bayeux.",
  "wikiArticle": "Ar 14 Hydref 1066, trechodd llu o Normaniaid dan arweiniad Gwilym, Dug Normandi, y Saeson ym Mrwydr Hastings. Glaniodd Gwilym a\u0027i wŷr yn Pevensey, ger Hastings, ar ôl hwylio o Normandi. Roedd Gwilym am hawlio coron Lloegr ac roedd yn benderfynol o\u0027i chipio a rheoli teyrnas Lloegr. Wynebodd y Normaniaid a\u0027r Saeson ei gilydd ar Fryn Senlac, ger Hastings, ac yno yr ymladdwyd un o\u0027r brwydrau enwocaf erioed. Yn y frwydr, lladdwyd brenin Lloegr, Harold II, a daeth Gwilym yn frenin Lloegr yn ei le, gan ddod yn Wiliam I .\nDominyddwyd y frwydr gan dactegau\u0027r Normaniaid. Defnyddiasant eu gwŷr saeth a\u0027u marchogion i dorri drwy rengoedd milwyr traed y fyddin Seisnig, a ddibynai bron yn llwyr ar filwyr traed yn absenoldeb saethwyr a heb lawer o farchogion. Bu colledion trwm ar y ddwy ochr. Saethwyd y brenin Harold yn ei lygad, ac fe\u0027i lladdwyd.\nEr bod gwrthryfeloedd a gwrthwynebiad wedi bod yn nodweddion yn nheyrnasiad Wiliam, roedd ei fuddugoliaeth gadarn yn Hastings yn garreg filltir bwysig yn ei goncwest o Loegr. Mae rhai haneswyr yn amcangyfrif bod tua 2,000 o’r goresgynwyr Normanaidd wedi marw adeg y frwydr ond bod dwywaith cymaint o Saeson wedi marw. Sefydlodd Wiliam fynachlog ar safle’r frwydr, gyda’r allor uchaf yn eglwys y fynachlog yn cael ei leoli yn yr union fan lle bu Harold farw.\nCoffeir Brwydr Hastings ym mrodwaith enwog Bayeux.\r\n\r\n== Cefndir ==\nPan fu farw Edward y Cyffeswr ar 5 Ionawr 1066 nid oedd ganddo unrhyw etifedd i\u0027w olynu, ac o ganlyniad cynigiodd sawl ymgeisydd eu hawl ar goron Lloegr. Serch hynny, olynwyd Edward yn syth gan Iarll Wessex, sef Harold Godwinson. Etholwyd Harold yn frenin gan Senedd Lloegr, sef y Witenagemot a choronwyd ef gan Ealdred, Archesgob Caerefrog. Wynebodd Harold her i\u0027w frenhiniaeth yn syth gan ddau reolwr pwerus oedd yn gymdogion iddo. Yr un cyntaf oedd Dug Gwilym o Normandi, a oedd yn honni bod coron Lloegr wedi cael ei addo iddo gan y Brenin Edward, a bod Harold yntau hefyd wedi tyngu llw i gytuno â’r trefniant hwn. Roedd Harald Hardrada, Brenin Norwy, hefyd yn cyflwyno ei gais am y goron yn Lloegr. Seiliwyd ei gais ar gytundeb rhwng ei ragflaenydd, Magnus Dda, ac un o frenhinoedd cynharach Lloegr, sef Harthacnut. Yn ôl y cytundeb hwnnw, petai naill neu’r llall yn marw, byddai’r llall yn etifeddu Lloegr a Norwy. Penderfynodd Wiliam a Harald Hardrada yn syth eu bod yn mynd i drefnu lluoedd a llongau ar gyfer lansio goresgyniadau yn annibynnol ar ei gilydd.\nTreuliodd y Brenin Harold gyfnod sylweddol yng nghanol 1066 ar yr arfordir deheuol gyda byddin fawr a fflyd o longau yn barod am oresgyniad Wiliam. Roedd nifer sylweddol o’i filwyr yn filisia oedd angen cynaeafu eu cnydau, ac felly ar 8 Medi penderfynodd Harold ei fod am ryddhau’r milisia a’r fflyd o’u dyletswyddau. Wedi iddo glywed bod Harald Hardrada, Brenin Norwy, a’i gefnogwyr wedi ymosod ar ogledd Lloegr, rhuthrodd Harold Godwinson a’i fyddin i gwrdd â nhw, gan gasglu lluoedd ychwanegol ar y ffordd, a rhoddwyd syrpreis i\u0027r Norwyaid. O ganlyniad trechwyd Harald ym Mrwydr Stamford Bridge ar 25 Medi. Lladdwyd Harald Hardrada a’i gefnogwr, Tostig, sef brawd Harold Godwinson, a dioddefodd y Norwyaid lawer o golledion, gan mai ond 24 o’r 300 o longau a gychwynnodd o Norwy oedd eu hangen i gludo’r rhai a oroesodd yn ôl yno. Dioddefodd y Saeson lawer o golledion hefyd, ac roedd byddin Harold wedi ei gwanhau yn ddirfawr.\nYn y cyfamser, aeth Wiliam ati i gasglu fflyd fawr at ei gilydd ynghyd â byddin o Normandi a gweddill Ffrainc, gan gynnwys lluoedd o Lydaw a Fflandrys. Treuliodd bron i naw mis yn paratoi, oherwydd bu\u0027n rhaid iddo gynllunio ac adeiladu fflyd o’r newydd.\nWedi trechu ei frawd Tostig a Harald Hardrada yn y gogledd, gadawodd Harold Godwinson lawer o’i luoedd yn y gogledd, gan gynnwys Morcar ac Edwin. Gorymdeithiodd gweddill ei fyddin yn ôl am dde Lloegr er mwyn delio â\u0027r bygythiad Normanaidd oedd ar y gorwel.\nEr bod Harold wedi ceisio rhoi syrpreis i\u0027r Normaniaid, adroddwyd gan ysbïwyr Wiliam bod y Saeson ar eu ffordd yn ôl i\u0027r de. Arweiniodd Wiliam ei fyddin o’i gastell a symud tuag at y gelyn. Penderfynodd Harold gymryd safle amddiffynnol ar ben Bryn Senlac .\r\n\r\n== Tactegau ==\nDechreuodd y frwydr gyda’r saethwyr Normanaidd yn saethu i fyny’r bryn at y Saeson, oedd wedi creu mur o dariannau amddiffynnol ar ben Bryn Senlac. Ond nid oedd hon yn dacteg effeithiol iawn. Roedd prinder saethwyr gan y Saeson yn rhwystr i\u0027r saethwyr Normanaidd, oherwydd nid oedd digon o saethau i\u0027w casglu a’u hail-ddefnyddio.  Wedi ymosodiad y saethwyr, gorchmynodd Wiliam y picellwyr ymlaen er mwyn ymosod ar y Saeson. Cyfarfu’r Normaniaid â llu o daflegrau, oedd yn cynnwys gwawyffyn, bwyeill a cherrig, ond nid saethau. Methodd milwyr traed Wiliam dorri mur y tariannau oedd gan filwyr Harold, ac felly anfonwyd y cafalri i\u0027w cefnogi. Er hynny, methodd y cafalri hefyd dorri’r mur, ac felly gorfodwyd lluoedd Wiliam i encilio. Rhoddwyd y bai ar yr uned o Lydaw oedd ar y chwith i Wiliam. Lledaenwyd si hefyd bod Wiliam wedi cael ei ladd ac ychwanegodd hyn at ddryswch y sefyllfa. Dechreuodd lluoedd y Saeson ruthro ar ôl y gelyn Normanaidd oedd yn ceisio ffoi, ond marchogodd Wiliam drwy ganol ei luoedd, er mwyn dangos ei wyneb gan waeddi ei fod dal yn fyw. Penderfynodd Dug Normandi lansio gwrth-ymosodiad yn erbyn y lluoedd Seisnig oedd yn rhedeg ar eu holau; ceisiodd rhai o’r Saeson ymgynnull ar ben bryn bach cyfagos cyn cael eu gormesu.\nNid oes neb yn siŵr ai bwriad tactegau’r Saeson oedd rhedeg ar ôl y gelyn Normanaidd ar orchymyn Harold, ynteu ai tacteg byr-rybudd oedd hon. Mae Brodwaith Bayeux yn dangos bod marwolaeth brodyr Harold, sef Gyrth a Leofwine, wedi digwydd cyn yr ymladd ar y bryn bach cyfagos. Gall hyn fod yn dystiolaeth mai’r ddau frawd a arweiniodd y dacteg i redeg ar ôl y gelyn.\nMae’n ddigon posib bod seibiant wedi bod yn yr ymladd ar ddechrau’r prynhawn gan fod angen toriad i gael gorffwys a bwyd. Mae\u0027n ddigon posib hefyd bod angen amser ychwanegol ar Wiliam i weithredu tactegau newydd. Petai’r Normaniaid yn medru anfon cafalri yn erbyn y mur tariannau ac yna denu’r Saeson i redeg ar eu holau, gellid creu hollt yn llinell amddiffynnol y Saeson.  Er ei bod yn ddigon posib nad oedd y tactegau esgus ffoi wedi torri’r llinellau, mae\u0027n ddigon posib eu bod wedi gwasgaru\u0027r teuluwyr yn y mur o dariannau. Disodlwyd y teuluwyr, sef aelodau o warchodlu brenhinol Harold, gan aelodau’r ‘fyrd’, sef y milisia Seisnig cyn cyfnod y Normaniaid, ac felly ailgryfhawyd y mur o dariannau. Mae’n edrych yn debyg bod saethwyr wedi cael eu defnyddio eto cyn ac yn ystod yr ymosodiad gan y cafalri a’r milwyr traed o dan arweiniad Wiliam. Nid oes modd gwybod faint o ymosodiadau a lansiwyd gan y Normaniaid yn erbyn llinellau’r Saeson, ond mae rhai cofnodion yn dangos tactegau’r Normaniaid a’r Saeson yn ystod y brwydro yn y prynhawn. Yn ôl cofnod Carmen, dywedir bod dau geffyl wedi cael eu lladd tra\u0027r oedd Wiliam yn eu marchogaeth, ond yn ôl adroddiad Wiliam o Poitier bu farw tri cheffyl.\r\n\r\n== Marwolaeth Harold ==\nMae’n debyg bod Harold wedi marw yn ddiweddarach yn y frwydr, er bod adroddiadau gwahanol yn gwrthddweud ei gilydd. Mae Wiliam o Poitier yn cofnodi ei farwolaeth heb amlinellu manylion ynghylch sut digwyddodd hynny.  Mae Tapestri Bayeux yn dangos ffigwr yn dal saeth sydd yn ei lygad, wrth ymyl milwr sy\u0027n disgyn wrth iddo gael ei drywanu gan gleddyf. Uwchlaw\u0027r ddau ffigwr mae\u0027r gosodiad ‘Yma, mae’r Brenin Harold yn cael ei ladd’. Nid yw’n glir pa ffigwr yw Harold, ynteu a yw’n cyfeirio at y ddau ffigwr. Mae’r adroddiad cynharaf, mwyaf traddodiadol, yn sôn am Harold yn marw oherwydd saeth yn ei lygad, ac yn dyddio o’r 1080au. Ysgrifennwyd yr adroddiad hwn am y Normaniaid gan fynach Eidalaidd, Amatus Montecassino. Yn ôl adroddiad Wiliam o Malmesbury cafodd Harold ei ladd gan saeth a drywanodd ei lygad ac a aeth yn syth i\u0027w ymennydd, a bod Harold wedi cael ei anafu gan farchog ar yr un adeg y digwyddodd hyn.\nYn sgil marwolaeth Harold gadawyd lluoedd y Saeson heb arweinydd ac fe ddechreuodd y lluoedd chwalu a gwahanu. Fe wnaeth llawer ffoi, ond fe wnaeth milwyr y llys brenhinol grynhoi o gwmpas corff Harold ac ymladd tan y diwedd. Dechreuodd y Normaniaid redeg ar ôl y lluoedd Seisnig oedd yn ffoi, a heblaw am ymateb milwyr ar safle a adnabuwyd fel ‘Malfosse’, daeth y frwydr i ben.",
  "imageNames": [
    "BattleNormannen.JPG",
    "Battle_Flat_-_geograph.org.uk_-_285158.jpg",
    "Battle_of_Hastings_1066.png",
    "Battleabbey-wyrdlight-0190.jpg",
    "Bayeux_Tapestry_scene51_Battle_of_Hastings_Norman_knights_and_archers.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1066,
  "categoryId": "pwynt-cyfeirio",
  "id": "brwydr-hastings",
  "label": "Brwydr Hastings"
}