{
  "wikiSummary": "Carreg Cadfan yw\u0027r enghraifft gyntaf o\u0027r iaith Gymraeg sy\u0027n dyddio o\u0027r 7-9g.",
  "wikiArticle": "Carreg Cadfan yw\u0027r enghraifft gyntaf o\u0027r iaith Gymraeg sy\u0027n dyddio o\u0027r 7-9g.\r\n\r\n== Lleoliad ==\n\nY tu mewn i Eglwys Sant Cadfan, Tywyn, Gwynedd ceir croes arysgrifiedig o\u0027r enw Carreg Cadfan . Arni y mae\u0027r enghraifft gynharaf, yn ôl pob tebyg, o\u0027r iaith Gymraeg. Ni ddylid cymysgu rhyngddi a\u0027r garreg sy\u0027n coffáu Cadfan ap Iago yn eglwys Llangadwaladr ym Môn.\nYn wreiddiol roedd y garreg dros 2.3m o uchder, ond mae bellach yn mesur 2.18m o uchder wrth 0.25m wrth 0.2m.\r\n\r\n== Dyddiad ==\nFe\u0027i dyddiwyd gan Ifor Williams i\u0027r 8g ac adlewyrchir y farn honno yn Gwyddoniadur Cymru yr Academi Gymreig. Cynigir dyddiad rhwng y 7g a\u0027r 9g ar Coflein, gwefan Comisiwn Brenhinol Henebion Cymru. Mae astudiaeth ddiweddar gan Patrick Sims-Williams yn dyddio Carreg Cadfan i tua dechrau\u0027r 9g.\r\n\r\n== Ystyr yr arysgrifiadau ==\nDyma ddehongliad Patrick Sims-Williams o\u0027r prif arysgrifau ar y pedair ochr :\n\nA. Tengrumui cimalted gu adgan\nD. ant erunc du but marciau\n\u0027Tengrumwy wraig Addian yn agos iawn i Bud a Meirchiaw.\u0027\n\nB. cun ben celen\nC. tricet nitanam\n\u0027Cun wraig Celyn: erys poen a cholled.\u0027\nAr y garreg hefyd y mae’r hyn a alwodd Ifor Williams yn ddau ‘olnod’. Ar ochr C darlleniad Williams yw:\n\nmort\ncicpe\ntuar\nEi ddehongliad o hyn yw ‘mortcic petuar’ .\nAr ochr A darlleniad Williams yw:\n\nmc\nErtri\nEi ddehongliad o hynny, ar sail cymharu ag olnod C, yw ‘m c er tri’ .\r\n\r\n== Cysylltiadau llenyddol ==\nEr ei phwysiced, cymharol ychydig o sylw a gafodd Carreg Cadfan gan lenorion Cymraeg. Mae\u0027r eithriadau\u0027n cynnwys y cerddi \u0027Cofebion Tywyn\u0027 gan Owain Owain ac \u0027Y boen\u0027 gan Myrddin ap Dafydd.",
  "imageNames": [
    "Carreg_Cadfan.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 810,
  "categoryId": "lleoedd",
  "id": "carreg-cadfan",
  "label": "Carreg Cadfan"
}