{
  "wikiSummary": "Sefydlwyd Castell Caerdydd ar safle ger canol dinas Caerdydd heddiw gan y Normaniaid yn 1091, ar safle caer Rufeinig. Gwelir gweddillion y gaer honno ar y safle hyd heddiw. Ychwanegwyd castell ffug gan Ardalydd Bute yn y 19g.",
  "wikiArticle": "Sefydlwyd Castell Caerdydd ar safle ger canol dinas Caerdydd heddiw gan y Normaniaid yn 1091, ar safle caer Rufeinig. Gwelir gweddillion y gaer honno ar y safle hyd heddiw. Ychwanegwyd castell ffug gan Ardalydd Bute yn y 19g.\r\n\r\n== Caer Rufeinig Caerdydd ==\n\nMae rhan helaeth o furiau\u0027r Castell mwnt a beili Normanaidd wedi\u0027u codi ar ben cwrs y muriau Rhufeinig gwreiddiol. Mewn stafelloedd arddangosfa dan y muriau presennol gellir gweld darnau o\u0027r muriau Rhufeinig. Ymddengys i\u0027r gaer gael ei chodi ar safle caer gynharach a godwyd tua diwedd y ganrif gyntaf OC. Adeiladwyd yr ail gaer o gerrig tywodfaen coch, efallai fel amddiffyniad yn erbyn ymosodiadau o\u0027r môr, tua\u0027r flwyddyn 400 OC.\r\n\r\n== Y castell Normanaidd ==\n\nUn o breswylwyr enwocaf y castell oedd Robert Curthose, a garcharwyd yno gan ei frawd ifancach, Brenin Harri I Lloegr, o 1106 tan 1134. Yn 1158, y castell oedd lleoliad herwgipiad beiddgar gan Ifor Bach. Daeth Owain Glyn Dŵr i reoli\u0027r castell yn 1404, gan ei adael i\u0027r Cymry tan i Siaspar Tudur, ewythr Harri Tudur, ei feddiannu yn 1488 fel diolch iddo am ei ran yn ymgyrchoedd ei nai.\r\n\r\n== 20g hyd heddiw ==\nYn ystod y 19g, codwyd castell hynafol ffug gan y pensaer William Burges, a oedd yn gweithio i Ardalydd Bute. Fe\u0027i cynlluniwyd i edrych fel cartref a fyddai\u0027n gweddu i un o straeon y Tylwyth Teg gyda nifer o gerfluniau cain a lluniau i\u0027w addurno. \nAr ddechrau\u0027r 20g, etifeddodd 4ydd Ardalydd Bute y castell a pharhaodd y gwaith adeiladu drwy\u0027r 1920au. Gwerthwyd neu gwladolwyd tiroedd a buddiannau masnachol teulu\u0027r Bute o amgylch Caerdydd ac erbyn yr Ail Ryfel Byd, nid oedd llawer yn eu meddiant heblaw\u0027r castell. Yn ystod y rhyfel, adeiladwyd llochesi cyrch awyr helaeth ym muriau\u0027r castell; gllochesi a allent gysgodi hyd at 1,800 o bobl. Yn ddiweddarach fe\u0027i rhoddwyd i ddinas Caerdydd gan deulu\u0027r Bute ar 4 Medi 1947. Mae bellach yn atyniad twristaidd poblogaidd ac mae\u0027n gartref i amgueddfa lleng-filwrol, yn ogystal â gweddillion yr hen gastell.\r\n\r\n== Mynediad a chyfleusterau ==\nLleolir y castell yng nghanol Caerdydd a saif wrth ymyl Parc Bute. Lleolir canolfan ddinesig Parc Cathays gerllaw hefyd, ynghyd â\u0027r prif strydoedd siopa.\nMae\u0027n gartref i ddawns haf Prifysgol Caerdydd bob blwyddyn a chynhelir Mardi Gras mwyaf Cymru ar gaeau\u0027r castell bob mis Awst.\nGyda lle i dros ddeng mil o bobl ymgynull, manteisiwyd ar hyn i gynnal nifer o gyngherddau roc a pherfformiadau byw, gan gynnwys un gan y grŵp Stereophonics ym mis Mehefin 1998.",
  "location": {
    "lat": 51.4823,
    "long": -3.1812
  },
  "imageNames": [
    "Aerial_view_of_Cardiff_Castle.jpg",
    "Animal_Wall_Cardiff.jpg",
    "ArabRoom.jpg",
    "Cardiff_Castle.JPG",
    "Cardiff_Castle_-_Bankettsaal_2.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1091,
  "categoryId": "lleoedd",
  "id": "castell-caerdydd",
  "label": "Castell Caerdydd"
}