{
  "wikiSummary": "Castell canoloesol yn nhref Conwy ar lan afon Conwy yw Castell Conwy. Cynllunwyd y castell gan y pensaer Ffrengig James o St George ac fe\u0027i adeiladwyd gan Edward I, brenin Lloegr, er fod Rhisiart o Gaer yn gyfrifol yn y dechrau . Adeiladwyd y castell a\u0027r dref gaerog ar ben adfeilion Abaty Aberconwy, a ddinistrwyd gan Edward er mwyn defnyddio\u0027r safle, ac mae mur o gwmpas y dref gyfan gan mai Saeson oedd trigolion y dref newydd. Roedd Castell Conwy, yn wahanol i nifer o gestyll eraill James o St George, heb fod yn gonsentrig ond yn cael ei godi yn ôl cynllun llinellol oherwydd ffurf y safle creigiog. Mae\u0027r wyth tŵr anferth gyda\u0027u tyredau a\u0027r muriau cysylltu i gyd yn gyfan.\nMae\u0027r castell yng ngofal Cadw. Fe\u0027i gosodwyd ar restr Safleoedd Treftadaeth y Byd UNESCO yn 1986, fel rhan o\u0027r safle Cestyll a Muriau Trefi\u0027r Brenin Edward yng Ngwynedd.",
  "wikiArticle": "Castell canoloesol yn nhref Conwy ar lan afon Conwy yw Castell Conwy. Cynllunwyd y castell gan y pensaer Ffrengig James o St George ac fe\u0027i adeiladwyd gan Edward I, brenin Lloegr, er fod Rhisiart o Gaer yn gyfrifol yn y dechrau . Adeiladwyd y castell a\u0027r dref gaerog ar ben adfeilion Abaty Aberconwy, a ddinistrwyd gan Edward er mwyn defnyddio\u0027r safle, ac mae mur o gwmpas y dref gyfan gan mai Saeson oedd trigolion y dref newydd. Roedd Castell Conwy, yn wahanol i nifer o gestyll eraill James o St George, heb fod yn gonsentrig ond yn cael ei godi yn ôl cynllun llinellol oherwydd ffurf y safle creigiog. Mae\u0027r wyth tŵr anferth gyda\u0027u tyredau a\u0027r muriau cysylltu i gyd yn gyfan.\nMae\u0027r castell yng ngofal Cadw. Fe\u0027i gosodwyd ar restr Safleoedd Treftadaeth y Byd UNESCO yn 1986, fel rhan o\u0027r safle Cestyll a Muriau Trefi\u0027r Brenin Edward yng Ngwynedd.\r\n\r\n== Hanes ==\nCodwyd Castell Conwy gan frenin Lloegr ar ôl iddo orchfygu Teyrnas Gwynedd, calon Tywysogaeth Cymru annibynnol, yn 1282-83. Roedd yn un o gylch o gestyll newydd - yn cynnwys Castell Caernarfon, Castell Biwmares a Chastell Harlech - a godwyd gan y Saeson o amgylch Gwynedd i\u0027w gwarchod yn nwylo\u0027r brenin rhag y Cymry gwrthryfelgar.\nYm 1401, yn ystod gwrthryfel Owain Glyndŵr, cipiodd ei gefnogwyr Rhys ap Tudur a\u0027i frawd Gwilym ap Tudur y castell, a llosgwyd y dref.\nGefeilliwyd Castell Conwy â Chastell Himeji, Japan mewn seremoni ffurfiol yn Himeji ar 29 Hydref 2019.",
  "location": {
    "lat": 53.28,
    "long": -3.825556
  },
  "imageNames": [
    "Conway_Castle_watercolour_1.jpg",
    "Conwy-Castle-0006.jpg",
    "Conwy_-_Conwy_Castle_-_20190720135715.jpg",
    "Conwy_Castle_Conwy_-_geograph.org.uk_-_2485295.jpg",
    "Conwy_Castle_Conwy_-_geograph.org.uk_-_3833058.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1287,
  "categoryId": "lleoedd",
  "id": "castell-conwy",
  "label": "Castell Conwy"
}