{
  "wikiSummary": "Mudiad protest sy\u0027n ymgyrchu dros y Gymraeg ers 1962 yw Cymdeithas yr Iaith. Y cadeirydd presennol yw Owain Meirion. Ers ei sefydlu mae’r Gymdeithas wedi cynnal ei hymgyrchoedd, ei phrotestiadau a\u0027i gweithgareddau er mwyn hyrwyddo’r defnydd o’r Gymraeg ym mywydau bob dydd pobl Cymru ac ennill statws swyddogol iddi.\nYn ystod y 1960au a’r 1970au canolbwyntiodd ar gael dogfennaeth fel trwyddedau, tystysgrifau a biliau wedi eu darparu yn y Gymraeg, bod y Gymraeg yn cael ei rhoi ar arwyddion ffyrdd a bod gwasanaeth radio a theledu yn cael ei ddarparu yn y Gymraeg. Defnyddiwyd dulliau di-drais fel cynnal ralïau, gwrthod derbyn gwasanaethau os nad oeddent yn y Gymraeg, a gwrthod talu am drwyddedau teledu. Cynhaliwyd protestiadau \u0027eistedd\u0027 torfol ar Bont Trefechan, Aberystwyth, pan eisteddodd protestwyr ar draws y bont er mwyn rhwystro’r traffig rhag mynd drosti. Am gyfnod peintiwyd neu difrodwyd arwyddion ffyrdd uniaith Saesneg, dringwyd mastiau darlledu a bu rhai protestwyr yn ymyrryd â stiwdios teledu. Wedi i Gwynfor Evans fygwth y byddai’n ymprydio oni byddai’r Llywodraeth Geidwadol yn cadw at ei haddewid i sefydlu sianel deledu ar gyfer rhaglenni Cymraeg, gorfodwyd y Llywodraeth i gadw at ei gair a sefydlwyd S4C yn 1982. Cafodd aelodau oedd yn torri’r gyfraith eu dirwyo a chafodd eraill eu dedfrydu a’u carcharu wrth iddynt ymgyrchu gyda’r Gymdeithas dros yr iaith.\nMae gweithgareddau ac ymgyrchoedd y Gymdeithas wedi gwneud cyfraniad pwysig at basio deddfau iaith - er enghraifft, yn 1967 a 1993, ac ar ddiwedd yr 20g bu’n hollbwysig wrth sicrhau bod y Gymraeg yn cael ei chynnig gan wasanaethau cyhoeddus Cymru.\nErs dechrau’r 21ain ganrif mae ei hymgyrchoedd wedi pwysleisio pwysigrwydd polisïau ym maes tai a chynllunio ar gyfer dyfodol y Gymraeg mewn cymunedau lleol ar draws Cymru, dyfodol darlledu a\u0027r cyfryngau newydd yn Gymraeg fel y we a’r chwyldro digidol, a sut gellir sicrhau lle blaenllaw i\u0027r Gymraeg yn y datblygiadau hynny. Mae hefyd wedi protestio yn erbyn penderfyniad y Llywodraeth i drosglwyddo cyllid S4C i’r BBC ac yn galw am ddeddf iaith newydd. Roedd hefyd yn ddylanwad pwysig wrth basio Mesur y Gymraeg yn 2011 a oedd yn rhoi statws swyddogol i’r Gymraeg. Llwyddodd hefyd i helpu i sefydlu swydd newydd, sef Comisiynydd y Gymraeg. Ers ei sefydlu, mae enghreifftiau yn hanes y Gymdeithas lle mae wedi defnyddio cyfrifiadau fel un o ffyn mesur cyflwr y Gymraeg, fel y gwnaeth yn 1962 wrth sefydlu’r Gymdeithas ar ôl canlyniadau Cyfrifiad 1961 am gyflwr y Gymraeg. Dyma a wnaeth hefyd wedi Cyfrifiad 2011. Mae Maniffesto Byw y Gymdeithas, a lansiwyd mewn ymateb i ganlyniadau ieithyddol Cyfrifiad 2011, yn ddogfen sy’n amlinellu beth yw amcanion y Gymdeithas er mwyn diogelu dyfodol a lles y Gymraeg yn yr 21ain ganrif.",
  "wikiArticle": "Mudiad protest sy\u0027n ymgyrchu dros y Gymraeg ers 1962 yw Cymdeithas yr Iaith. Y cadeirydd presennol yw Owain Meirion. Ers ei sefydlu mae’r Gymdeithas wedi cynnal ei hymgyrchoedd, ei phrotestiadau a\u0027i gweithgareddau er mwyn hyrwyddo’r defnydd o’r Gymraeg ym mywydau bob dydd pobl Cymru ac ennill statws swyddogol iddi.\nYn ystod y 1960au a’r 1970au canolbwyntiodd ar gael dogfennaeth fel trwyddedau, tystysgrifau a biliau wedi eu darparu yn y Gymraeg, bod y Gymraeg yn cael ei rhoi ar arwyddion ffyrdd a bod gwasanaeth radio a theledu yn cael ei ddarparu yn y Gymraeg. Defnyddiwyd dulliau di-drais fel cynnal ralïau, gwrthod derbyn gwasanaethau os nad oeddent yn y Gymraeg, a gwrthod talu am drwyddedau teledu. Cynhaliwyd protestiadau \u0027eistedd\u0027 torfol ar Bont Trefechan, Aberystwyth, pan eisteddodd protestwyr ar draws y bont er mwyn rhwystro’r traffig rhag mynd drosti. Am gyfnod peintiwyd neu difrodwyd arwyddion ffyrdd uniaith Saesneg, dringwyd mastiau darlledu a bu rhai protestwyr yn ymyrryd â stiwdios teledu. Wedi i Gwynfor Evans fygwth y byddai’n ymprydio oni byddai’r Llywodraeth Geidwadol yn cadw at ei haddewid i sefydlu sianel deledu ar gyfer rhaglenni Cymraeg, gorfodwyd y Llywodraeth i gadw at ei gair a sefydlwyd S4C yn 1982. Cafodd aelodau oedd yn torri’r gyfraith eu dirwyo a chafodd eraill eu dedfrydu a’u carcharu wrth iddynt ymgyrchu gyda’r Gymdeithas dros yr iaith.\nMae gweithgareddau ac ymgyrchoedd y Gymdeithas wedi gwneud cyfraniad pwysig at basio deddfau iaith - er enghraifft, yn 1967 a 1993, ac ar ddiwedd yr 20g bu’n hollbwysig wrth sicrhau bod y Gymraeg yn cael ei chynnig gan wasanaethau cyhoeddus Cymru.\nErs dechrau’r 21ain ganrif mae ei hymgyrchoedd wedi pwysleisio pwysigrwydd polisïau ym maes tai a chynllunio ar gyfer dyfodol y Gymraeg mewn cymunedau lleol ar draws Cymru, dyfodol darlledu a\u0027r cyfryngau newydd yn Gymraeg fel y we a’r chwyldro digidol, a sut gellir sicrhau lle blaenllaw i\u0027r Gymraeg yn y datblygiadau hynny. Mae hefyd wedi protestio yn erbyn penderfyniad y Llywodraeth i drosglwyddo cyllid S4C i’r BBC ac yn galw am ddeddf iaith newydd. Roedd hefyd yn ddylanwad pwysig wrth basio Mesur y Gymraeg yn 2011 a oedd yn rhoi statws swyddogol i’r Gymraeg. Llwyddodd hefyd i helpu i sefydlu swydd newydd, sef Comisiynydd y Gymraeg. Ers ei sefydlu, mae enghreifftiau yn hanes y Gymdeithas lle mae wedi defnyddio cyfrifiadau fel un o ffyn mesur cyflwr y Gymraeg, fel y gwnaeth yn 1962 wrth sefydlu’r Gymdeithas ar ôl canlyniadau Cyfrifiad 1961 am gyflwr y Gymraeg. Dyma a wnaeth hefyd wedi Cyfrifiad 2011. Mae Maniffesto Byw y Gymdeithas, a lansiwyd mewn ymateb i ganlyniadau ieithyddol Cyfrifiad 2011, yn ddogfen sy’n amlinellu beth yw amcanion y Gymdeithas er mwyn diogelu dyfodol a lles y Gymraeg yn yr 21ain ganrif.\r\n\r\n== \u0027Tynged yr Iaith’ y sbardyn i sefydlu Cymdeithas yr Iaith ==\n\nSefydlwyd Cymdeithas yr Iaith Gymraeg, o ran enw, ar 4 Awst 1962 gan grŵp o bobl ifanc a oedd yn mynychu ysgol haf Plaid Cymru ym Mhontarddulais. Ei nod oedd gwella statws yr iaith Gymraeg a’i hatal rhag diflannu drwy roi’r hawl i siaradwyr Cymraeg ddefnyddio’r iaith yn eu bywyd o ddydd i ddydd. Cafodd y bwriad hwn ei ysbrydoli gan ddarlith Saunders Lewis, sef un o sefydlwyr Plaid Cymru, a ddarlledwyd ar Radio’r BBC ar 13 Chwefror 1962. Tynged yr Iaith oedd ei theitl: galwodd Saunders Lewis ar bobl Cymru i weithredu’n uniongyrchol er mwyn “ei gwneud hi’n amhosibl dwyn ymlaen fusnes llywodraeth leol na busnes llywodraeth ganol heb y Gymraeg”. Roedd wedi gobeithio y byddai Plaid Cymru’n gwneud hyn.\u0027Nid dim llai na chwyldro yw adfer yr iaith Gymraeg yng Nghymru. Trwy ddulliau chwyldro yn unig y mae llwyddo\u0027. Dyna oedd byrdwn datganiad herfeiddiol Saunders Lewis mewn un o\u0027r darllediadau pwysicaf yn hanes Cymru, sef Darlith Radio flynyddol y BBC a draddodwyd ar 13 Chwefror 1962.\nGalwodd Saunders Lewis ar Gymry i wrthod llenwi ffurflenni, talu trethi na thalu am drwyddedau os nad oedd yn bosibl gwneud hynny drwy\u0027r Gymraeg. Yn ei farn ef, byddai angen i ymgyrchwyr fod yn barod i dalu dirwyon a wynebu carchar am eu daliadau.  Er bod nifer y siaradwyr Cymraeg yn gostwng, datganodd: \u0027Fe ellir achub y Gymraeg\u0027.\r\n\r\n== Hanes ac ymgyrchoedd y Gymdeithas ==\n\n\n=== Dulliau protestio’r Gymdeithas ===\n\nRoedd y Gymdeithas yn annog ei haelodau i weithredu’n ddi-drais ac yn uniongyrchol er mwyn cyflawni eu hamcanion. Cawsant eu hysbrydoli gan lwyddiant Gandhi yn India a Martin Luther King yn Unol Daleithiau America gan iddynt hwythau ddefnyddio’r dulliau hyn. Gwelwyd dulliau tebyg yn cael eu defnyddio mewn protestiadau yn erbyn boddi Cwm Tryweryn hefyd, ond ni chawsant lawer o effaith. Roedd Saunders Lewis wedi amlinellu sut gallai hyn weithio drwy ddefnyddio achos Trefor ac Eileen Beasley o Langennech, a wrthododd dalu eu trethi lleol rhwng 1952 ac 1960 oni fyddai’r gorchmynion treth yn y Gymraeg. Ar y cyfan, Cymraeg oedd iaith Dosbarth Gwledig Llanelli yn 1951. Ar ddiwedd yr achos llys hir, anfonwyd gorchymyn treth dwyieithog yn y pen draw, ar ôl i feilïaid gymryd dodrefn y Beasleys oddi arnynt deirgwaith.\nRoedd y brotest gyntaf yn 1963 ym Mhont Trefechan, Aberystwyth i orfodi Swyddfa\u0027r Post i gynnig ffurflenni yn y Gymraeg yn ogystal â Saesneg. Cafodd adeiladau eu gorchuddio â phosteri a daeth y traffig i stop gan fod y bont wedi cael ei \u0027meddiannu\u0027 gan y protestwyr am hanner awr. Yn yr un flwyddyn, sefydlodd Owain Owain unig gyhoeddiad y Gymdeithas, sef Tafod y Ddraig - ef hefyd oedd y golygydd a’r un a ddyluniodd y logo.\n\n\n=== Ymgyrchoedd y 1960au a’r 1970au ===\n \n\nCanolbwyntiodd Cymdeithas yr Iaith ar dair prif ymgyrch yn y 1960au a’r 1970au:\n\nSicrhau bod y Gymraeg yn cael ei chydnabod ar ddogfennau swyddogol.  Golygai hyn bod protestwyr yn gwrthod llenwi ffurflenni, talu biliau na phrynu trwyddedau oni bai eu bod yn medru gwneud hynny yn y Gymraeg\nRhoi’r Gymraeg ar arwyddion ffyrdd. Yn y 1970au cynnar, roedd protestwyr yn peintio arwyddion yn wyrdd fel nad oedd pobl yn gallu darllen yr enwau Saesneg fel Newtown neu Lampeter, neu roedden nhw’n tynnu’r arwyddion i lawr ac yn eu gadael y tu allan i adeiladau’r llywodraeth\nCael gwasanaeth radio a theledu yn yr iaith Gymraeg. Er mwyn gwireddu’r amcan hwn, dechreuodd protestwyr yn ddiweddarach yn y 1970au wrthod talu eu trwyddedau teledu, ac yn hytrach brotestio drwy ddringo mastiau radio a theledu, torri i mewn i stiwdios teledu i darfu ar ddarllediadau, ac aeth rhai ar streic newyn.\nGwelwyd ffyrdd eraill o brotestio hefyd, wedi’u creu er mwyn denu cymaint o gyhoeddusrwydd â phosib - meddiannu eiddo, torri i mewn, streiciau newyn, tarfu ar weithrediadau yn y llys, taflu awyrennau papur i mewn i Dŷ’r Cyffredin o’r oriel gyhoeddus. Roedden nhw’n peintio sloganau Cymraeg ar adeiladau busnesau, siopau a swyddfeydd nad oeddent yn darparu eu gwasanaethau yn y Gymraeg. Roedd y protestwyr yn fodlon mynd i’r carchar pe bai angen. Erbyn 1976, roedd 697 o brotestwyr wedi ymddangos yn y llys i wynebu cyhuddiadau o ddifrod troseddol - cafodd 143 ohonynt eu hanfon i’r carchar a bu’n rhaid i lawer mwy ohonynt dalu dirwyon. Golygai hyn mai’r Gymdeithas oedd y grŵp protest mwyaf ers y swffragetiaid.\n\nYn ystod y 1960au a\u0027r 1970au bu nifer o brotestiadau di-drais tebyg, a charcharwyd neu dirwywyd ymgyrchwyr. Ymhlith y rhain roedd y canwr poblogaidd Dafydd Iwan. Enillwyd rhai consesiynau gan y Llywodraeth, gan gynnwys Deddf Iaith 1967, a chynhyrchwyd ffurflenni dwyieithog gan rai cyrff cyhoeddus. Arweiniodd y cyfnod peintio a difrodi arwyddion ffyrdd uniaith Saesneg ar hyd a lled Cymru gan gefnogwyr y Gymdeithas at sefydlu\u0027r egwyddor o arwyddion dwyieithog yng Nghymru. Er nad oedd gan y Gymdeithas erioed fwy na 2,000 o gefnogwyr swyddogol, roedd llawer yn cydymdeimlo ag achos yr iaith Gymraeg, er nad oedden nhw o reidrwydd yn cytuno â’r ffordd roedden nhw’n mynd o’i chwmpas hi.\n\n\n==== Mai 1962: Yr ymgyrch gynaf: gwysion llys Cymraeg ====\nRoedd yr wys, yn symbol o wladwriaeth Lloegr ac o israddoldeb y Gymraeg gan y wladwriaeth honno. Ym Mai 1962 cymerwyd arian o boced Gareth Miles tra yn y ddalfa i dalu dirwy o £1 nad oedd yn bwriadu ei thalu, a hynny am iddo roi pas i gyd-fyfyriwr ar far ei feic ryw chwe mis ynghynt. Yn Rhifyn Awst 1962 o\u0027r Welsh Nation, mae\u0027n annog y darllenwyr i wneud yr un peth ac i ddod i gyfarfod o fudiad iaith newydd ym Mhontarddulais y mis Awst hwnnw.\n\n\n==== 1963: Ffurflenni Treth y Cyngor a\u0027r Dreth Incwm yn Gymraeg ====\nDyma un o ymgyrchoedd cyntaf i Gymdeithas yr Iaith ei hymladd: ymgyrch i gael ffurflen treth y Cyngor yn Gymraeg oedd hon, yn 1963. Brwydr gan Gell Bangor oedd hon, hefyd, \u0027mewn cyfnod pan nad oedd y Gymdeithas [yn genedlaethol] yn weithredol\u0027, chwedl Emyr Llywelyn. Yn ôl Geraint Jones yn ei gyfrol Brwydr yr Iaith, 1962-67:\n\nOwain Owain oedd y Dafydd a Phwyllgor Cyllid Dinas Bangor oedd y Goliath.\nDiolch i Owain a\u0027i ganfasio trylwyr ymysg y cynghorwyr\u0027, pasiwyd i gael ffurflenni Cymraeg o 1 Ebrill 1966 ymlaen.\nDyma, yn fwy na thebyg, fuddugoliaeth gynta\u0027r Gymdeithas. Aeth Cell Bangor ati wedyn i fynnu ffurflen treth incwm Cymraeg, a bu\u0027n llwyddiannus yn hynny hefyd.\n\n\n==== 1963: Tystysgrifau geni a marw yn Gymraeg ====\nDechreuwyd gofyn am dystysgrifau geni ar ddechrau 1964, felly dyma un o\u0027r ymgyrchoedd cyntaf i\u0027w hymladd: ond unigolion oedd wrthi mewn gwirionedd. Roedd pob tystysgrif geni a marw yr adeg honno\u0027n uniaith Saesneg ac aeth nifer o bobl ati i wrthod cofrestru: gweithred a oedd yn dor-cyfraith. Mae\u0027n debyg mai Hywel ap Dafydd a\u0027i briod Almut oedd y cyntaf, ac ef oedd y cyntaf i\u0027w erlyn am wrthod cofrestru ei fab Iwan ac ymddangosodd o flaen Ynadon Caerfyrddin ar 8 Mawrth 1965. Cafodd ddirwy o bunt a thalodd y ddirwy. Trefnodd Tafod y Ddraig gronfa i ddigolledu\u0027r rhieni beiddgar. Cafwyd nifer o rieni\u0027n gwrthod cofrestru ac erbyn dechrau 1966 penderfynodd Bardd Iechyd Cymru beidio ag erlyn ac erbyn 1 Ionawr 1968 daeth yr hawl i gofrestru\u0027n ddwyieithog i rym, yn bennaf drwy Ddeddf yr Iaith Gymraeg 1967 . Oherwydd y Ddeddf hon, hefyd, cafwyd tystysgrifau marwolaeth a phriodas yn ddwyieithog. Y cyntaf i gael Tystysgrif geni yn Gymraeg oedd Guto Orwig, mab Dafydd Orwig, cangen Bangor a\u0027i wraig Beryl.\n\n\n==== Ionawr 1966: Ympryd ====\nYn ôl Gwilym Tudur, y streic lwgu hon oedd y gyntaf o\u0027i bath drwy\u0027r gwledydd Celtaidd, \u0027a\u0027i bwriad oedd dangos diffyg statws y Gymraeg\u0027. Emyr Llywelyn gynigiodd y syniad ac ar . Anghytunodd John Davies, Ysgrifennydd y Gymdeithas, gyda\u0027r cynnig, ac nid yw\u0027n crybwyll y digwyddiad yn y gyfrol Tân a Daniwyd. Y pedwar a ymprydiodd dros gyfnod o 5 diwrnod oedd: Siôn Daniel, Emyr llywelyn, Gareth Miles a Geraint Jones. Cafwyd sylw ledled gwledydd prydain gan gynnwys yn y Guardian, News of the World, Sun, Daily Mirror a phapurau Cymru. Cytunodd Gwynfor Evans, hyd yn oed: \u0022Mae\u0027n ffordd urddasol o dynnu sylw at statws diurddas un o ieithoedd hynaf Ewrop.\u0022\n\n\n=== Newidiadau o ganlyniad i ymgyrchu ===\nLlwyddodd y Gymdeithas i ennill a sicrhau newidiadau yn sgil eu protestiadau.\n\nYn 1964, sefydlwyd Swyddfa Gymreig gydag Ysgrifennydd Gwladol â chyfrifoldeb dros Gymru, yn rhannol er mwyn ymdrin â’r materion a godwyd gan y Gymdeithas a Phlaid Cymru\nSefydlodd y llywodraeth bwyllgor i astudio statws cyfreithiol yr iaith Gymraeg; yn 1965, cafwyd argymhelliad yn ei adroddiad y dylai \u0027unrhyw beth a wneir yn y Gymraeg yng Nghymru fod â’r un grym cyfreithiol â phe bai yn Saesneg\u0027; Roedd Deddf yr Iaith Gymraeg 1967 yn nodi y gallai pobl ddewis defnyddio’r Gymraeg neu Saesneg yn y llys, ac y byddai adroddiadau swyddogol yn cael eu cyhoeddi yn y ddwy iaith\nErbyn 1969 roedd 250 o ffurflenni’r llywodraeth ar gael yn y Gymraeg; 11 yn unig oedd ar gael yn 1964 er enghraifft, a chyflwynwyd disgiau treth ceir yn y Gymraeg yn 1967\nO 1970, penderfynodd y Swyddfa Gymreig mai dim ond enwau llefydd yn y Gymraeg fyddai’n cael eu harddangos ar arwyddion gan eu bod yn poeni y byddai arwyddion dwyieithog yn rhy ddryslyd; Caerdydd oedd y cyntaf i arbrofi ag arwyddion enwau strydoedd dwyieithog; aeth y cynghorau lleol ati i wneud arwyddion yn fwy Cymraeg mewn ardaloedd lle\u0027r oedd y mwyafrif yn siarad Cymraeg, er enghraifft, aeth Dolgelley yn Dolgellau, Llanelly yn Llanelli, Conway yn Conwy\nGwelwyd cynnydd yn nifer yr ysgolion cynradd ac uwchradd cyfrwng Cymraeg.\nGwelwyd newidiadau ym myd darlledu hefyd. Ar ddechrau\u0027r 1970au dechreuodd Cymdeithas yr Iaith ymgyrchu dros wasanaeth darlledu radio a theledu Cymraeg. Cynyddodd y pwysau ar yr awdurdodau darlledu i gynnig gwasanaeth Cymraeg, ac yn 1977 sefydlwyd Radio Cymru gan y BBC. Erbyn 1971-2, roedd rhaglenni teledu Cymraeg ymlaen am 12 awr yr wythnos, gyda rhaglenni o ansawdd gwell megis rhaglen gomedi Fo a Fe o 1970 a oedd yn chwarae ar y gwahaniaethau rhwng gogledd a de Cymru, a darlledwyd yr opera sebon boblogaidd Pobol y Cwm am y tro cyntaf yn 1974.  \n-Roedd cynlluniau hefyd i sefydlu sianel deledu ar wahân ar gyfer rhaglenni Cymraeg ond yn 1979 cyhoeddodd y Llywodraeth Geidwadol na fyddai\u0027n cadw at ei haddewid i sefydlu\u0027r fath sianel. Gan hynny, cyhoeddodd Gwynfor Evans y byddai\u0027n dechrau ymprydio oni byddai\u0027r Llywodraeth yn anrhydeddu ei haddewid. Achosodd y penderfyniad hwn gryn gynnwrf, ac ofnid y gallai arwain at ymgyrchu treisgar. Yn y pen draw ildiodd y Llywodraeth i\u0027r pwysau a chyhoeddwyd ym mis Medi 1980 y darlledid rhaglenni teledu Cymraeg ar y bedwaredd sianel newydd. Lansiwyd Sianel Pedwar Cymru yn 1982.\n\n\n=== ‘Gwnewch bopeth yn Gymraeg’ ===\nCyn y 1960au tueddai\u0027r Gymraeg fod yn iaith yr aelwyd a\u0027r capel a phrin oedd y defnydd o\u0027r iaith mewn cylchoedd eraill. Ond gyda\u0027r adfywiad yn y diddordeb yn y Gymraeg a\u0027r ymgyrchu ar ei rhan, gwelwyd cynnydd yn y mudiadau a chymdeithasau a hyd yn oed busnesau a weithredai drwy gyfrwng y Gymraeg. Cyhoeddwyd llawer mwy o lyfrau Cymraeg a sefydlwyd dwsinau o bapurau bro Cymraeg ledled Cymru.\nDefnyddiwyd y Gymraeg fwyfwy mewn bywyd cyhoeddus ac roedd y Cynulliad Cenedlaethol a sefydlwyd yn 1999 wedi ei gyfundrefnu i weithredu\u0027n ddwyieithog.\r\n\r\n== Yr 21ain ganrif ==\n\nErbyn yr 21g roedd Cymdeithas yr Iaith yn galw am drafodaeth agored ar ddyfodol darlledu a\u0027r cyfryngau newydd yn Gymraeg, a sut gellir sicrhau lle blaenllaw i\u0027r Gymraeg yn y datblygiadau hyn.\n\nY trafodaethau ynglŷn â dyfodol S4C\nPapur gwyrdd y llywodraeth ar siarter newydd y BBC\nEffaith diffodd signalau teledu analog o fewn tair blynedd\nCyfleoedd newydd radio a theledu lleol\nY we a phlatfformau cyfathrebu newydd\nAriannu\u0027r chwyldro digidol yn Gymraeg\nHybu\u0027r rhithfro\nYm mis Ionawr 2011, cyhoeddwyd fod yr academydd Dr Simon Brooks, llywydd Plaid Cymru - Jill Evans, yn ogystal â\u0027r cerddorion Gai Toms, Bryn Fôn a Dafydd Iwan, ymhlith cant o bobl a wrthododd dalu eu trwydded teledu, fel rhan o brotest Cymdeithas yr Iaith Gymraeg yn erbyn y cynlluniau arfaethedig i dorri cyllideb sianel deledu Gymraeg S4C, a\u0027r bwriad i drosglwyddo cyfrifoldeb ariannu\u0027r sianel i ddwylo\u0027r BBC.\n\n\n=== Deddf Eiddo ===\n\nCred Cymdeithas yr Iaith fod dyfodol yr iaith Gymraeg yn dibynnu ar sefydlu dyfodol i gymunedau lleol ym mhob rhan o Gymru. Credant fod polisïau teg ym maes tai a chynllunio yn gwbl hanfodol. Maent yn galw am i\u0027r awdurdodau sicrhau bod gan bobl y gallu i brynu neu rentu tai yn eu cymunedau, ac i beidio â rhoi caniatâd i ddatblygiadau tai a all niweidio\u0027r gymuned leol, yr iaith Gymraeg neu\u0027r amgylchedd naturiol. Ar ddechrau 2004, cychwynnodd Cymdeithas yr Iaith ar flwyddyn o ymgyrchu, er mwyn tynnu sylw at yr angen am Ddeddf Eiddo i Gymru. Ar Fawrth 11 2014, lansiodd aelodau\u0027r mudiad \u0022Fil Eiddo a Chynllunio er budd ein Cymunedau \u0022 yn y Senedd ym Mae Caerdydd.\n\n\n=== Hawliau i\u0027r Gymraeg ===\n\nAr ddechrau\u0027r 21g, galwodd Cymdeithas yr Iaith Gymraeg am Ddeddf Iaith Newydd i Gymru, a fyddai\u0027n ateb anghenion y Gymraeg yn yr oes fodern ac yn sicrhau bod gan bawb yr hawl i ddefnyddio\u0027r iaith ym mhob agwedd ar fywyd, gan gynnwys:\n\nrhoi statws swyddogol i\u0027r Gymraeg\nsicrhau gwasanaeth Cymraeg gan y sector preifat sicrhau lle i\u0027r Gymraeg yn y chwyldro technolegol\nDadleuodd y dylai pethau, megis biliau ffôn neu ffurflenni, er enghraifft, fod ar gael yn ddwyieithog i bawb yng Nghymru. Credant na ddylai siaradwyr Cymraeg orfod mynd allan o\u0027u ffordd i ofyn am wasanaeth yn eu hiaith eu hunain, na bodloni ar ddefnyddio\u0027r Saesneg, gan nad oes gwasanaeth Cymraeg ar gael. Dyma paham eu bod yn galw am Ddeddf Iaith Newydd i sicrhau bod pob math o wasanaethau ar gael yn ddwyieithog.\nYn ystod yr 1980au, dechreuodd Cymdeithas yr Iaith ymgyrchu dros Ddeddf Iaith i sicrhau bod pob cyhoeddiad a hysbysiad swyddogol yn dod yn naturiol ddwyieithog heb orfod gofyn. Ar ôl ymgyrchu caled, gorfodwyd y Llywodraeth Geidwadol i ymateb. Serch hynny, cred llawer fod Deddf Iaith 1993 yn rhy wan.\nYn ôl y Ddeddf byddai bwrdd statudol yn cael ei sefydlu i hyrwyddo\u0027r Gymraeg, a byddai cyrff cyhoeddus yn gorfod paratoi cynlluniau iaith i ddangos sut roeddent am drin y Gymraeg yn deg. Cred y Gymdeithas fod y mesurau hyn yn \u0027ddi-ddannedd, yn ddiddim.\u0027\nAr ddechrau 2007, cyhoeddodd Cymdeithas yr Iaith Gymraeg ei Mesur yr Iaith Gymraeg, mesur a lwyddodd i arwain at basio Mesur y Gymraeg 2011 a sefydlodd statws swyddogol i\u0027r Gymraeg, bron i 50 mlynedd wedi i aelodau\u0027r mudiad eistedd ar bont Trefechan yn galw am y polisi.\nFodd bynnag, ni sefydlodd y Mesur hawl statudol cyffredinol i\u0027r Gymraeg, ac o ganlyniad ail-enwodd Cymdeithas yr Iaith Gymraeg ei grŵp ymgyrchu o\u0027r \u0022ymgyrch deddf iaith\u0022 i\u0027r \u0022grŵp hawliau\u0022.\n\n\n=== Ymateb i ganlyniadau Cyfrifiad 2011 ===\nYn dilyn canlyniadau argyfyngus Cyfrifiad 2011, cynhaliodd y mudiad gyfres o ralïau ar hyd a lled Cymru. Yn y rali gyntaf yng Nghaernarfon cyhoeddodd y mudiad Maniffesto Byw ar gyfer Cymunedau Byw gyda degau o bolisiau wedi eu llunio er mwyn cryfhau\u0027r Gymraeg. Lansiodd y grŵp ymgyrchu slogan \u0022Dwi eisiau byw yn Gymraeg\u0022 yn yr un rali.\nAr Chwefror 6ed 2013 a Gorffennaf 4ydd 2013, aeth dirprwyiaeth o’r Gymdeithas i gwrdd â\u0027r Prif Weinidog Carwyn Jones i bwyso am newidiadau polisi. Ar Chwefror 6ed 2013, addawodd Carwyn Jones i\u0027r Gymdeithas y byddai’n asesu effaith y gyllideb ar y Gymraeg.[angen ffynhonnell] Hyd heddiw, nid oes asesiad wedi ei gyhoeddi.\nCyhoeddwyd fersiwn diwygiedig o\u0027r Maniffesto Byw ym mis Gorffennaf 2013, yn dilyn ymgynghoriad cyhoeddus a chyfarfod cyffredinol arbennig pan basiwyd nifer o welliannau i\u0027r Maniffesto.\nYm mis Awst 2013, ysgrifennodd y mudiad at y Prif Weinidog Carwyn Jones gan roi chwe mis iddo ddatgan ei fwriad i gyflawni chwe newid polisi er lles yr iaith:\n\nAddysg Gymraeg i Bawb\nTegwch Ariannol i\u0027r Gymraeg\nGweinyddu\u0027n fewnol yn Gymraeg\nSafonau Iaith i Greu Hawliau Clir\nTrefn Gynllunio er budd ein Cymunedau\nY Gymraeg yn greiddiol i Ddatblygu Cynaliadwy\nNi chafwyd datganiad o fwriad gan Carwyn Jones erbyn 1 Chwefror 2014, felly cychwynodd y mudiad ymgyrch weithredol a chynhaliwyd nifer o brotestiadau ar hyd a lled y wlad.\n\n\n=== Ymgyrch NA i 8000 o dai yng Ngwynedd a Môn ===\nCynhaliwyd protest gan Gymdeithas yr Iaith yng Nghaernarfon ddydd Sadwrn y 29ain o Fawrth 2014 yn gwrthwynebu\u0027r cynlluniau i adeiladu 8000 o dai yng Ngwynedd a Môn. Yn ôl erthygl ar wefan Cymdeithas yr Iaith, daeth 300 o brotestwyr yno. Ymysg y siaradwyr roedd yr awdures a\u0027r ymgyrchwraig, Angharad Tomos, a Robin Farrar, cyn-Gadeirydd Cymdeithas yr Iaith. Y pryder yw na fydd y bobl a fydd yn symud i\u0027r tai newydd yn siarad y Gymraeg, a bydd hynny\u0027n rhoi \u0027mwy o bwysau ar yr iaith Gymraeg\u0027.\n\n\n=== Diogelwn ===\nYn 2021, lawnsiwyd \u0027Diogelwn\u0027, sef dogfen er mwyn amddiffyn enw tŷ wrth ei werthu.\r\n\r\n== Aelodau nodedig, cyd-aelodau a chefnogwyr ==\n\nJohn Davies\nTedi Millward\nGareth Miles\nMeic Stephens\nOwain Owain\nEmyr Llewelyn\nNed Thomas\nMeredydd Evans\nPennar Davies\nEirian Llwyd\nR. Tudur Jones\nBobi Jones\nFfred Ffransis\nMeinir Ffransis\nMeirion Pennar\nMeri Huws\nSteve Eaves\nBryn Fôn\nSteffan Cravos\nGwenno Teifi\nJamie Bevan\nDafydd Iwan\nEnfys Llwyd\nHelen Greenwood\nAngharad Tomos\nSioned Elin\nAnn Rhys\nMarged Tomos",
  "imageNames": [
    "Y_Gymraeg_Cymdeithas_yr_iaith_Gymraeg_-_Welsh_political_poster.jpg",
    "Baner_Balchder_o_Gymdeithas.jpg",
    "Nid_yw_Cymru_ar_Werth_protest_Aberystwyth_2022.jpg",
    "Protest_Cymdeithas_yr_Iaith_1972.jpg",
    "Protest_gyntaf_Cymdeithas_yr_Iaith_Gymraeg_ar_Bont_Trefechan_Aberystwyth_24825457959.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1962,
  "categoryId": "cymdeithasol",
  "id": "cymdeithas-yr-iaith",
  "label": "Cymdeithas yr Iaith"
}