{
  "wikiSummary": "Un o feirdd enwocaf Cymru a ystyrir yn feistr mawr y cywydd a\u0027r canu serch oedd Dafydd ap Gwilym .  Fe\u0027i cydnabyddir fel un o feirdd pwysicaf Ewrop gyfan yn ei gyfnod. Roedd yn canu yng nghyfnod Beirdd yr Uchelwyr; credir iddo gael ei eni rhywbryd rhwng 1320 - a 1330 ym mhlwyf Llanbadarn Fawr ger Aberystwyth. Meistrolodd y mesur caeth newydd a ddaeth i fri yn y cyfnod hwn sef y cywydd. Credir iddo farw tua 1380 ac iddo gael ei gladdu yn Abaty Ystrad Fflur.",
  "wikiArticle": "Un o feirdd enwocaf Cymru a ystyrir yn feistr mawr y cywydd a\u0027r canu serch oedd Dafydd ap Gwilym .  Fe\u0027i cydnabyddir fel un o feirdd pwysicaf Ewrop gyfan yn ei gyfnod. Roedd yn canu yng nghyfnod Beirdd yr Uchelwyr; credir iddo gael ei eni rhywbryd rhwng 1320 - a 1330 ym mhlwyf Llanbadarn Fawr ger Aberystwyth. Meistrolodd y mesur caeth newydd a ddaeth i fri yn y cyfnod hwn sef y cywydd. Credir iddo farw tua 1380 ac iddo gael ei gladdu yn Abaty Ystrad Fflur.\r\n\r\n== Hanes ==\nRoedd Dafydd o dras uchelwrol. Ei dad oedd Gwilym Gam ap Gwilym ab Einion: ni wyddom ddim amdano, heblaw am y ffaith i\u0027w ewythr, Llywelyn ap Gwilym ab Einion, fod yn gwnstabl yng Nghastell Newydd Emlyn. Bu ei ewythr Eynon, yn swyddog pwysig a thirfeddianwr yng Nghemais yng ngogledd Sir Benfro a chododd fyddin i\u0027r goron Seisnig.\r\n\r\n== Ei gerddi ==\nPrif destunau ei gerddi oedd natur a serch, a fuasai\u0027n bynciau dieithr i farddoniaeth Gymraeg cyn hynny. Un o\u0027i brif themâu yw\u0027r hyn sy\u0027n rhwystro ei garwriaeth; afon, ffenestr, person arall neu hyd yn oed frân yn crawcian uwch ei ben. Y rhwystr mwyaf oll, yn aml, yw anwadalrwydd ei gariad.\r\n\r\n== Marwnadau i Ddafydd gan y beirdd ==\nMae sawl marwnad i Ddafydd ap Gwilym gan ei gyfoeswyr ar glawr. Canodd Iolo Goch farwnad i Ddafydd.",
  "imageNames": [
    "Dafydd_ap_Gwilym_at_Cardiff_City_Hall.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1320,
  "end": 1370,
  "categoryId": "unigolion-nodedig",
  "id": "dafydd-ap-gwilym",
  "label": "Dafydd ap Gwilym"
}