{
  "wikiSummary": "Deddf seneddol yw Deddf yr iaith Gymraeg 1993, sydd yn ddeddf a basiwyd gan Senedd Sansteffan sydd yn rhoi i\u0027r Gymraeg yr un statws a\u0027r Saesneg yng Nghymru mor bell ag y mae\u0027r sector gyhoeddus yn y cwestiwn.",
  "wikiArticle": "Deddf seneddol yw Deddf yr iaith Gymraeg 1993, sydd yn ddeddf a basiwyd gan Senedd Sansteffan sydd yn rhoi i\u0027r Gymraeg yr un statws a\u0027r Saesneg yng Nghymru mor bell ag y mae\u0027r sector gyhoeddus yn y cwestiwn.\r\n\r\n== Hanes ==\nRoedd Deddf Uno 1536 a 1542 wedi deddfu mai Saesneg yn unig fyddai iaith y llysoedd a sefydliadau gweinyddol a chyhoeddus  Roedd Deddf Llysoedd 1942 wedi rhoi yr hawl i ddefnyddio\u0027r Gymraeg tra bod y siaradwr Cymraeg dan fantais wrth siarad Saesneg, ond roedd hyn yn cael ei ddiffinio yn gyfyng iawn. Gwrthdrôdd Deddf yr Iaith Gymraeg 1967 y deddfau hyn gan greu\u0027r cysyniad o statws cyfartal rhwng y ddwy iaith. O ganlyniad paratôdd rhai adrannau o\u0027r Llywodraeth a rhai awdurdodau lleol ddeunydd Cymraeg, ac yn dilyn ymgyrch o ddifrodi arwyddion codwyd rhai arwyddion dwyieithog.\r\n\r\n== Darpariaeth y Ddeddf ==\nDeddf Iaith 1993 a roddodd statws cyfatal i\u0027r Gymraeg a\u0027r Saesneg cyhyd a\u0027i bod yn rhesymol, o ran awdurdodau lleol, cyrff cyhoeddus, y llysoedd a\u0027r Llywodraeth.\nPrif ofynion y ddeddf oedd:\n\ngorfodi cyrff cyhoeddus yng Nghymru i ddarparu gwasanaethau drwy gyfrwng y Gymraeg ac i baratoi cynllun i ddangos sut maen nhw\u0027n bwriadu defnyddio\u0027r iaith\nrhoi hawl i ddefnyddio\u0027r Gymraeg mewn llys barn yng Nghymru\nrhoi\u0027r hawl i gwmnïau ac i elusennau ddefnyddio rhai dogfennau swyddogol yn Gymraeg heb gyfieithiad i\u0027r Saesneg\ncreu Bwrdd yr Iaith Gymraeg i oruchwylio defnydd o\u0027r iaith gan gyrff cyhoeddus ac i gymeradwyo cynlluniau iaith cyrff cyhoeddus\nRoedd y ddeddf yn rhoi hawl i Ysgrifennydd Gwladol Cymru benodi 15 aelod o\u0027r Bwrdd. Gyda sefydliad Cynulliad Cenedlaethol Cymru, mae\u0027r hawl i benodi aelodau i\u0027r Bwrdd wedi pasio i\u0027r cynulliad.\r\n\r\n== Pwnc llosg ==\nMae’r ddeddf hon wedi bod yn bwnc llosg ers cyn ei derbyn. Cafodd y ddeddf ei phasio gan fwyafrif ond ni wnaeth mwyafrif ASau Cymru ei chefnogi. Yn wir, ni fyddai wedi llwyddo oni bai am gefnogaeth Ceidwadwyr o Loegr. Gwrthododd Rhodri Morgan gefnogi\u0027r ddeddf ym 1993, gan ddweud:\n\u0022The Government calls this a Welsh Language Bill, but it would be better described as a Welsh Language Quango Bill. What one could call a Quango for the lingo ...... We shall be abstaining tonight because we hope to have the opportunity before long to do the job properly. That will be done when we revisit the question of a Welsh language messure when we are in Government.\u0022 \nYn y nawdegau, cyfeiriwyd ati fel enghraifft glasurol pam bod angen datganoli a chynulliad i Gymru. Beirniedir y ddeddf gan rai, yn enwedig Cymdeithas yr Iaith am nad oes gorfodaeth ar y sector breifat i gydymffurfio â’i gofynion. Mae Cymdeithas yr Iaith hefyd wedi beirniadu\u0027r ddeddf yn llym am nad yw\u0027n ymdrin â phroblemau cymunedau gwledig Cymraeg eu hiaith.\r\n\r\n== Ffynonellau ==",
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1993,
  "categoryId": "arweinwyr",
  "id": "deddf-iaith-93",
  "label": "Deddf yr Iaith Gymraeg"
}