{
  "wikiSummary": "Roedd Deddfau Cyfreithiau yng Nghymru 1536 a 1542, yn ddwy ddeddf a basiwyd yn San Steffan i \u0022gorffori\u0022 Cymru\u0027n wleidyddol â theyrnas Lloegr yngyd â\u0027i \u0022huno a\u0027i chysylltu\u0022 â hi, ac i ddileu\u0027r iaith Gymraeg. Saesneg o hyn ymlaen oedd iaith swyddogol y gyfraith a gweinyddiaeth. Defnyddiwyd y term \u0027Deddfau Uno\u0027 gan y barnwr Syr John Alun Pugh, mewn darlith a draddodwyd yn ystod Ysgol Haf Plaid Genedlaethol Cymru 1936.",
  "wikiArticle": "Roedd Deddfau Cyfreithiau yng Nghymru 1536 a 1542, yn ddwy ddeddf a basiwyd yn San Steffan i \u0022gorffori\u0022 Cymru\u0027n wleidyddol â theyrnas Lloegr yngyd â\u0027i \u0022huno a\u0027i chysylltu\u0022 â hi, ac i ddileu\u0027r iaith Gymraeg. Saesneg o hyn ymlaen oedd iaith swyddogol y gyfraith a gweinyddiaeth. Defnyddiwyd y term \u0027Deddfau Uno\u0027 gan y barnwr Syr John Alun Pugh, mewn darlith a draddodwyd yn ystod Ysgol Haf Plaid Genedlaethol Cymru 1936.\r\n\r\n== Cefndir ==\nAr ôl i Harri VIII wneud ei hun yn bennaeth Eglwys Lloegr ym 1534, gwelwyd Cymru fel broblem bosibl a oedd yn cynnwys dynion uchelgeisiol a oedd yn anhapus a\u0027i hanfantais ethnig ac yn rhwystredig gyda chymhlethdodau cyfreithiol. Bu Cymru hefyd yn dir glanio i Harri Tudur ac yn agos at Iwerddon Gatholig. Prif weinyddwr coron Lloegr, Thomas Cromwell, a anogodd y Deddfau yn 1536 a 1542-43 i wneud Cymru yn rhan o Loegr. Nodir fod Cymru\u0027n barod wedi\u0027i gorchfygu ac yna\u0027i hatodi gan Loegr yn dilyn concwest Edward I, dan Statud Rhuddlan yn 1284.\r\n\r\n== Gweithred y deddfau ==\nDiddymwyd Y Mers ac ehangwyd Tywysogaeth Cymru dros Gymru cyfan. Dilewyd y Gyfraith Cymreig. Disgrifiwyd Cymru fel \u0022Tywysogaeth, Gwlad neu Diriogaeth\u0022 a ffirfiwyd ffin â Lloegr. Caniatawyd i Gymry ddal swydd gyhoeddus ond gyda â\u0027r gofyniad i allu siarad Saesneg a gwnaed Saesneg yn iaith y llysoedd yn ogystal a system a farnwriaid \u0022Sesiwn Fawr Cymru\u0022. Cadarnhawyd statws yr iaith Saesneg trwy wneud hyn. Rhannwyd y Mers yn siroedd newydd a\u0027u ychwanegu at siroedd Pura Wallia a grewyd ar ôl y concwest.\r\n\r\n== Ymateb ==\nYn ôl yr awdur Walter Davies mewn traethawd eisteddfodol yn 1791, pasiwyd y ddedf gan Harri VIII mewn ymateb i gwyn gan y Cymry nad oedd gennynt yr un hawliau a\u0027r Saeson. Yn ôl yr hanesydd gyfoes Martin Johnes, roedd yr uchelwyr Cymreig yn croesawu ennill hwaliau newydd a therfyn y system apartheid a fodolodd tan y pwynt hwn ond mae\u0027n anhebygol y fyddai\u0027r werin yn ymwybodol o\u0027r newid.",
  "imageNames": [
    "Atlas_Van_der_Hagen-KW1049B11_031-WALLIA_PRINCIPATUS_Vulgo_WALES..jpeg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1535,
  "categoryId": "arweinwyr",
  "id": "deddfau-uno",
  "label": "Deddfau uno"
}