{
  "wikiSummary": "Dewi Sant yw nawddsant Cymru. Ni wyddom lawer amdano ond mae\u0027n eitha sicr iddo fyw yng Nghymru a\u0027i fod yn chwarter Cymro o leiaf; yn ôl Rhigyfarch, Non oedd ei fam, a dreisiwyd gan Sant - mab pennaeth Ceredigion. Dethlir Dydd Gŵyl Dewi ar 1 Mawrth. Nodir yn y Fuchedd Gymraeg Llyfr Ancr Llanddewibrefi ei bregeth olaf, lle dywedodd, \u0022Arglwyddi, frodyr a chwiorydd, byddwch lawen a chedwch eich ffydd a\u0027ch cred, a gwnewch y pethau bychain a glywsoch ac a welsoch gennyf i.\u0022",
  "wikiArticle": "Dewi Sant yw nawddsant Cymru. Ni wyddom lawer amdano ond mae\u0027n eitha sicr iddo fyw yng Nghymru a\u0027i fod yn chwarter Cymro o leiaf; yn ôl Rhigyfarch, Non oedd ei fam, a dreisiwyd gan Sant - mab pennaeth Ceredigion. Dethlir Dydd Gŵyl Dewi ar 1 Mawrth. Nodir yn y Fuchedd Gymraeg Llyfr Ancr Llanddewibrefi ei bregeth olaf, lle dywedodd, \u0022Arglwyddi, frodyr a chwiorydd, byddwch lawen a chedwch eich ffydd a\u0027ch cred, a gwnewch y pethau bychain a glywsoch ac a welsoch gennyf i.\u0022\r\n\r\n== Hanes a thraddodiad ==\n\nYn ôl un traddodiad, cafodd ei eni yn Henfynyw ger Aberaeron, ond mae traddodiad arall yn cyfeirio at Gapel Non, gerllaw Eglwys Gadeiriol Tyddewi heddiw. Ei fam oedd y santes Non a\u0027i dad oedd Sant , brenin Ceredigion.\nMae\u0027n eithaf sicr iddo sefydlu ei abaty yn Nhyddewi ac mae cyfeiriad at fynachlog yno mewn llawysgrif Wyddelig o tua\u0027r flwyddyn 800. Enw arall ar y lle yw Glyn Rhosyn, sy\u0027n gamgyfieithiad o\u0027r Lladin vallis rosina sydd, o\u0027i gyfieithu\u0027n gywir, yn golygu cwm corsiog.[angen ffynhonnell] Mae\u0027n demtasiwn i feddwl am y llecyn fel lle tawel, ond allai hynny ddim fod ymhellach oddi wrth y gwir. Roedd yn groesffordd i deithiau i Iwerddon, Cernyw, Llydaw gan arwain i Rufain a\u0027r dwyrain a\u0027r gogledd. Mae Eglwys Gadeiriol Tyddewi ei hun mewn pant ac yn agos i adfeilion Plas yr Esgob.\nMae bron pob peth a wyddom am Dewi Sant yn tarddu o\u0027r fuchedd a ysgrifennodd Rhigyfarch tua\u0027r flwyddyn 1100. Gelwir y cyfieithiad Cymraeg Canol o\u0027r Lladin wreiddiol Buchedd Dewi Sant.\nGosododd Dewi gyfundrefn lem iawn yn ei fynachlog. Roedd yr oriau gweddïo\u0027n hir, bara a dŵr oedd y bwyd arferol, a\u0027r gwaith yn galed. Rhaid oedd ymrwymo i dlodi hefyd, ond yr oedd pregethu\u0027r efengyl i\u0027r paganiaid yn holl bwysig. Oherwydd ei ffordd o fyw adwaenir Dewi fel \u0022Dewi Ddyfrwr\u0022 , yn ôl un awdur o\u0027r 9g.\nYmhlith y traddodiadau niferus am y sant, dywedir iddo gwrdd â Sant Padrig ar Ynys Dewi, ar arfordir Sir Benfro ger Tyddewi. Traddodiad arall yw i\u0027r tir godi pan yn pregethu i dyrfa enfawr yn Llanddewi Brefi gan nad oedd y dorf yn gallu ei weld na\u0027i glywed ac i golomen eistedd ar ei ysgwydd. Yn ôl Rhigyfarch a llawysgrifau Gwyddelig o\u0027r 9g, bu farw Dewi ar y cyntaf o Fawrth - yn y flwyddyn 589 - a dyma\u0027r dyddiad y dethlir Gŵyl Ddewi bob blwyddyn.",
  "imageNames": [
    "046CupolaSPietro.jpg",
    "Bae_non_-_Chapel_of_Our_Lady_and_St_Non_S_of_Tyddewi_St_Davids_Sir_Benfro_Wales_10.jpg",
    "Castell_Coch_stained_glass_panel_2.JPG",
    "Clonard_RC_Church_St_Finian_02_Detail_2007_08_26.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": true,
  "start": 500,
  "end": 589,
  "categoryId": "crefydd",
  "id": "dewi-sant",
  "label": "Dewi Sant"
}