{
  "wikiSummary": "Am Eisteddfod eleni gweler Eisteddfod Genedlaethol Cymru Wrecsam 2025\n\nGŵyl ddiwylliannol fwyaf Cymru yw Eisteddfod Genedlaethol Cymru, gyda chystadlu mewn llenyddiaeth, cerddoriaeth a drama yn elfen bwysig. Ymhlith y cystadlaethau pwysicaf mae cystadleuaeth am y Gadair am awdl, y Goron am bryddest y Fedal Ryddiaith am waith rhyddiaith, a\u0027r Fedal Ddrama ar gyfer y ddrama orau. Ceir hefyd y Rhuban Glas i\u0027r canwr unigol gorau a chyflwynir Medal Syr T.H. Parry-Williams er 1975 i gydnabod gwasanaeth gwirfoddol nodedig ymhlith pobl ifanc. Er 1952, trefnir a llywodraethir yr Eisteddfod gan Lys yr Eisteddfod Genedlaethol. Yn gyffredinol, bu\u0027r niferoedd sy\u0027n ymweld â hi\u0027n gostwng rhwng 1997 a 2017.",
  "wikiArticle": "Am Eisteddfod eleni gweler Eisteddfod Genedlaethol Cymru Wrecsam 2025\n\nGŵyl ddiwylliannol fwyaf Cymru yw Eisteddfod Genedlaethol Cymru, gyda chystadlu mewn llenyddiaeth, cerddoriaeth a drama yn elfen bwysig. Ymhlith y cystadlaethau pwysicaf mae cystadleuaeth am y Gadair am awdl, y Goron am bryddest y Fedal Ryddiaith am waith rhyddiaith, a\u0027r Fedal Ddrama ar gyfer y ddrama orau. Ceir hefyd y Rhuban Glas i\u0027r canwr unigol gorau a chyflwynir Medal Syr T.H. Parry-Williams er 1975 i gydnabod gwasanaeth gwirfoddol nodedig ymhlith pobl ifanc. Er 1952, trefnir a llywodraethir yr Eisteddfod gan Lys yr Eisteddfod Genedlaethol. Yn gyffredinol, bu\u0027r niferoedd sy\u0027n ymweld â hi\u0027n gostwng rhwng 1997 a 2017.\r\n\r\n== Yr Eisteddfod ddoe a heddiw ==\nEr bod traddodiad yr eisteddfod yn ganrifoedd oed, ni chynhaliwyd yr Eisteddfod Genedlaethol gyntaf tan 1861, yn Aberdâr. Daeth y gyfres flynyddol honno i ben oherwydd diffyg cyllid yn 1868. Yn 1880 sefydlwyd Cymdeithas yr Eisteddfod Genedlaethol a dan nawdd y gymdeithas hon cynhaliwyd Eisteddfod Merthyr Tudful yn 1881 a chynhaliwyd eisteddfod yn ddifwlch wedyn ar wahân i 1914, 1940 a 2020. Roedd Iolo Morganwg wedi sefydlu Gorsedd Beirdd Ynys Prydain yn 1792. Fel y tyfodd yr Eisteddfod Genedlaethol daeth yr orsedd i\u0027w chysylltu fwy-fwy gyda hi, gan gychwyn gydag Eisteddfod Caerfyrddin 1819, nes datblygu yn rhan o seremonïau\u0027r eisteddfod fwy neu lai fel y mae heddiw. Yr orsedd sydd yn gyfrifol am seremonïau cadeirio a choroni\u0027r beirdd yn ogystal â chyflwyno\u0027r Fedal Ryddiaith. Ailwampiodd yr Archdderwydd Geraint Bowen tipyn ar y seremonïau, er enghraifft diddymu Seremoni\u0027r Cymry Ar Wasgar, a dod â\u0027r brodyr Celtaidd i mewn i rai o\u0027r prif seremonïau. Mae aelodau\u0027r orsedd yn rhannu\u0027n dri grŵp, gyda lliw gwahanol i wisg bob un.\nCaiff yr Eisteddfod Genedlaethol ei chynnal bob blwyddyn yn ystod wythnos lawn gyntaf mis Awst, yn y de a\u0027r gogledd bob yn ail. Ond ceir Seremoni\u0027r Cyhoeddi tua 13 mis cyn yr Eisteddfod. pryd y bydd Gorsedd y Beirdd a\u0027i chefnogwyr yn gorymdeithio drwy\u0027r dref i Gylch yr Orsedd. Ar ôl y seremoni cyflwynir rhestr o destunau\u0027r Eisteddfod i\u0027r Archdderwydd.\nMae maes yr Eisteddfod yn mesur oddeutu 15 i 18 erw . Ar wahân i\u0027r pafiliwn mawr, bydd hefyd y Babell Len, y Babell Ddawns, Pabell y Cymdeithasau, y Lle Celf; a bydd nifer o stondinau gan gymdeithasau gwirfoddol, megis yr Urdd, Merched Wawr; bydd y pleidiau gwleidyddol ar y maes hefyd a busnesau.\nYn y gorffennol, roedd Saesneg yn rhan o\u0027r gweithgareddau, a chlywid hi hyd yn oed ar lwyfan yr Eisteddfod ei hun. Nododd y cyfansoddiad newydd ym 1952 mai iaith swyddogol yr eisteddfod oedd y Gymraeg yn unig, ac roedd Cynan yn flaenllaw yn y gwaith o gadw\u0027r eisteddfod yn uniaith Gymraeg.\nYmhlith eisteddfodau eraill Cymru mae: Eisteddfod Genedlaethol yr Urdd, Eisteddfod Ryngwladol Llangollen, Eisteddfod Pantyfedwen, Eisteddfod Powys ac Eisteddfod Môn. Ceir hefyd nifer o eisteddfodau llai ledled Cymru, megis Eisteddfod Pwll-glas.\r\n\r\n== Prif wobrau\u0027r eisteddfod ==\r\n\r\n== Rhestr o Eisteddfodau Cenedlaethol ==\r\n\r\n== Gwyliau iaith Celtaidd eraill ==\nOireachtas na Gaeilge - Iwerddon\nMòd Genedlaethol yr Alban - Yr Alban\nCooish - Ynys Manaw\nGouel Broadel ar Brezhoneg - Llydaw",
  "imageNames": [
    "Eisteddfod_Genedlaethol_Cymru_Glynebwy_1958.jpg",
    "Eisteddfod_Logo_2021.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1176,
  "categoryId": "diwylliant",
  "id": "eisteddfod",
  "label": "Eisteddfod"
}