{
  "wikiSummary": "Seiclwr proffesiynol o Gymru ydy Geraint Howell Thomas, OBE , a gystadlodd dros dim INEOS ar Gylchdaith Proffesiynol yr UCI yn ogystal a Chymru a gwledydd Prydain.\nMae Thomas wedi profi llwyddiant ar y trac ac ar y ffordd gan ennill Pencampwriaethau Trac y Byd a medal aur Olympaidd yn y Ras Ymlid i dimau yn Ngemau Olympaidd 2008 a 2012. Ar y ffordd mae wedi ennill ras y Junior Paris-Roubaix yn 2004, Pencampwriaethau Cenedlaethol Prydain yn 2010, medal aur yn Ras Lôn Gemau\u0027r Gymanwlad 2014, ras Bayern-Rundfart yn 2011 a 2014, Ras E3 Harelbeke yn 2015, Paris–Nice yn 2016, Tour of the Alps yn 2017 a\u0027r Critérium du Dauphiné yn 2018.\nYn 2017 daeth Thomas y Cymro cyntaf erioed a dim ond yr wythfed beiciwr o Ynysoedd Prydain i wisgo\u0027r siwmper felen yn y Tour de France ond bu rhaid iddo adael y ras yn gynnar ar ôl torri pont ei ysgwydd mewn damwain ar y nawfed cymal.\nYn Tour de France 2018, cymerodd Thomas y crys melyn ar ôl ennill cymal 11, gan arwain y daith ers hynny. Cwblhaodd y cymal olaf o Houilles i Baris yn llwyddiannus, gan ddod y Cymro cyntaf i ennill y ras, a\u0027r trydydd o wledydd Prydain. Ar 16 Rhagfyr 2018, enillodd wobr Personoliaeth Chwaraeon y Flwyddyn BBC, y Cymro cyntaf i ennill ers Ryan Giggs yn 2009.\nDaeth ei yrfa proffesiynol i ben ar 7 Medi 2025 pan seiclodd ar gymal olaf Taith Prydain a orffennodd yng nghanol Caerdydd. Darlledwyd y cymal olaf yn fyw ar S4C.",
  "wikiArticle": "Seiclwr proffesiynol o Gymru ydy Geraint Howell Thomas, OBE , a gystadlodd dros dim INEOS ar Gylchdaith Proffesiynol yr UCI yn ogystal a Chymru a gwledydd Prydain.\nMae Thomas wedi profi llwyddiant ar y trac ac ar y ffordd gan ennill Pencampwriaethau Trac y Byd a medal aur Olympaidd yn y Ras Ymlid i dimau yn Ngemau Olympaidd 2008 a 2012. Ar y ffordd mae wedi ennill ras y Junior Paris-Roubaix yn 2004, Pencampwriaethau Cenedlaethol Prydain yn 2010, medal aur yn Ras Lôn Gemau\u0027r Gymanwlad 2014, ras Bayern-Rundfart yn 2011 a 2014, Ras E3 Harelbeke yn 2015, Paris–Nice yn 2016, Tour of the Alps yn 2017 a\u0027r Critérium du Dauphiné yn 2018.\nYn 2017 daeth Thomas y Cymro cyntaf erioed a dim ond yr wythfed beiciwr o Ynysoedd Prydain i wisgo\u0027r siwmper felen yn y Tour de France ond bu rhaid iddo adael y ras yn gynnar ar ôl torri pont ei ysgwydd mewn damwain ar y nawfed cymal.\nYn Tour de France 2018, cymerodd Thomas y crys melyn ar ôl ennill cymal 11, gan arwain y daith ers hynny. Cwblhaodd y cymal olaf o Houilles i Baris yn llwyddiannus, gan ddod y Cymro cyntaf i ennill y ras, a\u0027r trydydd o wledydd Prydain. Ar 16 Rhagfyr 2018, enillodd wobr Personoliaeth Chwaraeon y Flwyddyn BBC, y Cymro cyntaf i ennill ers Ryan Giggs yn 2009.\nDaeth ei yrfa proffesiynol i ben ar 7 Medi 2025 pan seiclodd ar gymal olaf Taith Prydain a orffennodd yng nghanol Caerdydd. Darlledwyd y cymal olaf yn fyw ar S4C.\r\n\r\n== Bywgraffiad ==\n\n\n=== Bywyd cynnar ===\n\nGanwyd Thomas yng Nghaerdydd, Cymru, yn fab hynaf i Howell Thomas, mab ffermwr o Bancyfelin, Sir Gaerfyrddin, ac yn frawd i Alun Lloyd Thomas. Magwyd yn ardal Llwyn Fedw ger yr Eglwys Newydd, mynychodd Ysgol Uwchradd yr Eglwys Newydd. Dechreuodd seiclo gyda chlwb \u0022Maindy Flyers Cycling Club\u0022 yn Canolfan Maendy pan yn 10 oed, cyn mynd ymlaen i reidio dros glybiau lleol eraill, \u0022Cycling Club Cardiff\u0022 a \u0022Cardiff Just in Front\u0022. Cafodd lwyddiant mewn rasys ar gyfer rhai o dan 14 ac o dan 16 oed, gan gynnwys pencampwriaethau cenedlaethol Prydain, ond dechreuwyd sylwi ar ei botensial pan enillodd fedal arian yn y ras bwyntiau yn y pencampwriaethau Ewropeaidd.\n\n\n=== Bywyd personol ===\nCyfarfu Thomas ei wraig, Sara Elen Thomas, drwy ffrind. Priododd y cwpl yng Nghymru yn Hydref 2016 a maent yn byw yn Monaco,\r\n\r\n== Gyrfa ==\nDaeth Thomas yn aelod o Academi Olympaidd British Cycling. Enillodd Wobr Iau Carwyn James yn seremoni Personoliaeth Chwaraeon y Flwyddyn BBC Cymru. Gwnaeth gystadlu mewn rasys Cwpan y Byd o amgylch y byd. Fe gafodd ddamwain wrth  ymarfer yn Sydney, Awstralia ym mis Chwefror 2005 ar ôl i\u0027r reidiwr o\u0027i flaen daro darn o fetel a gadawodd ei fflicio i olwyn Thomas. Dioddefodd o waedu mewnol ar ôl i ddarn o fetel fynd i\u0027w gorff pan ddisgynnodd, torlengigodd ei ddueg, a bu\u0027n rhaid cael llawdriniaeth i\u0027w dynnu.\nYn 2006, reidiodd y rhan fwyaf o\u0027i rasus dros dîm Recycling.co.uk, ond tuag at ddiwedd 2006 ymunodd â Saunier Duval-Prodir. Reidiodd rai rasus hefyd dros Brydain, er enghraifft Tour of Britain.\nBu Geraint yn byw ac yn ymarfer yn Toscana yn yr Eidal, ynghyd â sawl seiclwr proffesiynol arall Prydeinig megis Mark Cavendish. Bydd seiclwyr proffesiynol yn ymarfer yn rheolaidd yn Awstralia er mwyn manteisio ar y tywydd.\n\n\n=== 2007 ===\n\nThomas oedd y reidiwr ifancaf yn Tour de France 2007, wedi i\u0027w dîm Barloworld, gael un o\u0027r tri safle wildcard sydd yn cael eu neilltuo ar gyfer y ras. Gorffennodd Geraint y Tour de France yn yr 140fed safle allan o 141, wedi ugain niwrnod o rasio, er nad oedd disgwyl iddo wneud hynny ar y cynnig cyntaf. Honnir gan amryw mai hon yw\u0027r ras seiclo ffordd, galetaf i gyd.. Geraint oedd y Cymro cyntaf i gymryd rhan yn y ras ers Colin Lewis yn 1968, a\u0027r Cymro cyntaf i orffen y ras ras. Derbyniodd gryn gefnogaeth gan ei gefnogwyr Cymreig yn y seremoni agoriadol yn Llundain, gyda nifer ohonynt yn mynd ymlaen i ddilyn yr holl ras.\nFe dreuliodd Geraint chwe wythnos yn ymarfer yn Mherth, Awstralia yng ngaeaf 2007. Enwebwyd ef ar gyfer gwobr Personoliaeth Chwaraeon Cymreig y Flwyddyn BBC Cymru yn 2007, datganwyd yr enillwyr ar y teledu ar y 2 Rhagfyr a chafodd Geraint ei bleidleisio i\u0027r drydydd safle gan y cyhoedd.\n\n\n=== 2008 ===\nNi chystadlodd Thomas yn Tour de France 2008, yn hytrach cystadlodd yn y Giro d\u0027Italia yn gynharach yn y tymor cyn dychwelyd i Brydain er mwyn canolbwyntio ar baratoadau ar gyfer Gemau Olympaidd 2008. Wedi darganfod na fyddai baneri gwledydd nad oedd yn cymryd rhan o dan eu henwau eu hunain yn cael eu caniatáu yn y Gemau, dywedodd Thomas:\n\n\u0022It would be great to do a lap of honour draped in the Welsh flag if I win a gold medal, and I\u0027m very disappointed if this rule means that would not be possible.\u0022\nAr 17 Awst, roedd Thomas yn aelod o\u0027r sgwad tîm dilyn a dorrodd record y byd yn y rowndiau cyn-derfynol yn y Gemau Olympaidd gydag amser o 3:55:202, gan guro eu gwrthwynebwyr Rwsiaiddyn gyfforddus i fynd ymlaen i\u0027r rownd derfynol i gystadlu am yr aur a\u0027r arian. Y diwrnod canlynol, ar eu ffordd i ennill y fedal aur, torrodd y tîm Prydeinig record y byd eu hunain, gan osod amser newydd o 3:53:314, a churo eu gwrthwynebwyr Danaidd o 6.7 eiliad. Roedd Thomas wedi bod yn un o\u0027r cystadleuwyr posibl ar gyfer y dilyn unigol, ond penderfynodd beidio â chystadlu yn y ddwy gystadleuaeth gan nad oedd eisiau peryglu ymdrechion ei dîm. Roedd hefyd wedi cael ei gysidro i gystadlu yn y Madison gyda Bradley Wiggins, ond dewiswyd Mark Cavendish yn y pen draw; dywedodd Chris Boardman fod \u0022Geraint keeps surpassing people\u0027s expectations\u0022.\nYn dilyn diarddeliad ei gyd-aelod tîm Barloworld, Moises Duenas, o\u0027r Tour de France, datgelodd Thomas ei farn cryf yn erbyn defnydd cyffuriau yn ei flog ar y wefan BBC 606: \u0022..if someone is fraudulent in a business, wouldn’t they be facing a prison term? I don’t see how riders taking drugs to win races and lying to their teams is any different. Bang them up and throw away the key!\u0022\n\n\n=== 2009 ===\nApwyntiwyd ef yn Aelod o Urdd yr Ymerodraeth Brydeinig yn rhestr anrhydeddau\u0027r flwyddyn newydd yn 2009.. Fe\u0027i dyrchafwyd yn OBE yn rhestr anrhydeddau\u0027r flwyddyn newydd yn 2019\nNi chafodd Thomas ddechrau da iawn i\u0027w dymor rasio yn 2009, pan dorrodd ei belfis a\u0027i drwy wrth ddisgyn ar ôl cam-farnu cornel a tharo\u0027r barier diogelwch mewn cymal treial amser o\u0027r Tirreno-Adriatico yn Macerata, yr Eidal. Daeth yn ddamwain yn fuan wedi i siec amser 8 km ddangos mai ef oedd yr ail cyflymaf ar y ffordd. Er y bu iddo allu dychwelyd i westy ei dîm o\u0027r ysbyty\u0027r un diwrnod, gorfodwyd iddo gymryd 20 diwrnod o orffwys cyfan gwbl cyn gallu dychwelyd at ymarfer.\nAr 30 Hydref 2009, gosododd Thomas yr amser cyflymaf yn y dilyn o dan y rheolau presennol, pan gyflawnodd 4 km mewn 4 munud 15.105 eiliad yn rownd gyntaf y 2009–2010 UCI Track Cycling World Cup Classics yn Velodrome Manceinion. Rhagorir yr amser hwn gan Chris Boardman yn unig, gydag amser o 4 munud 11.114 eiliad, a osodwyd ym 1996 mewn safle ar y beic sydd eisoes wedi cael ei wahardd. Ar 1 Tachwedd, ar ddiwrnod olaf y rownd hon o Gwpan y Byd, roedd Thomas yn aelod o\u0027r sgwad dilyn tîm a osododd yr amser ail-gyflymaf yn y byd tra ar eu ffordd i ennill y fedal aur, gan osod record trac newydd yn y broses o 3:54.395.\nDaeth Thomas yn ail i Ryan Giggs yng ngwobr Personoliaeth Chwaraeon Cymreig y Flwyddyn BBC Cymru yn 2009, wedi i\u0027r enillwyr gael eu datgan ar 8 Rhagfyr.\nGadawodd Thomas dîm Barloworld ar ddiwedd 2009 i ymuno â thîm proffesiynol newydd Prydeinig, sef Team Sky.\n\n\n=== 2010 ===\n\nDechreuodd Thomas ei dymor rasio yn 2010 fel aelod  dîm treial amser Sky yn y Tour of Qatar. Wedi cystadlu yng nghlasuron seiclo\u0027r gwanwyn, daeth i sylw gan orffen y Critérium du Dauphiné, gan orffen yn y deg uchaf yn y pedwar cymal cyntaf. Oherwydd hyn, fe oedd arweinydd y gystadleuaeth bwyntiau a gwisgodd y Crys Gwyrdd yng nghymalau dau, pedwar a chwech. Erbyn diwedd y ras, roed yn bumed yn y gystadleuaeth a 21ain yn y dosbarthiad cyffredinol.\nCurodd Thomas ei gyd-aelod tîm, Peter Kennaugh, i ennill Pencampwriaeth Cenedlaethol Ras Ffordd Prydain 2010. Roedd mewn siâp da, a pharhaodd hyn drwy Tour de France 2010, lle gorffennodd yn bumed yn y Prologue ac ail yn y trydydd cymal, felly arweiniodd y gystadleuaeth reidiwr ifanc a gwisgo\u0027r crys gwyn wedi\u0027r trydydd cymal.\n\n\n=== 2011 ===\nDechreuodd Thomas dymor rasio 2011 gyda perfformiadau addawol, gan gynnwys chweched safle yn y Classica Sarda ac ail yn y Dwars door Vlaanderen. Cipiodd ei fuddugoliaeth proffesiynol cyntaf ym mis Mai 2011, gan ennill ras pum diwrnod Bayern-Rundfahrt, wedi iddo orffen yn ail ar gymal 3, a pumed ar gymal 4. Ar 26 Mehefin 2011, daeth Thomas yn ail i Bradley Wiggins ym Mhencampwriaeth Cenedlaethol Ras Ffordd Prydain 2011.\nArweiniodd Thomas y gystadleuaeth reidiwr ifanc unwaith eto yn Tour de France 2011, gan gwisgo\u0027r crys gwyn wedi\u0027r cymal cyntaf, a hyd y seithfed cymal. Yng nghymal 12, bu\u0027n un o chwe reidiwr i ddianc oddi ar flaen y peleton wedi dim ond 2 km o\u0027r cymal 211 km o Cugnaux i Luz-Ardiden. Ar un adeg roedd 7 munud o flaen y peleton ac yn arwain y ras fel oedd hi ar y ffordd. Cafodd ei ddal 7 km o ddiwedd y cymal ac enillodd y Wobr Brwydrol y cymal. Gorffennodd y ras yn 31af, ei safle gorau yn y ras hyd yn hyn.\nBu Thomas yn llwyddiannus yn y Tour of Britain, gan ennill y dosbarthiad pwyntiau, a bu mewn safle uchel ar y dosbarthiad cyffredinol cyn iddo gael damwain a cholli amser. Roedd yn aelod o dîm Prydain Fawr ym Mhencampwriaethau Rasio Ffordd y Byd, gan arwain Mark Cavendish at ei fuddugoliaeth.\n\n\n=== 2012 ===\nCanolbwyntiodd Thomas ar rasio ar y trac ar gyfer tymor 2012 gan anelu at Gemau Olympaidd 2012 yn Llundain. O\u0027r herwydd, Giro d\u0027Italia 2012 oedd ei unig brif ras yn ystod y tymor ond roedd yn rhan o dîm Team Sky sicrhaodd fuddugoliaeth i Bradley Wiggins yn ras Paris-Nice.\nAr 4 Ebrill roedd yn aelod o dîm trac Prydain dorrodd record byd yn y ras ymlid wrth ennill medal aur ym Mhencampwriaethau Trac y Byd ym Melbourne a chasglodd fedal arian gyda Ben Swift yn y madison.\nAr ôl ennill cymal agoriadol y Tour de Romandie  gorffennodd yn ail yng nghymal agoriadol yn erbyn y cloc y Giro d\u0027Italia a hefyd yn ail yng nghymal ola\u0027r Giro yn erbyn y cloc\nCafodd Thomas ei ddewis yn aelod o dîm Ras Ymlid Prydain ar gyfer Gemau Olympaidd 2012 ynghyd â Steven Burke, Ed Clancy a Peter Kennaugh. Ar ôl torri\u0027r record byd yng nghymal cyntaf y gystadleuaeth gosodwyd, llwyddodd y pedwarawd i dorri\u0027r record unwaith eto yn y rownd derfynol yn erbyn Awstralia er mwyn cipio\u0027r fedal aur\n\n\n=== 2013 ===\nDechreuodd Thomas dymor 2013 gyda\u0027r Tour Down Under. Llwyddodd i ennill Cymal 2 a dal ar siwmper arweinydd y ras hyd nes y cymal olaf ond un. Gorffennodd yn drydydd, 25 eiliad tu ôl i\u0027r Iseldirwr, Tom-Jelte Slagter, gan ennill y dosbarth pwyntiau.\nCafodd ei ddewis fel arweinydd Team Sky yn rasys y Clasuron ond heb llawer o lwyddiant. Gorffennodd yn ail yn Bayern-Rundfahrt ac yn 15ed yn y Critérium du Dauphiné wrth i Chris Froome a Richie Porte orffen yn gyntaf ac yn ail i Team Sky.\nCafodd ei ddewis i rasio yn Tour de France 2013 ac er iddo dorri ei belfis mewn damwain hegar ar y cymal cyntaf, parhaodd i rasio gan orffen yn y 140ed safle wrth i Team Sky sicrhau buddugoliaeth i Froome\n\n\n=== 2014 ===\n\nUnwaith eto, dechreuodd Thomas ei dymor yn y Tour Down Under mewn rôl domestique i Richie Porte, a gorffennodd yn wythfed. Roedd Thomas i fod i gefnogi Porte yn y Paris–Nice hefyd ond yn dilyn anaf i Chris Froome cafodd porte ei symud i rasio yn y Tirreno–Adriatico gan adael Thomas i arwain Team Sky yn Ffrainc. Llwyddodd i fachu\u0027r maillot jaune ar y pedwerydd cymal cyn disgyn i\u0027r ail safle erbyn y chweched cymal. Cafodd ddamwain mawr ar y seithfed cymal welodd o\u0027n gorffen dros saith munud tu ôl i\u0027r ceffylau blaen, ac ni gymrodd rhan yn y cymal olaf.\nDechreuodd tymor y Clasuron yn gryf gan orffen yn drydydd yn y E3 Harelbeke cyn arwain Team Sky yn y Tour of Flanders lle gorffennodd yn wythfed, 47 eiliad tu ôl i Fabian Cancellara ac roedd yn seithfed yn y Paris–Roubaix, gan orffen 20 eiliad tu ôl i Niki Terpstra. Yn y Tour de France bu\u0027n gweithio dros Richie Porte wedi i arweinydd Team Sky, Chrids Froome, adael y ras wedi anaf ar y pumed cymal. Thomas oedd yr unig seiclwr o ynysoedd Prydain i orffen y ras gan orffen yn 22in, ei ganlyniad gorau yn y Tour de France.\nWedi\u0027r Tour, teithiodd Thomas i Glasgow i gynrychioli Cymru yng Ngemau\u0027r Gymanwlad yn Glasgow. Casglodd fedal efydd yn y Ras yn erbyn y cloc cyn casglu\u0027r fedal aur yn y Ras Lôn mewn ras hynod gyffrous welodd Thomas yn gorfod newid olwyn ym munudau olaf y ras.\n\n\n=== 2016 ===\n\n\n=== 2017 ===\n\nYn Ionawr cyhoeddodd Team Sky y byddai Geraint a Mikel Landa yn cyd-arwain yn y Giro d\u0027Italia y flwyddyn honno.\nYm Mawrth Geraint Thomas a arweiniodd y Tirreno–Adriatico ond amharwyd ar berfformiad Team Sky gydag anaf i Gianni Moscon, pan chwythodd ei deiar flaen a disgynnodd ar y tarmac. Gorffennodd Team Sky 1\u0027 41\u0022 yn is na\u0027r safon. Enillodd Thomas yr ail gymal - 9 eiliad o flaen Tom Dumoulin. Ar ddiwedd y ras gorffennodd Geraint yn 5ed: 58 eiliad y tu ôl i Quintana.\nYn Ebrill, daeth Geraint y seiclwr cyntaf o Gymru, ac o Brydain, i ennill y Tour of the Alps . Yn dilyn anaf i\u0027w ysgwydd ac yna\u0027n ddiweddarach i\u0027w ben-glin, tynnodd o\u0027r ras.\nYn Tour de France 2017, enillodd Geraint y cymal agoriadol, gan ei wneud y Cymro cyntaf erioed i wisgo\u0027r siwmper felen. Cadwodd honno amdano hyd at Gymal 5, pan disgynnodd i\u0027r ail safle. Daeth ei gyfraniad i\u0027r ras i ben pan gafodd ddamwain ar Gymal 9 gan dorri pont ei ysgwydd.\n\n\n=== 2018 ===\nYn 2018 cystadlodd Thomas fel \u0027cyd-arweinydd\u0027 gyda Chris Froome ar gyfer Team Sky. Yn sgil damwain yn y cymal cyntaf, collodd Froome amser i Thomas. Wedi hynny, bu ymgiprys am arweinyddiaeth y tîm. Enillodd Thomas cymal 11 ar La Rosière, Savoie a Chymal 12 fyny\u0027r Alpe d\u0027Huez mewn modd ddramatig. Yn dilyn hynny aeth ymlaen i ennill y Tour de France. Ef oedd y Cymro cyntaf erioed i ennill ras bwysicaf y byd seiclo. Fe\u0027i gyfarchwyd mewn seremoni arbennig o flaen adeilad Cynulliad Cenedlaethol Cymru yn ystod yr Eisteddfod Caerdydd.\n\n\n=== 2021 ===\n\nYng Ngemau Olympaidd yr Haf 2020 yn Japan , tynnodd Thomas allan o\u0027r Ras Ffordd gyda 60 km i fynd. Ychydig wythnosau ynghynt, fe adlynodd ei ysgwydd ar ôl cwympo yn ystod wythnos gyntaf y Tour de France.\n\n\n=== 2022 ===\nYn y Tour de Suisse, roedd yn rhan o dîm Ineos Grenadiers a oedd yn cynnwys Adam Yates, Daniel Martínez a Tom Pidcock. Ar ôl ennill eiliadau bonws ar y trydydd cymal, roedd tu ôl arweinydd y ras Aleksandr Vlasov o saith eiliad ar ôl y pumed cymal. Yn dilyn prawf COVID-19 positif Vlasov cyn y chweched cam, symudodd Thomas i fyny i\u0027r ail safle yn gyffredinol, un eiliad y tu ôl i Jakob Fuglsang. Cafodd y ddau eu pasio gan Sergio Higuita ar y seithfed cymal, gyda Higuita yn arwain Thomas o ddwy eiliad i gam olaf y treial amser unigol yn Liechtenstein. Gorffennodd Thomas yn ail ar y diwrnod i Remco Evenepoel, gyda Higuita yn gorffen mwy na munud i lawr, a roddodd y fuddugoliaeth gyffredinol i Thomas. Hon oedd y bedwaredd ras fawr iddo’i hennill, a’i ddegfed podiwm, wyth ohonyn nhw’n dod ar ôl iddo droi\u0027n 30 oed.\nTour de France 2022 fyddai’r 12fed tro i Thomas seiclo y Grand Boucle. Daeth i mewn i\u0027r ras ynghyd â\u0027i gyd-aelodau o\u0027r tîm Adam Yates, Dani Martínez a Tom Pidcock ac nid oedd yr un beiciwr yn ffefryn amlwg. Profodd Thomas ei hun i fod y beiciwr cryfaf yn y ras, ac eithrio Jonas Vingegaard a Tadej Pogačar. Rhwng yr Alpau a\u0027r Pyrenees roedd sïon bod Pogačar yn ceisio cynghreiro gyda Thomas, ac atebodd Thomas nad oeddent yn siarad y noson cynt yn trafod tactegau, ond mae beth bynnag sy\u0027n digwydd yn ystod y ras, yn digwydd. I mewn i\u0027r drydedd wythnos fe seiclodd yn ddigon cryf i roi ei hun mewn sefyllfa i orffen ar bodiwm y Tour am y trydydd tro yn ei yrfa. Gyda\u0027i berfformiad cryf yn ystod y treial amser terfynol ef oedd yr unig feiciwr i orffen o fewn \u002B10:00 i Vingegaard a Pogačar, a sicrhaodd ei safle podiwm, yn y trydydd safle.\nGyda Tesni Evans, dewiswyd ef i gludo baner Cymru yn seremoni agoriadol Gemau\u0027r Gymanwlad 2022.\r\n\r\n== Canlyniadau ==\n\n\n=== Trac ===\n\n\n=== Ffordd ===\r\n\r\n== Diwylliant poblogaidd ==\n\n\n=== Tour de France 2018 ===\nYn sgil llwyddiant cynyddol Geraint Thomas yn ystod Tour de France 2018 rhannwyd clip fideo ar Facebook o ffans Geraint Thomas yn canu fersiwn hwyliog ohonynt yn canu cân Hogia\u0027r Wyddfa, Titw Tomos Las gyda Geraint yn dod allan o\u0027i bws teithio i\u0027w harwain yn y canu.\nYnghanol holl hwyl llwyddiant Geraint yn y Tour, recordiodd BBC Radio Cymru fersiwn newydd o Titw Tomos Las ar gyfer rhaglen foreuol Aled Hughes. Canwyd y fersiwn newydd gan ddau o aelodau Hogia\u0027r Wyddfa, y bandi Siddi, Band Pres Llarebbug a phlant lleol. a bu sylwi iddi ar Radio Cymru a\u0027r we.\nRoedd cân Titw Tomos yn rhan o don o Ddathliadau Geraint Thomas yn Tour de France 2018 gan gynnwys cerddi a chân rap.",
  "imageNames": [
    "2017_TdF_E3_Geraint_Thomas.jpg",
    "2018_Tour_of_Britain_stage_8_171_Geraint_Thomas_passing_the_podium.JPG"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 2018,
  "categoryId": "unigolion-nodedig",
  "id": "geraint-thomas",
  "label": "Geraint Thomas"
}