{
  "wikiSummary": "Erthygl am ferch Llywelyn ap Gruffudd yw hon. Gweler hefyd Gwenllian .\n\nMerch Llywelyn Ein Llyw Olaf, Tywysog Cymru, a\u0027i wraig Elinor, Arglwyddes Cymru, oedd y Dywysoges Gwenllian neu Gwenllian o Gymru , Tywysoges Gwynedd a Chymru. Hi oedd unig ddisgynnydd cyfreithlon Llywelyn o\u0027i briodas ag Elinor , merch y barwn Simon de Montfort.",
  "wikiArticle": "Erthygl am ferch Llywelyn ap Gruffudd yw hon. Gweler hefyd Gwenllian .\n\nMerch Llywelyn Ein Llyw Olaf, Tywysog Cymru, a\u0027i wraig Elinor, Arglwyddes Cymru, oedd y Dywysoges Gwenllian neu Gwenllian o Gymru , Tywysoges Gwynedd a Chymru. Hi oedd unig ddisgynnydd cyfreithlon Llywelyn o\u0027i briodas ag Elinor , merch y barwn Simon de Montfort.\r\n\r\n== Hanes ==\nCafodd Gwenllian ei geni yn llys tywysogion Gwynedd yn Aber Garth Celyn, Gwynedd, a bu ei mam farw wrth roi genedigaeth iddi. Mewn llai na blwyddyn roedd ei thad hefyd yn farw.\nAr ôl i Dywysogaeth Cymru syrthio, wedi lladd Llywelyn a dienyddio ei frawd Dafydd, bu erlid gan y Saeson ar ddisgynyddion uniongyrchol olaf Teulu Aberffraw. Roedd Eryri a chalon Gwynedd dan warchae ac am chwe mis neu ragor roedd milwyr Seisnig yn cael rhwydd hynt i wneud fel y mynnant.\nDaliwyd Gwenllian. Roedd y Dywysoges ifanc yn amlwg yn berygl i Goron Lloegr ac o ganlyniad fe\u0027i ducpwyd o Wynedd a\u0027i charcharu am oes ym Mhriordy Sant Gilbert yn Sempringham, Lloegr, a hithau ond yn flwydd a hanner oed. Ac yno y bu tan ei marw yn 1337. Mae\u0027n fwy na thebyg na siaradai Gymraeg ac na chlywodd air o Gymraeg gan y lleianod eraill. Yng nghofnodion Sempringham, nodir ei henw fel \u0027Wencilian\u0027, eu hynganiad o\u0027i henw.\nCodwyd carreg goffa iddi yn Sempringham yn 2001 gan Gymdeithas Gwenllian.\nAr y 1af o Fai 2009 cyhoeddwyd byddai enw Y Garnedd Uchaf, copa 3,000 m yn y Carneddau, yn cael ei newid yn swyddogol i Garnedd Gwenllian i gofio\u0027r Dywysoges Gwenllian. Byddai Gwenllian yn ymuno felly a\u0027i thad, ei mam a\u0027i ewythr a goffeir eisoes yn enwau copaon eraill gerllaw, sef Carnedd Llywelyn, Yr Elen a Carnedd Dafydd. Bydd yr enw yn cael ei argraffu, gyda\u0027r hen enw hefyd, ar fapiau OS newydd o Fedi 2009 ymlaen.",
  "imageNames": [
    "Gwenllian_Tribute.jpg",
    "Gwenllian_memorial_Sempringham.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1282,
  "end": 1337,
  "categoryId": "milwrol",
  "id": "gwenllian-tywysoges",
  "label": "Tywysoges Gwenllian"
}