{
  "wikiSummary": "Addysgwr o Gymru a gafodd ddylanwad mawr ar ddatblygiad y system addysg yng Nghymru oedd Syr Hugh Owen . Ganwyd yn fferm \u0027Y Foel\u0027 ger Langeinwen, Ynys Môn, yn fab i Owen Owen a Mary Jones.",
  "wikiArticle": "Addysgwr o Gymru a gafodd ddylanwad mawr ar ddatblygiad y system addysg yng Nghymru oedd Syr Hugh Owen . Ganwyd yn fferm \u0027Y Foel\u0027 ger Langeinwen, Ynys Môn, yn fab i Owen Owen a Mary Jones.\r\n\r\n== Ei fywyd ==\n\nDyngarwr Methodistaidd oedd Owen. Roedd yn un o hybwyr cyntaf Coleg y Normal, Bangor rhwng 1855 ac 1858 ac yn 1872 llwyddodd gyda chriw bychan o gefnogwyr i sefydlu Coleg Prifysgol Cymru yn Aberystwyth. Cymerodd ran amlwg yng ngwaith Eisteddfod Genedlaethol Cymru hefyd. Ond ei brif waith oedd sefydlu ysgolion canolraddol yng Nghymru. Cafodd ei urddo\u0027n farchog yn Awst 1881, deufis cyn iddo farw. Claddwyd ef ym Mynwent Abney Park yn Stoke Newington, Llundain.\r\n\r\n== Beirniadaeth ==\nMae gwaith Hugh Owen fel addysgwr wedi ei feirniadu\u0027n hallt gan rai haneswyr modern.[angen ffynhonnell]  Ar sawl ystyr, roedd yn ŵr nodweddiadol o\u0027r dosbarth canol Seisnig Fictoraidd yng Nghymru. Fe\u0027i beirniadir am ei fethiant i greu cyfundrefn addysg a fyddai\u0027n fwy addas i Gymru fel gwlad ac am esgeuluso i raddau helaeth le\u0027r Gymraeg yn y gyfundrefn honno. Er ei fod yn Gymro Cymraeg, peth eilradd yn ei flaenoriaethau fu\u0027r iaith yn ei gynlluniau addysg a bu rhaid aros am flynyddoedd i wneud yn iawn am hynny.  Erbyn i hynny ddigwydd ac i\u0027r iaith ddechrau ennill ei lle yn ysgolion Cymru roedd nifer ei siaradwyr wedi gostwng yn sylweddol a beirniadir Owen am fod yn rhannol gyfrifol am hynny trwy greu system addysg a Seisnigeiddiodd genhedlaethau o Gymry ifainc.\r\n\r\n== Y cof amdano ==\nEnwyd llyfrgell Prifysgol Aberystwyth ac Ysgol Syr Hugh Owen ar ei ôl.",
  "imageNames": [
    "Portrait_of_Sir_Hugh_Owen_4671720_Exposure.jpg",
    "Ysgol_Syr_Hugh_Owen_School_-_geograph.org.uk_-_262295.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1804,
  "end": 1881,
  "categoryId": "unigolion-nodedig",
  "id": "hugh-owen",
  "label": "Syr Hugh Owen"
}