{
  "wikiSummary": "Roedd Kate Roberts yn llenor enwog yn y Gymraeg. Fe\u0027i ganed ym mhentref Rhosgadfan, yn yr hen Sir Gaernarfon a bu farw yn Ninbych. Gelwir Kate Roberts yn \u0022Frenhines y stori fer\u0022.",
  "wikiArticle": "Roedd Kate Roberts yn llenor enwog yn y Gymraeg. Fe\u0027i ganed ym mhentref Rhosgadfan, yn yr hen Sir Gaernarfon a bu farw yn Ninbych. Gelwir Kate Roberts yn \u0022Frenhines y stori fer\u0022.\r\n\r\n== Bywgraffiad ==\n\nKate Roberts oedd plentyn cyntaf Owen a Catrin Roberts. Roedd ei thad yn chwarelwr. Roedd ganddi hi ddwy hanner-chwaer a dau hanner-brawd hŷn o briodasau cyntaf ei rhieni a thri brawd iau . Ganed hi yn y bwthyn teuluol Cae\u0027r Gors, yn Rhosgadfan ar lethrau Moel Tryfan. Yn ddiweddarach byddai\u0027r bywyd yng Nghae\u0027r Gors a\u0027r pentref yn gefndir hollbwysig yn ei gwaith llenyddol cynnar. Mae ei chyfrol hunangofiannol Y Lôn Wen yn bortread cofiadwy o\u0027r ardal yn y cyfnod hwnnw. Prynodd Roberts Gae\u0027r Gors yn 1965 a\u0027i gyflwyno i\u0027r genedl, ond nid oedd digon o arian i\u0027w adfer ar y pryd. Nis adferwyd tan 2005 ar ôl brwydr hir i\u0027w ariannu, ac mae erbyn hyn o dan ofal Cadw ac yn amgueddfa i\u0027r awdures.\nAeth hi i Ysgol y Cyngor, Rhosgadfan ac wedyn i Ysgol Sir Gaernarfon . Astudiodd Gymraeg yng Ngholeg Prifysgol Cymru Bangor rhwng 1910 a 1913 o dan John Morris-Jones ac Ifor Williams. Bu\u0027n athrawes yn Ysgol Elfennol Dolbadarn , Ysgol Sir Ystalyfera, De Cymru a Ysgol Sir y Genethod, Aberdâr . Derbyniodd ddoethuriaeth er anrhydedd yn 1950 gan Brifysgol Cymru.\nPriododd Kate Roberts a Morris T. Williams , argraffydd, yn 1928. Gyda\u0027i gilydd, roeddent yn rhedeg Gwasg Gee yn Ninbych. Bu ei gŵr farw ym 1946, a bu\u0027n rhedeg Gwasg Gee am 10 mlynedd ar ei phen ei hun. Yn ei lyfr, Kate: Cofiant Kate Roberts 1891-1985, awgryma Alan Llwyd fod gan Roberts dueddiadau hoyw.\r\n\r\n== Ei gwaith llenyddol ==\nYn ei blynyddoedd cynnar fel llenor ysgrifennai nofelau a storïau byrion am dlodi a chaledi ardal y chwareli yng ngogledd Cymru. Yn ddiweddarach, ar ôl symud i Ddinbych a phriodi, troes at ysgrifennu nofelau a straeon mwy seicolegol gydag unigrwydd yn thema amlwg ynddynt. Cyfieithwyd rhai o\u0027u gweithiau i\u0027r Saesneg ac i ieithoedd eraill.",
  "imageNames": [
    "Kate_Roberts_author.jpg",
    "Kate_Roberts_1923.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1891,
  "end": 1985,
  "categoryId": "unigolion-nodedig",
  "id": "kate-roberts",
  "label": "Kate Roberts"
}