{
  "wikiSummary": "Roedd David Lloyd George, Iarll 1af Lloyd George o Ddwyfor , a adnabyddid fel y \u0027Dewin Cymreig\u0027, yn wleidydd Cymreig ac yn Brif Weinidog ar y Deyrnas Unedig rhwng Rhagfyr 1916 a Hydref 1922. Hyd yma, ef yw\u0027r unig Gymro i ddal y swydd; y Gymraeg oedd ei famiaith. Caiff ei gydnabod fel pensaer y wladwriaeth les. Ef oedd prif weinidog Rhyddfrydol diwethaf y Deyrnas Unedig. Ym mlwyddyn olaf ei oes cafodd ei ddyrchafu\u0027n iarll gan y brenin Siôr VI.\nYn Chorlton-on-Medlock, Manceinion, Lloegr, y cafodd ei eni. Treuliodd ei blentyndod ym mhentref Llanystumdwy, Eifionydd, o 1864 hyd 1880, lle cafodd ei fagu ar aelwyd Gymraeg gan ei fam weddw a\u0027i ewythr Richard Lloyd. Daeth yn gyfreithiwr gyda phractis yng Nghricieth erbyn 1885.\nDavid Lloyd George yw’r gwladweinydd rhyngwladol mwyaf a gynhyrchodd Cymru erioed.  Bu ei ddylanwad yn drwm ar wleidyddiaeth, nid yn unig yng Nghymru a Phrydain, ond hefyd yn Ewrop, yn enwedig yn ei rôl fel un o’r ‘Tri Mawr’ a fu’n gyfrifol am lunio Cytundeb Versailles wedi’r Rhyfel Byd Cyntaf.\nBu\u0027n aelod seneddol Rhyddfrydol am hanner can mlynedd, gan wasanaethu mewn llywodraethau fel Llywydd y Bwrdd Masnach , Canghellor y Trysorlys , Gweinidog Arfau a Gweinidog Rhyfel . Yn Rhagfyr 1916,, daeth yn Brif Weinidog ar ganol y Rhyfel Byd Cyntaf yn dilyn ymddiswyddiad Herbert Asquith.\nRoedd yn un o Brif Weinidogion mwyaf amlwg Prydain yn ystod yr ugeinfed ganrif, ac fe arweiniodd y wlad drwy gyfnod argyfyngus yn ei hanes yn ystod y Rhyfel Byd Cyntaf. Roedd yn adnabyddus am ei sgiliau fel arweinydd ac fel siaradwr effeithiol a huawdl. Medrai ennill cefnogaeth a brwdfrydedd gwahanol gynulleidfaoedd ar draws y deyrnas ar gyfer gwahanol ymgyrchoedd ac achosion. Er ei fod yn erbyn mynd i ryfel ar y dechrau yn 1914, erbyn 1918 roedd yn cael ei ddisgrifio ym Mhrydain fel  \u0022Y Dewin Cymreig\u0022 a\u0027r ‘y dyn a wnaeth ennill y rhyfel’. Mae’n cael ei gofio hyd heddiw hefyd am ei ddefnydd o filwyr Prydeinig yn Iwerddon ac am fod yn brif negodydd Cytundeb Eingl-Wyddelig a sefydlodd Wladwriaeth Rydd Iwerddon, ond drwy wneud hynny rhannwyd yr ynys yn ddwy.",
  "wikiArticle": "Roedd David Lloyd George, Iarll 1af Lloyd George o Ddwyfor , a adnabyddid fel y \u0027Dewin Cymreig\u0027, yn wleidydd Cymreig ac yn Brif Weinidog ar y Deyrnas Unedig rhwng Rhagfyr 1916 a Hydref 1922. Hyd yma, ef yw\u0027r unig Gymro i ddal y swydd; y Gymraeg oedd ei famiaith. Caiff ei gydnabod fel pensaer y wladwriaeth les. Ef oedd prif weinidog Rhyddfrydol diwethaf y Deyrnas Unedig. Ym mlwyddyn olaf ei oes cafodd ei ddyrchafu\u0027n iarll gan y brenin Siôr VI.\nYn Chorlton-on-Medlock, Manceinion, Lloegr, y cafodd ei eni. Treuliodd ei blentyndod ym mhentref Llanystumdwy, Eifionydd, o 1864 hyd 1880, lle cafodd ei fagu ar aelwyd Gymraeg gan ei fam weddw a\u0027i ewythr Richard Lloyd. Daeth yn gyfreithiwr gyda phractis yng Nghricieth erbyn 1885.\nDavid Lloyd George yw’r gwladweinydd rhyngwladol mwyaf a gynhyrchodd Cymru erioed.  Bu ei ddylanwad yn drwm ar wleidyddiaeth, nid yn unig yng Nghymru a Phrydain, ond hefyd yn Ewrop, yn enwedig yn ei rôl fel un o’r ‘Tri Mawr’ a fu’n gyfrifol am lunio Cytundeb Versailles wedi’r Rhyfel Byd Cyntaf.\nBu\u0027n aelod seneddol Rhyddfrydol am hanner can mlynedd, gan wasanaethu mewn llywodraethau fel Llywydd y Bwrdd Masnach , Canghellor y Trysorlys , Gweinidog Arfau a Gweinidog Rhyfel . Yn Rhagfyr 1916,, daeth yn Brif Weinidog ar ganol y Rhyfel Byd Cyntaf yn dilyn ymddiswyddiad Herbert Asquith.\nRoedd yn un o Brif Weinidogion mwyaf amlwg Prydain yn ystod yr ugeinfed ganrif, ac fe arweiniodd y wlad drwy gyfnod argyfyngus yn ei hanes yn ystod y Rhyfel Byd Cyntaf. Roedd yn adnabyddus am ei sgiliau fel arweinydd ac fel siaradwr effeithiol a huawdl. Medrai ennill cefnogaeth a brwdfrydedd gwahanol gynulleidfaoedd ar draws y deyrnas ar gyfer gwahanol ymgyrchoedd ac achosion. Er ei fod yn erbyn mynd i ryfel ar y dechrau yn 1914, erbyn 1918 roedd yn cael ei ddisgrifio ym Mhrydain fel  \u0022Y Dewin Cymreig\u0022 a\u0027r ‘y dyn a wnaeth ennill y rhyfel’. Mae’n cael ei gofio hyd heddiw hefyd am ei ddefnydd o filwyr Prydeinig yn Iwerddon ac am fod yn brif negodydd Cytundeb Eingl-Wyddelig a sefydlodd Wladwriaeth Rydd Iwerddon, ond drwy wneud hynny rhannwyd yr ynys yn ddwy.\r\n\r\n== Teulu a bywyd cynnar ==\n\nGanwyd Lloyd George yn Chorlton-on-Medlock, Manceinion, Lloegr ar 17 Ionawr, 1863.  Ei dad oedd William George o Drefwrdan, Sir Benfro a’i fam oedd Elizabeth Lloyd o Lanystumdwy, Gwynedd.  Cyfarfu’r ddau pan oedd William George yn dysgu yn Ysgol Troed-yr-allt, Pwllheli ac wedyn symudodd y teulu i Fanceinion lle ganwyd David Lloyd George. Cyn diwedd y flwyddyn symudodd y teulu yn ôl i Sir Benfro i gadw tyddyn. Nid oedd William George yn ddyn iach yn gorfforol ac roedd yn cael ei flino gan iselder ysbryd. Ym Mehefin 1864 bu farw William George ac o fewn pedwar mis symudodd Elizabeth, ei weddw, a’i phlant, Ellen a David, yn ôl i Lanystumdwy i fyw at Richard, ei brawd. Ymhen ychydig fisoedd ganwyd plentyn arall iddi a enwyd yn William ar ôl ei dad.\nFelly er mai yn Lloegr y ganwyd ef, Llanystumdwy yn Eifionydd fu ei ‘gartref’ erioed. Dyma fro mebyd ei fam ac yma y bu’n byw tan roedd yn ddwy ar bymtheg. Bu brawd ei fam, Richard Lloyd yn ddylanwad mawr ar y David Lloyd George ifanc. Mewn gwirionedd roedd yn athro ac arweinydd i’w nai hyd 1917, pan fu farw yn ei wythdegau. Gweithiai fel crydd. Roedd yn Rhyddfrydwr cryf o ran ei wleidyddiaeth ac yn gapelwr cadarn ei argyhoeddiad.  \nPriododd ei wraig gyntaf, Margaret Owen, merch fferm leol, ar Ionawr 24, 1888 a chawsant bump o blant: Richard , Mair , Olwen , Gwilym a Megan .  Bu farw’r Fonesig Margaret yn 1941 ac yn 1943 ail-briododd Lloyd George. Ei ail wraig oedd Frances Stevenson ac ym Medi 1944 ymgartrefodd y ddau yn Tŷ Newydd, Llanystumdwy.  Ar Ionawr 1af 1945 cafodd ei ddyrchafu yn Iarll Lloyd George o Ddwyfor.  Bu farw ar Mawrth 26, 1945 yng Nghricieth yn 82 oed, ac fe’i claddwyd ar lan afon Dwyfor yn Llanystumdwy.\r\n\r\n== Gyrfa ==\nWedi iddo lwyddo yn arholiadau rhagbaratoawl Cymdeithas y Gyfraith cafodd waith fel prentis-gyfreithiwr yn swyddfa Breese, Jones a Casson ym Mhorthmadog yn 1878. Yn dilyn anghydweld yn y swyddfa ym Mhorthmadog sefydlodd ei fusnes ei hun yng Nghricieth yn 1885. Yn ystod y cyfnod hwn hefyd roedd yn dangos diddordeb mewn gwleidyddiaeth ac roedd ganddo syniadau radicalaidd. Cymerodd ran flaenllaw yn yr etholiad cyffredinol yn etholaeth Meirionnydd yn 1885.\nDangosodd ei fod yn ddyn radical ei ddaliadau yn achos mynwent Llanfrothen, lle dadleuodd bod yr un hawliau gan Anghydffurfwyr i gael eu claddu ym mynwent Eglwys y plwyf ag oedd gan Eglwyswyr. Rhoddodd yr achos lwyfan cyhoeddus i Lloyd George gael ei weld fel amddiffynnwr hawliau anghydffurfiol. Aeth yr achos i’r Llys Apêl yn Llundain, a gyda’r fath sylw llwyddodd i gael ei enwebu fel ymgeisydd y Blaid Ryddfrydol yn etholaeth Bwrdeisdrefi Caernarfon. Daeth yn adnabyddus am lefaru ac amddiffyn achosion radicalaidd dro ar ôl tro. Etholwyd ef yn Aelod Seneddol Caernarfon ar 10 Ebrill, 1890. Hon oedd ei fuddugoliaeth gyntaf mewn cyfres o bedwar ar ddeg o etholiadau a frwydrodd rhwng 1880 a 1945.\nYn y 1890au, gyda mudiad gwladgarol Cymru Fydd ar ei anterth, defnyddiodd ei safle fel Aelod Seneddol i ddadlau\u0027n frwd yn Senedd San Steffan dros achosion fel Datgysylltu\u0027r Eglwys Anglicanaidd yng Nghymru a hunanlywodraeth i Gymru, yr Alban ac Iwerddon. Ond daeth trai ar ffawd Cymru Fydd a throdd Lloyd George fwyfwy at wleidyddiaeth Brydeinig, gan godi yn rhengoedd y Blaid Ryddfrydol. Gwrthwynebodd y rhyfel gwladychol yn Ne Affrica a adnabyddir fel Rhyfel y Boer ac am gyfnod bu\u0027n amhoblogaidd yn Lloegr, ond ni chollodd ei gefnogaeth frwd yng Nghymru, yn enwedig am iddo aros yn gefnogol I’r ymgyrch i Ddatgysylltu\u0027r Eglwys.\n\n\n=== Y Blaid Ryddfrydol ===\n\nRoedd David Lloyd George yn aelod o Gabinet y Llywodraeth Ryddfrydol a ddaeth i rym wedi Etholiad Cyffredinol 1906. Roedd wedi ei benodi yn Llywydd y Bwrdd Masnach flwyddyn ynghynt, ac yn 1908 penodwyd ef yn Ganghellor y Trysorlys gan Herbert Asquith, y Prif Weinidog. Un o’r pethau cyntaf a wnaeth Lloyd George fel Canghellor y Trysorlys oedd ceisio gwarchod pobl llai ffodus, fel pobl dlawd, pobl anabl, plant a’r henoed. Dyma pam y cyflwynodd ‘Gyllideb y Bobl’ yn 1909. Roedd hon yn gyllideb a oedd yn cyhoeddi rhyfel yn erbyn tlodi ymhlith y grwpiau mwyaf anghenus yn y gymdeithas. Byddai’n codi trethi’r dosbarth uwch er mwyn ariannu’r gyllideb. Dyma’r gyllideb a ddefnyddiodd i gyflwyno pensiwn i\u0027r henoed ac yswiriant iechyd cenedlaethol. Yn 1911 cyflwynodd y Mesur Yswiriant Cenedlaethol a fyddai’n golygu bod y llywodraeth, cyflogwyr a gweithwyr yn talu tuag at gynlluniau yswiriant iechyd a diweithdra. Ac yntau\u0027n aelod pwysig o’r llywodraeth ac wedyn yn Brif Weinidog, roedd Lloyd George yn darged cyson ar gyfer protestiadau\u0027r Swffragetiaid a alwai am bleidlais i ferched. Gwaeddodd Swffragetiaid ar draws ei areithiau yn yr Eisteddfod Genedlaethol ac ym Mhafiliwn Caernarfon, lle cafodd y protestwyr eu curo gan y dorf. Ym 1912 cafwyd protest enwocaf y Swffragetiaid yng Nghymru pan ddychwelodd Lloyd George i’w bentref genedigol Llanystumdwy i agor neuadd newydd y pentref. Gwaeddodd y Swffragetiaid ar draws ei araith. Cafodd y merched eu llusgo o’r neuadd yn filain iawn a\u0027u curo. Tynnwyd dillad un o’r merched a bu bron i un arall gael ei thaflu ar y creigiau oddi ar bont Afon Dwyfor gerllaw.\nPan ddechreuoddy Rhyfel Byd Cyntaf yn 1914 petrusodd Lloyd George cyn ei chefnogi, ond unwaith iddo benderfynu ei bod yn rhyfel angenrheidiol bu\u0027n gefnogwr brwd: mae rhai haneswyr yn gweld hyn fel y cyfnod y bradychodd Lloyd George ei egwyddorion drwy gefnogi rhyfel imperialaidd a rhoi pellter mawr rhyngddo a\u0027r syniad o gael hunanlywodraeth i Gymru. Yn 1915 penodwyd ef yn Weinidog Arfau o 1915 hyd 1916 ac yn Rhagfyr 1916 daeth yn Brif Weinidog gyda phwerau eang iawn am ei bod yn adeg rhyfel.\n\n\n=== Gweinidog Arfau ===\nYn 1915 penodwyd ef yn Weinidog Arfau gyda chyfrifoldeb dros sicrhau bod mwy o arfau, fel bwledi a bomiau, yn cael eu cynhyrchu a bod y lluoedd arfog ar feysydd y gad yn derbyn digon o arfau ac adnoddau. Cyn hynny doedd Prydain ddim yn cynhyrchu digon o sieliau ac arfau i gyflenwi’r milwyr ar Ffrynt y Gorllewin. Sylweddolodd hefyd mor bwysig oedd merched i’r gweithlu yn ystod y rhyfel ac felly recriwtiodd hwy i weithio mewn ffatrïoedd arfau.  Bu hyn yn allweddol bwysig o ran rhoi’r bleidlais i rai ohonynt ar ôl y Rhyfel Byd Cyntaf.\nBu Lloyd George yn llwyddiannus iawn fel Gweinidog Arfau ond roedd hefyd wedi cael llond bol ar arafwch ac aneffeithlonrwydd ei Lywodraeth ei hun yn y Rhyfel. Roedd yn anghydweld â’r Prif Weinidog, Asquith, yn arbennig ynghylch gorfodaeth filwrol. Cefnogai Lloyd George y polisi yn gyhoeddus ac fe gryfhawyd ei safle oddi fewn y Cabinet pan fu’n rhaid i Asquith gyflwyno mesur gorfodaeth ar ddechrau 1916. Gwanhawyd awdurdod Asquith yn sgil beirniadaeth i\u0027w Lywodraeth pan benderfynwyd saethu pedwar ar ddeg o’r arweinwyr cenedlaethol oherwydd eu rôl yng Ngwrthryfel y Pasg yn Nulyn, Iwerddon.\n\n\n=== Gweinidog Rhyfel a Phrif Weinidog ===\n\nYn dilyn marwolaeth Kitchener, a foddwyd mewn ymosodiad torpedo gan yr Almaenwyr, penodwyd Lloyd George yn Ysgrifennydd Gwladol y Rhyfel yng Ngorffennaf 1916. Rhoddodd hyn Lloyd George mewn safle cryfach fyth i herio’r Prif Weinidog, ac yn Rhagfyr 1916 daeth yn Brif Weinidog yn lle Asquith. Un o’r pethau cyntaf a wnaeth fel Prif Weinidog oedd creu Cabinet Rhyfel o bum unigolyn a fyddai’n rheoli popeth ynglŷn â’r rhyfel. Lloyd George oedd cadeirydd y Cabinet. Un o’i orchestion pwysig fel Prif Weinidog oedd cyflwyno’r system gonfoi yn 1917 er mwyn amddiffyn llongau oedd yn cludo bwyd i Brydain, ar draws Cefnfor yr Iwerydd, rhag cael eu suddo gan longau tanfor yr Almaenwyr. Rhoddodd Lloyd George ei stamp personol ei hun ar bopeth a wnai’r Llywodraeth, ac roedd ei bersonoliaeth a\u0027i arweinyddiaeth yn allweddol o ran arwain Prydain i fuddugoliaeth yn 1918. Pan ddaeth heddwch yn 1918 Lloyd George oedd ‘y dyn a enillodd y Rhyfel’.\nSicrhaodd llwyddiant David Lloyd George yn y Rhyfel ei le fel Prif Weinidog pan enillodd fwyafrif llethol yn Etholiad Cyffredinol Rhagfyr 1918.   \n\n\n=== Corfflu’r Fyddin Gymreig ===\nRoedd Lloyd George yn gefnogol i’r syniad o sefydlu Byddin Gymreig, fel y dangosodd mewn araith a draddododd yn Neuadd y Frenhines yn Langham Place, Llundain ar Medi 19, 1914. Gyda’r Rhyfel Byd Cyntaf newydd ddechrau, ac yntau ar y pryd yn Ganghellor y Trysorlys, pwysleisiodd mor bwysig oedd hi bod gwledydd pwerus fel Prydain yn helpu i amddiffyn gwledydd bach fel Gwlad Belg a Serbia. Apeliodd at hanes a gwladgarwch Cymru er mwyn hyrwyddo’r syniad o sefydlu byddin Gymreig. Dyma oedd hedyn cychwyn Corfflu’r Fyddin Gymreig neu ‘Byddin Lloyd George’ fel y daeth i gael ei hadnabod. Cyn pen diwedd mis Medi 1914 roedd cyfarfod wedi ei gynnal yn 11 Stryd Downing, a chynhaliwyd cyfarfod yng Nghaerdydd er mwyn lansio cynllun ar gyfer sefydlu Corfflu Cymreig, gydag Iarll Plymouth yn Gadeirydd ac Owen W. Owen yn Ysgrifennydd. Penderfynwyd y byddai Cymru a Sir Fynwy yn codi Corfflu cyfan, a hynny gyda sêl bendith Ysgrifennydd Gwladol y Rhyfel, sef Arglwydd Kitchener.\nPenodwyd y Parchedig John Williams, Brynsiencyn, Ynys Môn, a chyfaill i Lloyd George, yn Gaplan i’r Fyddin Gymreig yn ddiweddarach. Erbyn diwedd Chwefror 1915 roedd y Corfflu Cymreig yn cynnwys 20,000 o ddynion, sef digon ar gyfer sefydlu un Adran o’r ddwy Adran a gynlluniwyd. Cafodd yr Adran gyntaf hon ei hadnabod fel y 38ain Adran Gymreig a fu’n brwydro yn ddiweddarach ym Mrwydr Coed Mametz, Gorffennaf 1916.\n\n\n=== Cytundeb Versailles 1919 ===\nFel Prif Weinidog Prydain, David Lloyd George oedd prif gynrychiolydd Prydain yng Nghynhadledd Heddwch Paris, lle drafftiwyd Cytundeb Versailles ym Mehefin 1919. Pwrpas y cyfarfod oedd trafod telerau heddwch ar ôl diwedd y Rhyfel Byd Cyntaf. Roedd yn un o benseiri\u0027r Cytundeb a fu’n gyfrifol am ail-lunio ffiniau gwledydd newydd yn Ewrop ar ôl y Rhyfel Byd Cyntaf. Nid oedd yn awyddus i lunio cytundeb llym a oedd yn gwneud i’r Almaen ‘dalu’ am y rhyfel, ond ni lwyddodd i osgoi hynny oherwydd roedd y galwad am ddial yn gryf iawn, yn enwedig yn Ffrainc. Dadl rhai haneswyr dylanwadol iawn yw mai’r amodau llym a osodwyd ar yr Almaen yng Nghytundeb Versailles, ac effeithiau’r rhain ar economi ac ysbryd pobl yr Almaen, oedd rhai o’r ffactorau pwysicaf wnaeth arwain at boblogrwydd Hitler a’i bolisi tramor yn ystod y 1930au, ac yn y pen draw felly at yr Ail Ryfel Byd.\nErbyn 1922 roedd wedi ymddeol o fywyd gwleidyddol ac nid ymgymerodd ag unrhyw swydd mewn awdurdod byth eto.\r\n\r\n== Cyfarfod Hitler yn Berchesgaten ==\nYm Medi 1936 treuliodd David Lloyd George bythefnos yn yr Almaen gan gyfarfod ag Adolf Hitler ddwywaith. Roedd Hitler wedi bod mewn grym am dair blynedd a hanner ac wedi llwyddo i ddileu diweithdra ar raddfa eang, a hyn oedd y rheswm pam roedd Lloyd George yn awyddus i\u0027w gyfarfod. Trafodwyd y sefyllfa ryngwladol, amaethyddiaeth a materion cymdeithasol. Roedd Lloyd George yn frwdfrydig iawn am agweddau\u0027r Almaen tuag at ddiweithdra, yswiriant iechyd, a mudiadau lles a hamdden.\r\n\r\n== Marwolaeth ==\nAr 26 Mawrth 1945, ar ôl salwch byr, bu farw David Lloyd George yn dawel yng Nghricieth, ac yntau\u0027n 82 oed, ac fe\u0027i claddwyd yn Llanystumdwy ar lan afon Dwyfor, dafliad carreg o weithdy’r crydd lle magwyd ef. Cynlluniwyd y beddrod gan Clough Williams-Ellis, sef pensaer Portmeirion rhwng Penrhyndeudraeth a Phorthmadog.\r\n\r\n== Y cyfnod diweddar ==\nYng ngwanwyn 2013 cyhoeddodd y Swyddfa Bost stamp gyda llun ohono i ddathlu 150 mlynedd ers ei eni.\r\n\r\n== Ffilmiau a llyfrau ==\nThe Life Story of David Lloyd George The Life and Times of David Lloyd George == Gweler hefyd ==\nAchos claddu Llanfrothen\nRhamant Bywyd Lloyd George",
  "imageNames": [
    "2211-lloyd-george.jpg",
    "Big_four.jpg",
    "ChurchillGeorge0001.jpg",
    "ClemenceauLloydGeorgeYOrlando.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1863,
  "end": 1945,
  "categoryId": "arweinwyr",
  "id": "lloyd-george",
  "label": "David Lloyd George"
}