{
  "wikiSummary": "Erthygl am yr adroddiad addysg yw hon. Gweler hefyd Brad .\nAdroddiad ar gyflwr addysg yng Nghymru a gomisiynwyd gan senedd San Steffan oedd Brad y Llyfrau Gleision. Cyflwynwyd yr Adroddiad terfynol yn 1847  a\u0027i argraffu yn dair cyfrol yn Nhachwedd y flwyddyn honno. Cyfeiria lliw y llyfrau at y clawr glas a roddwyd arnynt . Mae\u0027r enw ei hun yn fwysair ar Frad y Cyllyll Hirion, pan laddwyd nifer o bendefigion y Brythoniaid trwy ddichell y Saeson, yn ôl traddodiad, wedi i Hengist wahodd Gwrtheyrn i\u0027w wledd. Y bardd a gwladgarwr R. J. Derfel a fathodd yr enw yn ei ddrama Brad y Llyfrau Gleision .",
  "wikiArticle": "Erthygl am yr adroddiad addysg yw hon. Gweler hefyd Brad .\nAdroddiad ar gyflwr addysg yng Nghymru a gomisiynwyd gan senedd San Steffan oedd Brad y Llyfrau Gleision. Cyflwynwyd yr Adroddiad terfynol yn 1847  a\u0027i argraffu yn dair cyfrol yn Nhachwedd y flwyddyn honno. Cyfeiria lliw y llyfrau at y clawr glas a roddwyd arnynt . Mae\u0027r enw ei hun yn fwysair ar Frad y Cyllyll Hirion, pan laddwyd nifer o bendefigion y Brythoniaid trwy ddichell y Saeson, yn ôl traddodiad, wedi i Hengist wahodd Gwrtheyrn i\u0027w wledd. Y bardd a gwladgarwr R. J. Derfel a fathodd yr enw yn ei ddrama Brad y Llyfrau Gleision .\r\n\r\n== Y cefndir ==\nCymraeg oedd iaith Cymry cyfnod y Llyfrau Gleision ac roedd Cymry uniaith yn y mwyafrif.\r\n\r\n== Yr adroddiad ==\nComisiynwyd yr Adroddiad yn dilyn cais William Williams, Aelod Seneddol Coventry ond Cymro o Lanpumsaint, Sir Gaerfyrddin, yn wreiddiol. Roedd yn ddyn hynod o wrth-Gymraeg ac yn Sais-addolwr. Yn ôl Williams, roedd angen trefn addysg newydd fel y byddai\u0027r Cymry \u0022instead of appearing as a distinct people, in no respect differ from the English\u0022. Troi\u0027n Sais o ran iaith a meddylfryd oedd yr ateb i gyflwr y Cymry. Roedd y Cymry dan anfantais oherwydd \u0022the existence of an ancient language\u0022.\nYn dilyn dros ddegawd o anghydfod - terfysgoedd ym Merthyr yn 1831, y Siartwyr yn Y Drenewydd a Chasnewydd yn 1839 a Merched Beca trwy gydol y ddegawd cyn 1846, roedd pryder cyffredin ymysg y Sefydliad ar y pryd am sefyllfa gymdeithasol a moesol y Cymry. Teimlai nifer mai\u0027r Gymraeg a diffyg addysg oedd gwraidd nifer o\u0027r trafferthion. Meddai\u0027r Times o Lundain am y Gymraeg:\n\nIts prevalence and the ignorance of English have excluded and even now exclude the Welsh people from the civilisation of their English neighbours. An Eisteddfod... is simply a foolish interference with the natural progress of civilisation and prosperity.\nBu\u0027r adroddiad gan Ralph Robert Wheeler Lingen, Jelinger Cookson Symons a Henry Robert Vaughan Johnson, tri Eglwyswr o Sais na siaradai Gymraeg, yn ysgytwad i Gymry\u0027r cyfnod gan iddo daflu amheuaeth ar eu moesoldeb ac am natur gyfrin a gwrthryfelgar yr iaith Gymraeg. Yr ymateb yma o \u0027frad\u0027 gan y Sefydliad Seisnig oedd y rheswm i\u0027r term \u0027Brad y Llyfrau Gleision\u0027 gael ei fathu. Yn ei ragymadrodd dywedir:\n\nThe Welsh language is a vast drawback to Wales and a manifold barrier to the moral progress and commercial prosperity of the people.\nWrth gydnabod bod elfennau o hiliaeth i\u0027r ymdriniaeth o\u0027r Cymry yn y Llyfrau Gleision, yn ei lyfr Pam na fu Cymru mae Simon Brooks yn dadlau mai prosiect rhyddfrydol oedd yr adroddiad, gyda\u0027r bwriad o wella sefyllfa fydol y Cymry fel unigolion drwy roi mynediad iddynt i\u0027r byd modern a gynrychiolid gan yr iaith Saesneg.\r\n\r\n== Ymatebion i\u0027r adroddiad ==\nMae\u0027r Adroddiad yn adnodd hynod ddiddorol a gwerthfawr i haneswyr cymdeithasol a lleol. Ond ei brif effaith a\u0027i enwogrwydd oedd iddo greu adwaith seicolegol o waseidd-dra ymhlith y Cymry wrth iddynt geisio gwrth-brofi’r sen ar eu moesoldeb a\u0027u hiaith a achoswyd gan yr Adroddiad.\nYn ei ddarlith radio adnabyddus \u0022Tynged yr Iaith\u0022, meddai Saunders Lewis:\n\nPrin fod neb awdwr o Gymro eto wedi cydnabod yr hyn sy\u0027n wir, mai\u0027r Llyfrau Gleision hyn yw\u0027r ddogfen hanesyddol bwysicaf a feddwn yn y bedwaredd ganrif ar bymtheg a bod ynddi stôr o wybodaeth nas defnyddiwyd eto.\nCyfansoddodd y bardd John Ceiriog Hughes ei ddilyniant o gerddi \u0027Alun Mabon\u0027 fel ymateb ymwybodol i\u0027r darlun o\u0027r Cymry a geir yn yr Adroddiad.\nCyhoeddwyd casgliad o ymatebion i\u0027r adroddiad yn 1991 yn y llyfr Brad y Llyfrau Gleision wedi\u0027i olygu gan Prys Morgan.",
  "imageNames": [
    "Blue_Books_prt_2_no.9_p.66_-_Evils_of_the_Welsh_Language.gif"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1847,
  "categoryId": "cymdeithasol",
  "id": "llyfrau-gleision",
  "label": "Llyfrau gleision"
}