{
  "wikiSummary": "Gweler hefyd Llywelyn ap Iorwerth a Llywelyn .\n\nLlywelyn ap Gruffudd  oedd Tywysog Cymru o 1258–1282 tan y lladdwyd ef gan filwyr Seisnig yng Nghilmeri, a\u0027r cyntaf i gael ei gydnabod yn Dywysog Cymru gan Frenin Lloegr.\nEi nod oedd ceisio uno Cymru, a brwydrodd yn galed yn erbyn Brenhinoedd Lloegr, yn enwedig Edward I, i gyflawni hyn. Mae llawer o bobl yn ei alw’n Llywelyn ein Llyw Olaf am mai ef oedd tywysog olaf Cymru cyn i Frenin Lloegr, Edward I, reoli Cymru gyfan.\nMae ei enw yn ymddangos am y tro cyntaf mewn cofnodion yn 1243.  Ar farwolaeth ei ewyrth Dafydd ap Llywelyn yn 1246, ef oedd yr olynydd amlwg, ond yn ôl Cytundeb Woodstock yn 1247 rhannwyd Gwynedd rhwng y tri brawd: Llywelyn, Owain a Dafydd. Yn 1255 gorchfygodd Llywelyn ei ddau frawd a sefydlodd ei hun yn unig reolwr Gwynedd Uwch Conwy. Y flwyddyn wedyn roedd y Berfeddwlad o dan ei arweinyddiaeth ac o fewn dwy flynedd roedd y rhan fwyaf o\u0027r Gymru frodorol yn ei feddiant.\nAr ôl ryfel cartref yn Lloegr yn 1263 dan arweiniad Simon de Montfort, llofnodwyd Cytundeb Trefaldwyn. Roedd y cytundeb rhwng Llywelyn a Harri III o Loegr yn cydnabod safle Llywelyn fel Tywysog Cymru gyda\u0027r hawl i wrogaeth pob tywysog ac arglwydd yn y Gymru annibynnol. Gwnaed hynny ym mhresenoldeb Ottobuono, llysgenad y Pab.\nBu farw Harri III yn 1272 ac ar ôl i Edward I gael ei goroni yn frenin Lloegr dechreuodd y drwgdeimlad rhwng y ddwy wlad godi unwaith eto. Ar 21 Mawrth 1282 ymosododd Dafydd ap Gruffudd, brawd ieuengaf Llywelyn, ar Gastell Penarlâg, oedd ym meddiant y Saeson, gan ei feddiannu. Bu raid i Lywelyn gefnogi\u0027r ymosodiad, gan fod y Cymry yn anesmwytho gan fod Edward wedi penodi Saeson i fod mewn grym yng Nghymru.\nCafwyd buddugoliaeth arall ger Afon Menai a llwyddodd y Cymry yng Ngheredigion a Dyffryn Tywi. Mentrodd Llywelyn ddod o\u0027i loches yn Eryri a mynd i\u0027r Canolbarth. Yno, mewn cynllwyn Seisnig, lladdwyd Llywelyn yng Nghilmeri gan filwr o Sais ar 11 Rhagfyr 1282. Mae 11 Rhagfyr yn ddyddiad sy\u0027n cael ei gadw gan lawer fel Gŵyl i\u0027w gofio.",
  "wikiArticle": "Teyrnas Llywelyn ==\nBu\u0027n rhaid i dywysogion Gwynedd wrthsefyll sawl ymdrech i orchfygu gogledd Cymru. Erbyn dechrau’r 13g, roedd Llywelyn Fawr yn hawlio teitl Tywysog Gogledd Cymru. Roedd ei deyrnas yn ymestyn i lawr i Bowys a Cheredigion. Yn 1267 cafodd ŵyr Llywelyn Fawr, sef Llywelyn ap Gruffudd, ei gydnabod yn Dywysog Cymru gan Harri III. Erbyn hyn, caiff ei adnabod hefyd fel ‘Llywelyn ein Llyw Olaf’, sy’n golygu ‘ein harweinydd olaf’.\r\n\r\n== Y cyfnod cyn rhyfel 1277 ==\n\nErbyn 1247 roedd Llywelyn yn teyrnasu dros Wynedd gyda’i frawd Owain, ond erbyn 1255 roedd ei frodyr Owain a Dafydd wedi troi yn erbyn Llywelyn. Sylweddolodd Llywelyn mai\u0027r unig obaith i Gymru oedd iddo ef fod yn Dywysog cydnabyddedig Cymru, a chasglodd ynghyd fyddin gref. Roedd rhaid i\u0027r anghydfod ddod i ben, ac fe gafwyd brwydr hir a ffyrnig rhwng Llywelyn ac Owain, Dafydd a Rhodri ei frodyr. Llywelyn fu\u0027n fuddugol ym Mrwydr Bryn Derwin.\nAeth Llywelyn o nerth i nerth ar ôl Brwydr Bryn Dewin. Enillodd y Berfeddwlad yn ei hôl, a meddiannu Ceredigion, ac yna aeth yn ei flaen i Ddyffryn Tywi ac enillodd dir y Normaniaid hyd at Sir Benfro. Yn ffodus i Lywelyn roedd y barwniaid wedi codi yn erbyn y brenin Harri III o Loegr. Erbyn 1263 daeth yn rhyfel cartref dan arweiniad Simon de Montfort. Pan ddaeth y gwrthryfel i ben sylweddolodd Llywelyn y gallai brenin Lloegr fod yn fygythiad eto ac felly arwyddodd Gytundeb Trefaldwyn.\nFe wnaeth brenin Lloegr gydnabod Cymro am y tro cyntaf a\u0027r tro olaf yn Dywysog Cymru yn y cytundeb hwn . Cafodd Llywelyn hefyd gadw\u0027r tiroedd yr oedd wedi eu hennill, ac fe wnaeth y brenin ganiatáu priodas rhwng Llywelyn ac Eleanor de Montfort, er ei bod hi a\u0027i theulu yn Ffrainc ar y pryd, mewn alltudiaeth. Cytunodd Llywelyn i dalu gwrogaeth a\u0027i deyrngarwch i\u0027r brenin.\n\nErbyn 1270 ceisiodd Llywelyn ymestyn ei bŵer drwy ymosod ar Gastell Caerffili a\u0027i losgi - castell a oedd yn cael ei adeiladu gan y Normaniaid. Cododd Llywelyn Gastell Dolforwyn ger Trefaldwyn. Ond roedd heriau newydd yn wynebu Llywelyn ar y gorwel yn Lloegr.\nPan ddaeth Edward I yn frenin yn 1274, roedd Llywelyn ap Gruffudd yn disgwyl iddo ei gydnabod ef yn Dywysog Cymru. Gwrthododd Edward ei gydnabod yn Dywysog Cymru nes i Lywelyn dalu gwrogaeth iddo. Er mwyn talu gwrogaeth, byddai angen i Lywelyn ddangos ei barch at y brenin yn gyhoeddus. Roedd Edward wedi rhoi lloches i frawd Llywelyn, Dafydd ap Gruffudd, ac i un o arglwyddi’r Cymry o\u0027r enw Gruffudd ap Gwenwynwyn. Bu\u0027n rhaid iddynt ffoi i Loegr rhag Llywelyn ar ôl iddynt gynllwynio i’w ladd. Yn ogystal, roedd Edward wedi carcharu dyweddi Llywelyn, Eleanor de Montfort. Gwrthododd Llywelyn dalu gwrogaeth nes byddai’r materion hyn wedi eu datrys. Gwrthododd Edward ddatrys y materion hyn nes byddai Llywelyn wedi talu gwrogaeth iddo. Nid oedd y naill na’r llall yn fodlon ildio. Golygai hyn bod rhyfel yn anochel rhwng y ddau.\r\n\r\n== Goresgyniad ==\nDaeth yr ymosodiadau cyntaf ym mis Ionawr 1277.  Cynllun Edward oedd ymosod ar Lywelyn o dri chyfeiriad: Caer yn y gogledd-ddwyrain, Trefaldwyn yn y canolbarth, a Chaerfyrddin yn y de.  Yn y gogledd, cafodd byddin Lloegr help gan Dafydd, brawd Llywelyn. Yn y de, dechreuwyd ymosod ar gestyll y Cymry yn nyffryn Tywi. Erbyn mis Ebrill, roedd Castell Dinefwr wedi ei gipio. Yna, newidiodd yr arweinydd lleol Rhys ap Maredudd ei ochr, ac ymuno â\u0027r Saeson. Cyn diwedd y rhyfel, byddai llawer o arweinwyr eraill y Cymry yn newid ochrau. Roedd Gruffudd ap Gwenwynwyn yn helpu byddin y Saeson yn y canolbarth. Ym mis Ebrill, fe wnaethon nhw ymosod ar Gastell Dolforwyn a’i gipio.\nErbyn mis Gorffennaf 1277, roedd gan Edward fyddin fawr yn barod i ymosod ar Wynedd. Yn y fyddin roedd 800 o farchogion a 15,600 o filwyr, 9,000 ohonynt yn Gymry. Wrth i Edward symud ymlaen ar draws y gogledd, adeiladodd gestyll newydd fel cestyll y Fflint a Rhuddlan. Anfonodd Edward 2,000 o filwyr i ymosod ar Ynys Môn. Bu hyn yn llwyddiant ac roedd Llywelyn wedi ei amgylchynu ar dair ochr: y gogledd-orllewin, y dwyrain a’r de. Ar 1 Tachwedd, ildiodd Llywelyn. Llofnodwyd Cytundeb Aberconwy, gan ostwng statws Llywelyn i Dywysog Gwynedd. Roedd gweddill Cymru o dan lywodraeth y Saeson erbyn hynny. Dros y pum mlynedd nesaf, cymerodd arweinyddion Cymru yn erbyn y swyddogion Seisnig a benodwyd i lywodraethu rhan fawr o Gymru.\r\n\r\n== Gwrthryfel y Cymry ==\nYm mis Mawrth 1282 arweiniodd Dafydd ap Gruffudd ymosodiadau ar gestyll yr oedd y Saeson yn eu dal ledled gogledd a chanolbarth Cymru. Bu’r ymosodiadau hyn yn llwyddiannus a chymerwyd rheolaeth ar sawl castell yn cynnwys Dolforwyn. Ymunodd tywysog gogledd Powys â Dafydd. O weld yr ymosodiadau hyn yn llwyddo, ymunodd Llywelyn ap Gruffudd yn y gwrthryfel. Erbyn mis Mehefin roedd y gwrthryfel wedi cyrraedd de Cymru. Ym mis Gorffennaf arweiniodd Edward fyddin o 600 o farchogion a 4,000 o filwyr i Gymru. Y tro hwn, nod Edward oedd gorchfygu Cymru gyfan. Erbyn mis Rhagfyr 1282 roedd rhan fawr o Gymru yn ôl o dan lywodraeth y Saeson. Penderfynodd Llywelyn ymosod ar Gastell Buallt a oedd yn nwylo’r Saeson.\r\n\r\n== Marwolaeth Llywelyn ==\n\nAr 11 Rhagfyr 1282, ymladdwyd Brwydr Pont Orewin .\nRoedd Llywelyn yn un o 3,000 o Gymry a laddwyd y diwrnod hwnnw. Does neb yn gwybod yn union sut y bu i Lywelyn farw. Yn ôl un stori, cafodd ei ladd gan farchog o’r enw Stephen de Frankton. Dywed y stori bod Llywelyn wedi ei wahanu oddi wrth ei fyddin. Gwelodd Stephen farchog o Gymro ar ei ben ei hunan a’i ladd â’i waywffon. Dim ond ar ôl i Stephen ei ladd y gwelwyd mai Llywelyn ydoedd. Yn ôl stori arall, cafodd Llywelyn ei ddenu i drap gan y Saeson cyn y frwydr. Ar ôl iddynt redeg ar ei ôl i goedwig, cafodd ei ladd ganddynt. Torrwyd pen Llywelyn a’i anfon i Dŵr Llundain i\u0027w arddangos uwchlaw\u0027r gatiau. Claddwyd ei gorff yn Abaty Cwm-hir.\r\n\r\n== Gorchfygu Cymru ==\nAr ôl i Llywelyn farw, symudodd Edward ymlaen ar draws y gogledd. Aeth Dafydd ap Gruffudd ar ffo. Ar 21 Mehefin 1283 daliwyd Dafydd ac fe’i dedfrydwyd i farwolaeth. Anfonwyd ei ben i Dŵr Llundain i gael ei arddangos wrth ymyl pen ei frawd. Gyda diwedd y gwrthryfel, roedd Cymru wedi ei gorchfygu’n llwyr am y tro cyntaf.  Roedd Oes y Tywysogion wedi dod i ben.\r\n\r\n== Edward yn dathlu ==\nYm mis Gorffennaf 1284 bu Edward I yn dathlu ei fuddugoliaeth yn Nefyn. Yno roedd un o Lysoedd pwysicaf Tywysogion Gwynedd. Rhwng diwedd Medi a chanol Rhagfyr bu Edward yn teithio Cymru. Taith i ddathlu ei fuddugoliaeth ac i ddangos ei fod wedi gorchfygu Cymru gyfan yn llwyr oedd hon. Yn 1301 cyhoeddwyd bod mab Edward, a anwyd yng Nghaernarfon, yn Dywysog newydd Cymru. Dyma oedd dechrau traddodiad newydd o roi’r teitl i fab hynaf y Brenin.\r\n\r\n== Statud Cymru ==\n\nCyhoeddwyd cyfraith o’r enw Statud Cymru yn Rhuddlan yn 1284. Roedd y gyfraith yn dweud y byddai Cymru\u0027n cael ei llywodraethu o dan Goron Lloegr. Gyda’r statud, cafodd cyfraith trosedd Cymru ei disodli gan gyfraith trosedd Lloegr. Disodlwyd tywysogion Cymru gan lywodraethwr brenhinol, Ustus Gogledd Cymru. Roedd Ustus ar gyfer De Cymru wedi ei gyflwyno yn 1280. Cyflwynwyd system newydd o siroedd ledled Cymru. Mewn rhannau o dde Cymru oedd yn cael eu rheoli gan y Saeson yn barod, bu siroedd yn eu lle ers 1241. Roedd rhai swyddi yn y llysoedd Cymreig fel y Rhingyll yn dal yn nwylo’r Cymry, ond roeddent yn gwasanaethu Coron Lloegr yn awr.\r\n\r\n== Etifeddiaeth ==\nHeddiw coffeir marwolaeth Llywelyn ar safle ei gwymp yng Nghilmeri gan wladgarwyr ar Ddiwrnod Llywelyn Ein Llyw Olaf bob blwyddyn. Er gwaethaf pwysau ar y Post Brenhinol yn 1982 i ryddhau stamp arbennig ar gyfer yr achlysur, ni chafwyd stamp i nodi 700 mlwyddiant ei farw, ond cyhoeddwyd stamp answyddogol.\nDyfernir Gwobr Goffa\u0027r Tywysog Llywelyn ap Gruffudd gan Brifysgol Cymru i\u0027r traethawd gorau ar gyfer gradd MPhil neu PhD.",
  "imageNames": [
    "Alexander_IIILlywelyn_ab_Gruffydd_with_Edward_I.jpg",
    "COA_Llywelyn_ap_Gruffudd.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": true,
  "start": 1223,
  "end": 1282,
  "categoryId": "arweinwyr",
  "id": "llywelyn-ein-llyw-olaf",
  "label": "Llywelyn Ein Llyw Olaf"
}