{
  "wikiSummary": "Casgliad o bedair chwedl yn seiliedig ar y traddodiad llafar Cymreig yw\u0027r Mabinogi. Eu henw traddodiadol yw Pedair Cainc y Mabinogi .\nOherwydd i\u0027r Arglwyddes Charlotte Guest gamddeall y gair Cymraeg Canol mabynogion , fe ddefnyddir y gair \u0027Mabinogion\u0027 ers iddi hi gyhoeddi ei chyfieithiad Saesneg dylanwadol o\u0027r Pedair Cainc ac wyth chwedl arall i gyfeirio at y chwedlau mytholegol Cymreig yn eu crynswth. Mae rhai o\u0027r chwedlau hynny\u0027n chwedlau llafar sy\u0027n cynnwys elfennau hanesyddol o\u0027r Oesoedd Canol yng Nghymru, ond ceir ynddynt hefyd elfennau cynharach o lawer sy\u0027n deillio yn y pen draw o fyd y Celtiaid a\u0027u mytholeg.\nCedwir testunau pwysicaf y chwedlau mewn dwy lawysgrif ganoloesol arbennig, sef Llyfr Gwyn Rhydderch a ysgrifennwyd rywbryd oddeutu 1350, a Llyfr Coch Hergest a ysgrifennwyd rywbryd rhwng tua 1382 a 1410.",
  "wikiArticle": "Casgliad o bedair chwedl yn seiliedig ar y traddodiad llafar Cymreig yw\u0027r Mabinogi. Eu henw traddodiadol yw Pedair Cainc y Mabinogi .\nOherwydd i\u0027r Arglwyddes Charlotte Guest gamddeall y gair Cymraeg Canol mabynogion , fe ddefnyddir y gair \u0027Mabinogion\u0027 ers iddi hi gyhoeddi ei chyfieithiad Saesneg dylanwadol o\u0027r Pedair Cainc ac wyth chwedl arall i gyfeirio at y chwedlau mytholegol Cymreig yn eu crynswth. Mae rhai o\u0027r chwedlau hynny\u0027n chwedlau llafar sy\u0027n cynnwys elfennau hanesyddol o\u0027r Oesoedd Canol yng Nghymru, ond ceir ynddynt hefyd elfennau cynharach o lawer sy\u0027n deillio yn y pen draw o fyd y Celtiaid a\u0027u mytholeg.\nCedwir testunau pwysicaf y chwedlau mewn dwy lawysgrif ganoloesol arbennig, sef Llyfr Gwyn Rhydderch a ysgrifennwyd rywbryd oddeutu 1350, a Llyfr Coch Hergest a ysgrifennwyd rywbryd rhwng tua 1382 a 1410.\r\n\r\n== Y Pedair Cainc ==\n\nCasgliad o bedair chwedl sy\u0027n perthyn i\u0027r un cylch yw Pedair Cainc y Mabinogi. Y pedair chwedl yw:\n\nPwyll Pendefig Dyfed\nBranwen ferch Llŷr\nManawydan fab Llŷr\nMath fab Mathonwy\nCawsant eu llunio gan lenor dawnus, tua chanol yr 11g o bosibl. Y llinyn sy\u0027n eu cydio wrth ei gilydd, er yn denau braidd mewn mannau, yw hanes Pryderi, mab Pwyll Pendefig Dyfed a Rhiannon.\r\n\r\n== Y Chwedlau Brodorol ==\n\nCyfieithodd a chyhoeddodd yr Arglwyddes Guest saith chwedl arall yn ei chasgliad. Mae pedair ohonynt yn chwedlau sy\u0027n cynnwys deunydd o chwedloniaeth a thraddodiadau Cymreig, ac am y rheswm hynny yn cael eu galw yn Y Chwedlau Brodorol gan ysgolheigion. Eu teitlau yw:\n\nBreuddwyd Macsen Wledig\nCyfranc Lludd a Llefelys\nCulhwch ac Olwen\nBreuddwyd Rhonabwy\nGan fod traddodiadau cynnar am y brenin Arthur i\u0027w cael yn Culhwch ac Olwen a Breuddwyd Rhonabwy, mae\u0027r storïau hyn o ddiddordeb arbennig i ysgolheigion Arthuraidd. Culhwch ac Olwen yw\u0027r chwedl Cymraeg Canol gynharaf ar glawr tra bod Breuddwyd Rhonabwy yn chwedl fwrlesg o ddiwedd yr Oesoedd Canol sy\u0027n fath o barodi o\u0027r chwedlau cynharach.\nMae Breuddwyd Macsen Wledig yn adrodd hanes yr Ymerawdwr Rhufeinig Magnus Maximus ac yn ei gysylltu â Segontiwm, y gaer Rufeinig ger Caernarfon. Mae dylanwad Historia Regum Britanniae Sieffre o Fynwy i\u0027w gweld yn amlwg yn Cyfranc Lludd a Llefelys.\r\n\r\n== Y Tair Rhamant ==\n\nMae\u0027r tair stori a adnabyddir wrth yr enw Y Tair Rhamant yn chwedlau Arthuraidd sydd i\u0027w cael yn rhannol yng ngwaith yr awdwr Ffrangeg Chrétien de Troyes yn ogystal. Erbyn hyn cred ysgolheigion fod y ddau gylch o chwedlau yn annibynnol ar ei gilydd ond bod elfennau ynddynt yn seiliedig ar waith hŷn. Y Tair Rhamant yw:\n\nIarlles y Fynnon Peredur fab Efrawg\nGeraint ac Enid\nMae\u0027r Tair Rhamant yn perthyn i fyd sifalri a\u0027i defodau ac mae lleoliad yr anturiaethau niferus yn amwys fel rheol, mewn cyferbyniaeth â daearyddiaeth y Pedair Cainc.\r\n\r\n== Hanes Taliesin ==\n\nYn ogystal â\u0027r chwedlau hyn mae\u0027r Arglwyddes Guest yn cynnwys wythfed chwedl nad yw yn y Llyfr Gwyn na\u0027r Llyfr Coch . Hanes geni a mabolaeth y Taliesin chwedlonol yw\u0027r chwedl, a adwaenir fel,\n\nHanes Taliesin Ceir nifer o gerddi sy\u0027n gysylltiedig â\u0027r chwedl, gyda rhai ohonynt i\u0027w cael yn y testun ei hun.\r\n\r\n== Addasiadau ==\r\n\r\n== Ffilm ==\nGwnaed y ffilm animeiddiedig Y Mabinogi yn 2002.",
  "imageNames": [
    "Ceridwen.jpg",
    "George_Sheringham_-_The_Panel_of_the_Mabinogi_-_ref_10525.jpg",
    "Harlech_Statue_The_Two_Kings.jpg",
    "Hope-coventina01a.jpg",
    "Jesus-College-MS-111_00349_175r_cropped_and_lightened.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1350,
  "end": 1410,
  "categoryId": "diwylliant",
  "id": "mabinogi",
  "label": "Mabinogi"
}