{
  "wikiSummary": "Rheolwr yr Ymerodraeth Rufeinig Orllewinol oedd Macsen Wledig , o gwymp yr Ymerodraeth yn 383 tan ei farwolaeth yn 388.\nCelt-Iberiad oedd Macsen Wledig a ddaeth i ynysoedd Prydain yn y 360au. Cafodd ei orseddu yn Ymerawdwr gan ei fyddin tra roedd ef a hwy yn gwasanaethu ar yr ynysoedd. Gorchfygodd ei brif elyn Gratianus ger Paris ond ar ôl hynny fe\u0027i lladdwyd ganddo mewn brwydr yn Lyons ar 25 Awst 383. Cododd Macsen Wledig brifddinas yn Augusta Treverorum ac roedd yn Gristion.\nCafodd Macsen Wledig ei ddal a\u0027i ladd gan ei gyn-noddwr Theodosius I yn Aquileia ger Trieste yn nhalaith Illyria ar 28 Gorffennaf 388.",
  "wikiArticle": "Rheolwr yr Ymerodraeth Rufeinig Orllewinol oedd Macsen Wledig , o gwymp yr Ymerodraeth yn 383 tan ei farwolaeth yn 388.\nCelt-Iberiad oedd Macsen Wledig a ddaeth i ynysoedd Prydain yn y 360au. Cafodd ei orseddu yn Ymerawdwr gan ei fyddin tra roedd ef a hwy yn gwasanaethu ar yr ynysoedd. Gorchfygodd ei brif elyn Gratianus ger Paris ond ar ôl hynny fe\u0027i lladdwyd ganddo mewn brwydr yn Lyons ar 25 Awst 383. Cododd Macsen Wledig brifddinas yn Augusta Treverorum ac roedd yn Gristion.\nCafodd Macsen Wledig ei ddal a\u0027i ladd gan ei gyn-noddwr Theodosius I yn Aquileia ger Trieste yn nhalaith Illyria ar 28 Gorffennaf 388.\r\n\r\n== Traddodiadau Cymreig ==\n\nYn ôl y chwedl Gymreig ganoloesol Breuddwyd Macsen Wledig, priododd Macsen Elen Luyddog, merch Eudaf o ardal Segontium, y gaer Rufeinig ger Caernarfon, ac mae peth tystiolaeth bod y stori\u0027n wir. Yn yr achau Cymreig nodir Sant Peblig ac Owain fab Macsen Wledig yn feibion i Macsen ac Elen.\nYn ôl y traddodiad Cymreig, Macsen oedd yn gyfrifol am ymadawiad lluoedd Rhufain o Gymru 20 mlynedd cyn gweddill Prydain. Gadawodd Macsen diroedd Cymru yn nwylo’r bobl frodorol, gan gyflwyno trefn o hunanlywodraeth a barodd tua naw cant o flynyddoedd. Am y rheswm hwnnw, mae Macsen wedi ei ystyried yn ’Dad y Genedl Gymreig’.\nDywed Gwynfor Evans mai\u0027r Cymry yn unig o holl bobloedd yr Ymerodraeth wrthsafodd y Germaniaid yn llwyddiannus yn dilyn cwymp yr Ymerodraeth Rufeinig, a bu’r drefn a gyflwynodd Macsen yn un o\u0027r rhesymau pennaf dros hynny.\nMae gan Dafydd Iwan gân enwog sy\u0027n cyfeirio at Macsen, sef \u0022Yma o Hyd\u0022.",
  "imageNames": [
    "Llanbeblig_Hours_f._3r._A_king_possibly_Magnus_Maximus_holding_a_sceptre.jpg",
    "Pillar_of_Eliseg_watercolour.jpg",
    "Rare_aureus_of_Magnus_Maximus_obverse_transparent.png"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 335,
  "end": 388,
  "categoryId": "milwrol",
  "id": "macsen-wledig",
  "label": "Macsen Wledig"
}