{
  "wikiSummary": "Roedd Martin Luther King yr ieuengaf yn weinidog ac actifydd Cristnogol o\u0027r Unol Daleithiau a ddaeth yn llefarydd ac arweinydd mwyaf gweladwy\u0027r Mudiad Hawliau Sifil o 1955 hyd at ei lofruddiaeth ym 1968. Mae King yn fwyaf adnabyddus am hyrwyddo hawliau sifil drwy ddulliau di-drais ac anufudd-dod sifil oedd wedi eu hysbrydoli gan ei gredoau Cristnogol a phrotestiadau di-drais Mahatma Gandhi.\nArweiniodd King foicot bysiau Montgomery yn 1955 ac yn ddiweddarach daeth yn llywydd cyntaf Cynhadledd Arweinyddiaeth Gristnogol y De . Fel llywydd y Gynhadledd, arweiniodd frwydr aflwyddiannus yn 1962 yn erbyn arwahanu yn Albany, Georgia, a helpodd i drefnu protestiadau di-drais 1963 yn Birmingham, Alabama. Bu hefyd yn cynorthwyo â threfniadau’r Orymdaith i Washington, ym mis Mawrth 1963, lle traddododd ei araith enwog Mae gen i freuddwyd ar risiau Cofeb Lincoln.\nAr 14 Hydref 1964, enillodd King Wobr Heddwch Nobel am frwydro yn erbyn anghydraddoldeb hiliol drwy wrthwynebiad di-drais. Ym 1965, helpodd i drefnu\u0027r gorymdeithiau o Selma i Montgomery. Yn ei flynyddoedd olaf, ehangodd ei ffocws i gynnwys gwrthwynebiad i dlodi, cyfalafiaeth, a Rhyfel Fietnam. Gwelwyd ef gan Gyfarwyddwr yr FBI, J. Edgar Hoover, yn unigolyn radical, a bu King yn destun trafod rhaglen gwrthgynhadledd yr FBI o 1963 ymlaen. Roedd King yn destun ymchwiliadau cyson i ysbïwyr yr FBI oherwydd ei gysylltiadau comiwnyddol honedig, a chofnodwyd ei berthnasau tu allan i\u0027w briodas ac adroddwyd arnynt i swyddogion y llywodraeth. Ym 1964, derbyniodd King lythyr anhysbys bygythiol, a ddehonglwyd ganddo fel ymgais i wneud iddo gyflawni hunanladdiad.\nPan gafodd ei lofruddio ar 4 Ebrill 1968, ym Memphis, Tennessee, roedd King yn trefnu ac yn cynllunio ‘meddiant cenedlaethol’ o Washington, D.C., a fyddai’n cael ei alw’n Ymgyrch y Bobl Dlawd. Yn dilyn ei farwolaeth, bu terfysgoedd yn llawer o ddinasoedd yr Unol Daleithiau. Parhaodd honiadau am ddegawdau ar ôl y saethu bod James Earl Ray, y dyn a gafwyd yn euog o ladd King, wedi cael ei fframio neu ei fod wedi gweithredu ar y cyd ag asiantaethau’r llywodraeth.\nWedi ei farwolaeth dyfarnwyd y Fedal Rhyddid Arlywyddol a’r Fedal Aur Gyngresol i King. Sefydlwyd Diwrnod Martin Luther King Jr. fel dydd gŵyl mewn dinasoedd a gwladwriaethau ledled yr Unol Daleithiau, gan ddechrau ym 1971; deddfwyd y gwyliau ar lefel ffederal gan ddeddfwriaeth a lofnodwyd gan yr Arlywydd Ronald Reagan ym 1986. Mae cannoedd o strydoedd yn yr Unol Daleithiau wedi cael eu hailenwi er anrhydedd iddo, ynghyd â sir yn Washington. Cysegrwyd Cofeb Martin Luther King Jr ar y Rhodfa Genedlaethol yn Washington D.C yn 2011.",
  "wikiArticle": "Roedd Martin Luther King yr ieuengaf yn weinidog ac actifydd Cristnogol o\u0027r Unol Daleithiau a ddaeth yn llefarydd ac arweinydd mwyaf gweladwy\u0027r Mudiad Hawliau Sifil o 1955 hyd at ei lofruddiaeth ym 1968. Mae King yn fwyaf adnabyddus am hyrwyddo hawliau sifil drwy ddulliau di-drais ac anufudd-dod sifil oedd wedi eu hysbrydoli gan ei gredoau Cristnogol a phrotestiadau di-drais Mahatma Gandhi.\nArweiniodd King foicot bysiau Montgomery yn 1955 ac yn ddiweddarach daeth yn llywydd cyntaf Cynhadledd Arweinyddiaeth Gristnogol y De . Fel llywydd y Gynhadledd, arweiniodd frwydr aflwyddiannus yn 1962 yn erbyn arwahanu yn Albany, Georgia, a helpodd i drefnu protestiadau di-drais 1963 yn Birmingham, Alabama. Bu hefyd yn cynorthwyo â threfniadau’r Orymdaith i Washington, ym mis Mawrth 1963, lle traddododd ei araith enwog Mae gen i freuddwyd ar risiau Cofeb Lincoln.\nAr 14 Hydref 1964, enillodd King Wobr Heddwch Nobel am frwydro yn erbyn anghydraddoldeb hiliol drwy wrthwynebiad di-drais. Ym 1965, helpodd i drefnu\u0027r gorymdeithiau o Selma i Montgomery. Yn ei flynyddoedd olaf, ehangodd ei ffocws i gynnwys gwrthwynebiad i dlodi, cyfalafiaeth, a Rhyfel Fietnam. Gwelwyd ef gan Gyfarwyddwr yr FBI, J. Edgar Hoover, yn unigolyn radical, a bu King yn destun trafod rhaglen gwrthgynhadledd yr FBI o 1963 ymlaen. Roedd King yn destun ymchwiliadau cyson i ysbïwyr yr FBI oherwydd ei gysylltiadau comiwnyddol honedig, a chofnodwyd ei berthnasau tu allan i\u0027w briodas ac adroddwyd arnynt i swyddogion y llywodraeth. Ym 1964, derbyniodd King lythyr anhysbys bygythiol, a ddehonglwyd ganddo fel ymgais i wneud iddo gyflawni hunanladdiad.\nPan gafodd ei lofruddio ar 4 Ebrill 1968, ym Memphis, Tennessee, roedd King yn trefnu ac yn cynllunio ‘meddiant cenedlaethol’ o Washington, D.C., a fyddai’n cael ei alw’n Ymgyrch y Bobl Dlawd. Yn dilyn ei farwolaeth, bu terfysgoedd yn llawer o ddinasoedd yr Unol Daleithiau. Parhaodd honiadau am ddegawdau ar ôl y saethu bod James Earl Ray, y dyn a gafwyd yn euog o ladd King, wedi cael ei fframio neu ei fod wedi gweithredu ar y cyd ag asiantaethau’r llywodraeth.\nWedi ei farwolaeth dyfarnwyd y Fedal Rhyddid Arlywyddol a’r Fedal Aur Gyngresol i King. Sefydlwyd Diwrnod Martin Luther King Jr. fel dydd gŵyl mewn dinasoedd a gwladwriaethau ledled yr Unol Daleithiau, gan ddechrau ym 1971; deddfwyd y gwyliau ar lefel ffederal gan ddeddfwriaeth a lofnodwyd gan yr Arlywydd Ronald Reagan ym 1986. Mae cannoedd o strydoedd yn yr Unol Daleithiau wedi cael eu hailenwi er anrhydedd iddo, ynghyd â sir yn Washington. Cysegrwyd Cofeb Martin Luther King Jr ar y Rhodfa Genedlaethol yn Washington D.C yn 2011.\r\n\r\n== Bywyd cynnar ac addysg ==\n\nGanwyd King yn Michael King Jr. ar 15 Ionawr 1929, yn Atlanta, Georgia, yr ail o dri o blant i\u0027r Parchedig Michael King Sr. ac Alberta King . Ym 1934 aeth tad King ar daith o amgylch y byd gyda Chynghrair Bedyddwyr y Byd, gan gynnwys taith i Berlin lle daeth dan ddylanwad dysgeidiaeth arweinydd y Diwygiad Protestannaidd, Martin Luther. Dychwelodd adref ym mis Awst 1934, ac yn yr un flwyddyn dechreuodd gyfeirio ato\u0027i hun fel Martin Luther King Sr., a\u0027i fab fel Martin Luther King Jr. Newidiwyd tystysgrif geni King i ddarllen \u0022Martin Luther King Jr.\u0022 ar 23 Gorffennaf, 1957, pan oedd yn 28 oed.\nYng nghartref ei blentyndod, byddai King, a’i frawd a’i chwaer, yn darllen y Beibl yn uchel yn unol â chyfarwyddyd eu tad. Gwelodd King fod ei dad yn sefyll yn erbyn arwahanu a gwahanol fathau o wahaniaethu. Unwaith, pan gafodd ei stopio gan heddwas a gyfeiriodd at King Sr. fel \u0022boy\u0022, ymatebodd ei dad yn sydyn drwy ddweud bod King Jnr yn fachgen ond ei fod ef yn ddyn. Pan aeth tad King ag ef i mewn i siop esgidiau yn Atlanta, dywedodd y clerc wrthynt fod angen iddynt eistedd yn y cefn. Gwrthododd tad King, gan nodi \u0022byddwn naill ai\u0027n prynu esgidiau yn eistedd yma neu ni fyddwn yn prynu esgidiau o gwbl\u0022, cyn mynd â\u0027i fab gydag ef a gadael y siop.\nYn ystod ei ieuenctid, teimlai King ddrwgdeimlad yn erbyn pobl wyn oherwydd y \u0022cywilydd hiliol\u0022 yr oedd yn rhaid iddo ef, ei deulu, a\u0027i gymdogion ei ddioddef yn aml yn y De lle\u0027r oedd arwahanu yn digwydd. Yn 1942, pan oedd King yn 13 mlwydd oed, daeth yn rheolwr cynorthwyol ieuengaf gorsaf ddosbarthu papur newydd yr Atlanta Journal. Y flwyddyn honno, hepgorwyd King rhag cwblhau’r nawfed radd a chofrestrwyd ef yn Ysgol Uwchradd Booker T. Washington. Yr ysgol uwchradd hon oedd yr unig un yn y ddinas ar gyfer myfyrwyr Americanaidd Affricanaidd. Fe’i ffurfiwyd ar ôl i arweinwyr du lleol, gan gynnwys taid King ar ochr ei fam, , annog llywodraeth dinas Atlanta i’w sefydlu. Daeth King yn adnabyddus am ei allu i siarad yn gyhoeddus ac roedd yn rhan o dîm dadlau\u0027r ysgol.\nPan oedd King yn yr ysgol uwchradd, cyhoeddodd Coleg Morehouse - coleg du uchel ei barch yn hanesyddol - y byddai\u0027n derbyn unrhyw blentyn ysgol uwchradd a allai basio ei arholiadau mynediad. Bryd hynny, roedd llawer o fyfyrwyr wedi cefnu ar astudiaethau pellach i ymrestru yn yr Ail Ryfel Byd. Oherwydd hyn, roedd Morehouse yn awyddus i lenwi ei ystafelloedd dosbarth. Yn 15 oed, pasiodd King yr arholiad a mynd i Morehouse. Chwaraeodd bêl-droed glasfyfyrwyr yno. Yr haf cyn ei flwyddyn olaf yn Morehouse, ym 1947, dewisodd King, a oedd yn 18 oed ar y pryd, fynd i\u0027r weinidogaeth. Drwy gydol ei gyfnod yn y coleg, astudiodd King o dan arolygiaeth llywydd y Coleg, sef gweinidog gyda’r Bedyddwyr, Benjamin Mays. Yn ddiweddarach, rhoddodd King deyrnged iddo am fod yn “fentor ysbrydol iddo.” Graddiodd King o Morehouse gyda gradd Baglor yn y Celfyddydau mewn Cymdeithaseg ym 1948 pan oedd yn bedair ar bymtheg oed.\nCofrestrodd King yng Ngholeg Diwinyddol Crozer yn Upland, Pennsylvania, ac ym 1951 dechreuodd astudiaethau doethuriaeth mewn diwinyddiaeth systematig ym Mhrifysgol Boston. Tra’n dilyn astudiaethau doethuriaeth, bu King yn gweithio fel gweinidog cynorthwyol yn Neuddegfed Eglwys y Bedyddwyr, sef eglwys hanesyddol Boston, gyda\u0027r Parchedig William Hunter Hester. Roedd Hester yn hen ffrind i dad Martin Luther King, a bu’n ddylanwad pwysig arno.\nPriododd King â Coretta Scott ar Fehefin 18, 1953, ar lawnt tŷ ei rhieni yn ei thref enedigol yn Heiberger, Alabama. Daethant yn rhieni i bedwar o blant: Yolanda King , Martin Luther King III , Dexter Scott King , a Bernice King . Yn ystod eu priodas, cyfyngodd King rôl Coretta yn y mudiad hawliau sifil, gan ddisgwyl iddi fod yn wraig tŷ ac yn fam.\r\n\r\n== Protestio ac ymgyrchu ==\n\n\n=== Boicot y Bysus, Montgomery, 1955 ===\nYm mis Mawrth 1955, gwrthododd Claudette Colvin - merch ysgol ddu bymtheg oed yn Montgomery - ildio ei sedd fws i ddyn gwyn. Roedd gweithred felly yn groes i gyfreithiau Jim Crow, deddfau cyffredin yn nhaleithiau deheuol America a oedd yn gorfodi arwahanu hiliol. Roedd King ar bwyllgor Affricanaidd-Americanaidd cymuned Birmingham a fu’n ymchwilio i\u0027r achos. Penderfynodd E. D. Nixon a Clifford Durr aros am achos gwell i fynd ar ei drywydd oherwydd bod y digwyddiad yn cynnwys plentyn dan oed.\nNaw mis yn ddiweddarach ar 1 Rhagfyr, 1955, bu digwyddiad tebyg pan arestiwyd Rosa Parks am wrthod ildio ei sedd ar fws dinas. Arweiniodd y ddau ddigwyddiad at foicot bysus Montgomery, a gafodd ei annog a\u0027i gynllunio gan Nixon a\u0027i arwain gan King. Parhaodd y boicot am 385 diwrnod, a throdd y sefyllfa mor ddwys fel bod tŷ King wedi cael ei fomio. Arestiwyd King yn ystod yr ymgyrch, a ddaeth i ben yn y diwedd gyda dyfarniad Llys Dosbarth yr Unol Daleithiau yn Browder v. Gayle. Penderfyniad y dyfarniad oedd dod â gwahanu hiliol i ben ar holl fysus cyhoeddus Montgomery. Yn sgil Boicot y Bysus trawsnewidiwyd rôl King i fod yn ffigwr cenedlaethol ac yn llefarydd mwyaf adnabyddus y Mudiad Hawliau Sifil.\n\n\n=== SCLC ===\nYm 1957, sefydlodd King, Ralph Abernathy, Fred Shuttlesworth, Joseph Lowery, ac actifyddion hawliau sifil eraill Gynhadledd Arweinyddiaeth Gristnogol y De . Cafodd y grŵp ei greu er mwyn harneisio awdurdod moesol a grym trefnu\u0027r eglwysi duon er mwyn cynnal protestiadau di-drais fyddai’n hyrwyddo ymgyrchoedd a diwygiadau hawliau sifil. Ysbrydolwyd y grŵp gan yr efengylwr Billy Graham, a oedd yn gyfaill i King, yn ogystal â threfniant cenedlaethol y grŵp, In Friendship, oedd wedi cael ei sefydlu gan Stanley Levison ac Ella Baker, rhai o gefnogwyr King. Arweiniodd King y SCLC hyd at ei farwolaeth. Achlysur ‘Pererindod Gweddi dros Ryddid’ yr SCLC yn 1957 oedd y tro cyntaf i King annerch cynulleidfa genedlaethol.\n\n\n=== Yr Orymdaith i Washington, 1963 ===\nRoedd King, a oedd yn cynrychioli\u0027r SCLC, ymhlith arweinwyr sefydliadau hawliau sifil y \u0022Big Six\u0022, a oedd yn allweddol yn nhrefniadaeth yr ‘Orymdaith i Washington ar gyfer Swyddi a Rhyddid’, a gynhaliwyd ar 28 Awst 1963. Ymateb cychwynnol yr Arlywydd Kennedy i\u0027r orymdaith oedd ei wrthwynebu’n llwyr, oherwydd ei fod yn pryderu y byddai\u0027n cael effaith negyddol ar yr ymgyrch i basio deddfwriaeth hawliau sifil. Fodd bynnag, roedd y trefnwyr yn bendant y byddai\u0027r orymdaith yn mynd yn ei blaen. Ar sail hynny, penderfynodd y Kennedys ei bod yn bwysig gweithio i sicrhau ei lwyddiant. Roedd yr Arlywydd Kennedy yn pryderu y byddai\u0027r nifer a fyddai’n mynychu’r orymdaith yn llai na 100,000. Felly, aethpwyd ati i ddenu cymorth ychwanegol oddi wrth arweinyddion eglwysig eraill. Cafwyd cymorth hefyd oddi wrth Walter Reuther, Arlywydd Gweithwyr Moduron Unedig, wrth ymfyddino cefnogwyr ar gyfer yr achos.\nRoedd gan yr orymdaith ofynion penodol:\n\nDiwedd ar wahanu hiliol mewn ysgolion cyhoeddus\nDeddfwriaeth hawliau sifil ystyrlon, gan gynnwys deddf oedd yn gwahardd gwahaniaethu ar sail hil mewn cyflogaeth\nAmddiffyn gweithwyr hawliau sifil rhag creulondeb yr heddlu\nIsafswm cyflog o $2 i holl weithwyr UDA Hunanlywodraeth i Washington, D.C., oedd yn cael ei lywodraethu gan bwyllgor cyngresol ar y pryd.\nEr gwaethaf y tensiynau, roedd yr orymdaith yn llwyddiant ysgubol. Daeth mwy na chwarter miliwn o bobl o ethnigrwydd amrywiol i\u0027r digwyddiad, gyda’r gynulleidfa yn ymledu o risiau Cofeb Lincoln i\u0027r Rhodfa Genedlaethol ac o amgylch y Pwll Adlewyrchu. Ar y pryd, hwn oedd y cyfarfod mwyaf o brotestwyr yn hanes Washington D.C.\nSiaradodd King â\u0027r dorf o risiau Cofeb Lincoln yn ystod yr Orymdaith i Washington. Hon oedd araith enwog King oedd yn cynnwys y geiriau \u0022I have a dream\u0022. Yn yr araith roedd King mynnu cydraddoldeb hiliol a diwedd ar wahaniaethu yn yr Unol Daleithiau. Roedd dros 200,000 o gefnogwyr hawliau sifil yn y gynulleidfa.\nMae\u0027r araith yn cyfeirio at Gyfansoddiad yr Unol Daleithiau: \u0022Mae gen i freuddwyd y gwelaf y genedl hon yn codi ryw ddydd i fyw yr hyn a ddywed un o erthyglau ei chyfansoddiad: \u0027Daliwn fod y gwirionedd hwn yn eglur, fod pob dyn yn gydradd\u0027.\u0022\nYn ogystal, mewn darn adnabyddus o\u0027r araith mae King yn cyfeirio at ei blant: \u0022Mae gen i freuddwyd y bydd fy mhedwar plentyn yn medru byw, ryw ddydd, fel rhan o genedl lle bydd cymeriad yn bwysicach na lliw croen.\u0022.\n\n\n=== Gwrthwynebiad i Ryfel Fietnam ===\n\nRoedd King wedi gwrthwynebu rôl America yn Rhyfel Fietnam ers peth amser, ond ar y dechrau roedd wedi ceisio osgoi\u0027r pwnc mewn areithiau cyhoeddus. Gwnaeth hyn er mwyn osgoi gwrthdaro â nodau hawliau sifil y gallai beirniadaeth o bolisïau\u0027r Arlywydd Johnson fod wedi eu creu. Ar anogaeth cyn-Gyfarwyddwr Gweithredu Uniongyrchol SCLC, a oedd bellach yn bennaeth Pwyllgor Symudiad y Gwanwyn i Ddiweddu’r Rhyfel yn Fietnam, sef James Bevel, ac wedi ei ysbrydoli gan barodrwydd Muhammad Ali i fynegi ei farn ar y mater, penderfynodd King yn y pen draw bod angen iddo ddatgan ei wrthwynebiad i’r rhyfel yn gyhoeddus. Digwyddodd hyn ar yr adeg roedd gwrthwynebiad tuag at y rhyfel yn cynyddu ymhlith y cyhoedd yn America.\n\n\n=== Ymgyrch y Bobl Dlawd, 1968 ===\nYm 1968, trefnodd King a\u0027r SCLC \u0022Ymgyrch y Bobl Dlawd\u0022 i fynd i\u0027r afael â materion cyfiawnder economaidd. Teithiodd King ar hyd y wlad i gasglu ynghyd \u0022byddin aml-grefyddol y tlawd\u0022 a fyddai\u0027n gorymdeithio i Washington i gymryd rhan mewn anufudd-dod sifil di-drais, ger Adeilad y Capitol nes byddai’r Gyngres yn creu \u0022bil hawliau economaidd\u0022 i Americanwyr tlawd.\nRhagflaenwyd yr ymgyrch gan lyfr olaf King, ‘Where Do We Go from Here: Chaos or Community?’, lle amlinellodd ei farn ar sut i fynd i\u0027r afael â materion cymdeithasol a thlodi. Dyfynnodd King lyfr Henry George a George, ‘Progress and Poverty’, yn enwedig wrth gefnogi’r ddadl dros warantu incwm sylfaenol. Penllanw\u0027r ymgyrch oedd yr Orymdaith i Washington D.C., lle mynnwyd bod angen cymorth economaidd ar gymunedau tlotaf yr Unol Daleithiau.\nGweledigaeth King oedd creu newid a oedd yn fwy chwyldroadol na diwygio yn unig: cyfeiriodd at ddiffygion systematig o \u0022hiliaeth, tlodi, militariaeth a materoliaeth\u0022, a dadleuodd mai \u0022ailadeiladu cymdeithas ei hun yw\u0027r gwir fater i\u0027w wynebu.\u0022\nRoedd Ymgyrch y Bobl Dlawd yn ddadleuol hyd yn oed o fewn y Mudiad Hawliau Sifil. Ymddiswyddodd Rustin o’r orymdaith, gan nodi bod nodau’r ymgyrch yn rhy eang, bod ei gofynion yn afrealistig, a’i fod yn credu y byddai’r ymgyrchoedd hyn yn cyflymu’r adwaith a’r gormes ar y tlawd a phobl dduon.\r\n\r\n== Llofruddiaeth a’r canlyniadau ==\nAr 29 Mawrth 1968, aeth King i Memphis, Tennessee, i gefnogi gweithwyr du oedd yn glanhau gweithfeydd cyhoeddus iechydol. Cynrychiolwyd hwy gan AFSCME Local 1733. Roedd y gweithwyr wedi bod ar streic ers 12 Mawrth am gyflogau uwch a thriniaeth well. Mewn un digwyddiad, derbyniodd atgyweirwyr stryd du eu croen dâl am ddwy awr pan gawsant eu hanfon adref oherwydd tywydd gwael, ond talwyd gweithwyr gwyn am y diwrnod llawn.\nAr Ebrill 3, anerchodd King rali a thraddododd ei anerchiad Rwyf wedi bod i ben y mynydd yn Nheml Mason, pencadlys byd-eang Eglwys Duw yng Nghrist.\nSaethwyd King yn angheuol gan James Earl Ray am 6:01 yr hwyr ar 4 Ebrill 1968, wrth iddo sefyll ar falconi ail lawr ei westy. Arweiniodd y llofruddiaeth at don o derfysgoedd hil yn Washington D.C., Chicago, Baltimore, Louisville, Kansas City, a dwsinau o ddinasoedd eraill. Roedd ymgeisydd arlywyddol y Democratiaid, sef Robert F. Kennedy, ar ei ffordd i Indianapolis ar y pryd ar gyfer rali ymgyrchu pan gafodd wybod am farwolaeth King. Traddododd araith fer, fyrfyfyr i gynulleidfa o gefnogwyr a rhoi gwybod iddynt am y drasiedi a\u0027u hannog i barhau â delfrydau King, sef protestio di-drais. Y diwrnod canlynol, siaradodd yn Cleveland. Galwodd James Farmer Jr, ac arweinwyr hawliau sifil eraill hefyd, am weithredu di-drais, tra bod Stokely Carmichael, oedd yn ffigwr mwy milwriaethus, wedi galw am ymateb mwy grymus.",
  "imageNames": [
    "Today_capitalism_has_outlived_its_usefulness_MLK.jpg",
    "BayardRustinAug1963-LibraryOfCongress_crop.jpg",
    "Booker_T._Washington_High_School_in_Atlanta.jpg",
    "ChristianitySymbolWhite.PNG",
    "Civil_Rights_March_on_Washington_D.C._Dr._Martin_Luther_King_Jr._and_Mathew_Ahmann_in_a_crowd._-_NARA_-_542015_-_Restoration.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1963,
  "categoryId": "pwynt-cyfeirio",
  "id": "martin-luther-king-jr",
  "label": "Martin Luther King Jr."
}