{
  "wikiSummary": "Gwrthryfel gwerinol yn erbyn y tollau drud a godwyd am deithio ar hyd y ffyrdd tyrpeg oedd Helyntion Beca , a barodd o 1839 hyd 1844.\nTrawodd Beca gyntaf yn Efail-wen ar yr 13 Mai 1839, gan falu\u0027r dollborth yno. Fe wnaethpwyd yr un peth eto ar y 6 Mehefin yn yr un flwyddyn ac eto ar yr 17 Gorffennaf. Llosgwyd y tolldy y tro hwn. Ni ddarganfuwyd pwy oedd y troeseddwyr, gan fod y rhai a gymerodd ran yn y weithred wedi duo eu gwynebau a gwisgo dillad menywod. Gwelwyd dryllio dros gant o dollbyrth rhwng Ionawr 1843 a gwanwyn 1844 ledled de-orllewin Cymru. Roedd yr helynt ar ei waethaf yn Sir Gaerfyrddin. Ar 6 Gorffennaf 1843, ymosododd oddeutu 200 o bobl ar Dollborth Bolgoed, Pontarddulais. Yr arweinydd oedd crydd lleol o\u0027r enw Daniel Lewis. Fe\u0027i bradychwyd, yn ôl yr hanes, ond osgôdd gael ei ddanfon i Awstralia gan nad oedd tystion ar gael. Ceir cofeb i\u0027r digwyddiad yn y lleoliad hwn - ger Tafarn y Ffynnon heddiw.\n\u0027Merched Rebecca\u0027 neu \u0027Ferched Beca\u0027 oedd yr enw arnyn nhw ar lafar. Dywed rhai iddynt gael eu henwi ar ôl benyw o\u0027r enw Rebecca, neu Beca Fawr, a oedd wedi benthyg ei dillad iddyn nhw. Y farn gyffredinol, fodd bynnag, yw fod yr enw Rebecca yn gyfeiriad at adnod yn Llyfr Genesis, Pennod 24, adnod 60, lle sonir am fam a brawd Rebecca yn gadael iddi fynd gydag Eliezer, gwas Abraham, i briodi Isaac:\n\nAc a fendithiasant Rebbecah, ac a ddywedasant wrthi, \u0022Ein chwaer wyt, bydd di fil fyrddiwn; ac etifedded dy had borth ei gaseion.\u0022\nYn aml, roedd ganddi \u0022ddwy chwaer\u0022 o\u0027i phopty yn cyd-arwain ac a elwid yn Siarlot a Neli.",
  "wikiArticle": "Gwrthryfel gwerinol yn erbyn y tollau drud a godwyd am deithio ar hyd y ffyrdd tyrpeg oedd Helyntion Beca , a barodd o 1839 hyd 1844.\nTrawodd Beca gyntaf yn Efail-wen ar yr 13 Mai 1839, gan falu\u0027r dollborth yno. Fe wnaethpwyd yr un peth eto ar y 6 Mehefin yn yr un flwyddyn ac eto ar yr 17 Gorffennaf. Llosgwyd y tolldy y tro hwn. Ni ddarganfuwyd pwy oedd y troeseddwyr, gan fod y rhai a gymerodd ran yn y weithred wedi duo eu gwynebau a gwisgo dillad menywod. Gwelwyd dryllio dros gant o dollbyrth rhwng Ionawr 1843 a gwanwyn 1844 ledled de-orllewin Cymru. Roedd yr helynt ar ei waethaf yn Sir Gaerfyrddin. Ar 6 Gorffennaf 1843, ymosododd oddeutu 200 o bobl ar Dollborth Bolgoed, Pontarddulais. Yr arweinydd oedd crydd lleol o\u0027r enw Daniel Lewis. Fe\u0027i bradychwyd, yn ôl yr hanes, ond osgôdd gael ei ddanfon i Awstralia gan nad oedd tystion ar gael. Ceir cofeb i\u0027r digwyddiad yn y lleoliad hwn - ger Tafarn y Ffynnon heddiw.\n\u0027Merched Rebecca\u0027 neu \u0027Ferched Beca\u0027 oedd yr enw arnyn nhw ar lafar. Dywed rhai iddynt gael eu henwi ar ôl benyw o\u0027r enw Rebecca, neu Beca Fawr, a oedd wedi benthyg ei dillad iddyn nhw. Y farn gyffredinol, fodd bynnag, yw fod yr enw Rebecca yn gyfeiriad at adnod yn Llyfr Genesis, Pennod 24, adnod 60, lle sonir am fam a brawd Rebecca yn gadael iddi fynd gydag Eliezer, gwas Abraham, i briodi Isaac:\n\nAc a fendithiasant Rebbecah, ac a ddywedasant wrthi, \u0022Ein chwaer wyt, bydd di fil fyrddiwn; ac etifedded dy had borth ei gaseion.\u0022\nYn aml, roedd ganddi \u0022ddwy chwaer\u0022 o\u0027i phopty yn cyd-arwain ac a elwid yn Siarlot a Neli.\r\n\r\n== Ymosodiadau ar dollbyrth ==\nYmhlith yr ymosodiadau mwyaf nodedig y mae:\n\n13 Mai 1839: tollborth Efail-wen; ceir cofeb\n6 Mehefin: tollborth a tholldy Efail-wen\n1842: Tollborth Sanclêr; ceir cerflun yn Heol y Pentref\n6 Gorffennaf 1843: tollborth Bolgoed, Pontarddulais; ceir cofeb ger Tafarn y Ffynnon\n20 Gorffennaf 1843: tollborth Rhyd Y Pandy, Treforys\n7 Medi 1843: tollborth yr Hendy,\nCafwyd ymosodiadau hefyd yn: Hwlffordd, Caerfyrddin, Aberteifi, Cydweli, y Tymbl, Llandysul, Pontarddulais a Chastellnewydd Emlyn.\r\n\r\n== Achosion ==\nUn o achosion amlwg yr helynt oedd y tollbyrth eu hun, a weinyddwyd gan y Cwmnïau Tyrpeg newydd. Roedd rhaid talu  tollau i deithio ar hyd y prif-ffyrdd hyn. Roedd ddeuddeg Cwmni yn sir Gaerfyrddin, pedwar yn Sir Benfro, dau yn Sir Aberteifi, dau yn Sir Faesyfed, un yn Sir Frycheiniog a deuddeg ym Morgannwg. Roedd nifer uchel y Cwmnïau Tyrpeg yn yr ardal yn golygu bod rhaid i deithwyr talu tollau sawl gwaith i\u0027w gymharu â Lloegr lle nad oedd y fath gor-gystadlu. Roedd rhaid i\u0027r ffermwyr talu tollau wrth yrru\u0027u gwartheg a theithio yn ôl ac ymlaen i\u0027r marchnad, ac wrth ôl calch fel gwrtaith am y pridd.\nNid yr unig rheswm dros yr helyntion oedd y tollbyrth. Roedd tuedd gan werin De-Orllewin Cymru i weinyddu cyfraith eu hun trwy\u0027r traddodiad o\u0027r Ceffyl Pren. Dyma arfer o siomi yn gyhoeddus aelod o\u0027r gymuned sydd wedi achosi cerydd i\u0027w gymdogion neu gydweithio a\u0027r awdurdodau. Byddai dorf gyda\u0027i wynebau\u0027n ddu yn cario ffigur ceffyl at ddrws y person, neu ffigur yn ei ddynwared , neu hyd yn oed y berson ei hun, gan ei fychanu. Yn ôl yr hanesydd David Williams, \u0022ymestyniad o arfer y Ceffyl Pren\u0022 oedd terfysgoedd Beca.\nRoedd rhesymau eraill am yr helyntion yn cynnwys:\n\nTlodi cyffredinol De-Orllewin Cymru a\u0027i dir gymharol anffrwythlon.\nTwf y boblogaeth yn rhoi pwysau ar y bobl wrth i ffermydd fynd yn llai .\nY dirwasgiad amaethyddol a ddechreuodd yn 1836 a chyfres o gynaeafau gwael.\nBaich y degwm, yr arian a dalwyd i\u0027r Eglwys Anglicanaidd gan y ffermwyr. Achosodd anfodlonrwydd ychwanegol gan y ffaith mai anghydffurfwyr oedd rhan fwyaf o\u0027r werin. Gwaethygwyd y baich gan Ddeddf Cymudiad y Degwm a seilio faint y degwm ar brisiau cnydau y 7 mlynedd cynt. O ganlyniad roedd yn rhaid i\u0027r werin dalu degwm uchel er bod pris y cnydau\u0027n y farchnad wedi disgyn.\nY diffyg cymorth i\u0027r tlawd yn dilyn Deddf Gwella Cyfraith y Tlodion wnaeth diddymu cymorth allanol a gorfodi i\u0027r tlawd  weithio yn y Tlotai. Ymosododd Merched Beca ar dloty Caerfyrddin yn 1843.\nYr atgasedd at y tirfeddianwyr a\u0027r rhent uchel roeddent yn ei godi. Roedd nifer ohonynt yn landlordiaid absennol, a gwaethygwyd y gwrthdaro gan wahaniaethau mewn iaith a chrefydd Anglicaniaid oedd gan y rhan fwyaf, i\u0027w gymharu a\u0027r werin Anghydffurfiol, Gymraeg). Gweinyddwyd nifer o\u0027r Gwmnïau Tyrpeg atgas gan yr un tirfeddianwyr, a hwy oedd yn Ynadon yn y Llysoedd hefyd! Roedd y gyfraith a\u0027r achosion llys Saesneg yn rheswm arall am yr anfodlonrwydd. Bygythiwyd tirfeddianwyr ymysg parchedigion Anglicanaidd gan lythyron o ferched Beca.\r\n\r\n== Pwy oedd Rebeca? ==\nSonnir am Twm Carnabwth fel un o\u0027u harweinwyr. Roedd yn gymeriad cyfeillgar, lliwgar, ac yn ŵr crefyddol iawn. Roedd yn adroddwr pwnc gwych ond hefyd roedd yn enwog fel paffiwr mewn ffeiriau yn Sir Benfro, Aberteifi a Chaerfyddin. Cafodd Twm ei gladdu yng Nghapel y Bedyddwyr, Mynachlog Ddu.\nFodd bynnag, mae\u0027n ddigon posib mai trefnwyr yr ymgyrch oedd dau ddyn arbennig: y Bargyfreithiwr Lloyd Hall a\u0027r cyfreithiwr Hugh Williams.\nUn arweinydd lleol, o Bontarddulais oedd Daniel Lewis , er iddo osgoi cael ei erlyn gan nad oedd tystion.",
  "imageNames": [
    "Penparcau_tollhouse_St_Fagans.jpg",
    "RebeccaRiots.gif",
    "Rebecca_Riots_-_Punch1843.jpeg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1839,
  "end": 1843,
  "categoryId": "cymdeithasol",
  "id": "merched-beca",
  "label": "Merched Beca"
}