{
  "wikiSummary": "Owain ap Gruffydd a adnabyddir yn gyffredin heddiw fel Owain Glyn Dŵr, neu Owain Glyndŵr oedd y Cymro olaf i gael ei alw yn Dywysog Cymru. Rhoddwyd iddo hefyd y llysenw \u0022Y Mab Darogan\u0022.\nGanwyd Owain Glyndyfrdwy yn 1359. Roedd yn etifedd llinach Powys Fadog ar ochr ei dad, a honnai ei fod yn ddisgynnydd i’r Arglwydd Rhys o’r Deheubarth ar ochr ei fam. Etifeddodd arglwyddiaethau Glyndyfrdwy a Chynllaith gyda\u0027i ganolfan yn Sycharth, ger Llansilin, Powys. Astudiodd y gyfraith yn Llundain, a gwasanaethodd gyda lluoedd Henry Bolingbroke, gwrthwynebwr Rhisiart II, brenin Lloegr, a fyddai\u0027n ddiweddarach Harri IV, brenin Lloegr.\nYn 1400 cododd helynt ynghylch tir rhwng Owain Glyn Dŵr a\u0027r Arglwydd Grey o Ruthun, barwn pwerus o Loegr a oedd yn byw gerllaw. Pan ochrodd Harri IV â Grey, ymosododd Glyn Dŵr a’i ddilynwyr ar dref Rhuthun a threfi Cymreig eraill ger y ffin â Lloegr, gan achosi difrod mawr. Ddydd Gŵyl Mathew 1400 llosgodd Owain dref Rhuthun i\u0027r llawr, heblaw\u0027r castell. Erbyn diwedd 1401 roedd yn ymddangos bod y rhan fwyaf o’r wlad yn cefnogi’r gwrthryfel. Rhwng 1401 ac 1404 ymledodd y gwrthryfel ar draws Cymru a ddatblygodd yn gyflym i fod yn wrthryfel dros annibyniaeth i Gymru. Cipiwyd cestyll Harlech ac Aberystwyth a threchwyd byddinoedd Lloegr yng Nghwm Hyddgen a Bryn Glas yng nghanolbarth Cymru. Gan sylweddoli y byddai’n rhaid iddo drechu’r Saeson mewn brwydr fawr, cynhaliodd Glyn Dŵr, a oedd yn galw ei hun yn Dywysog Cymru, senedd arbennig ym Machynlleth i godi arian ar gyfer yr achos . Yn y Senedd a gynhaliwyd ym Machynlleth roedd cynrychiolwyr o Ffrainc, yr Alban a Sbaen. Ffurfiodd gynghreiriau â Dug Northumberland ac Edmund Mortimer, gelynion Harri IV, a lluniodd gynghrair ffurfiol â Brenin Ffrainc.\nAm gyfnod roedd yn rheoli bron y cyfan o Gymru, ond erbyn 1405, fodd bynnag, roedd y llanw wedi dechrau troi a threchwyd byddinoedd Glyn Dŵr yn y Grysmwnt a Brynbuga. Ni ddaeth cymorth gan y Ffrancwyr a’r Albanwyr, ac ildiodd dynion Morgannwg, Gŵyr, Tywi, Ceredigion ac Ynys Môn i frenin Lloegr. Erbyn 1408 roedd cadarnleoedd pwysig Harlech ac Aberystwyth wedi eu hadennill a daeth y gwrthryfel i ben. Cafwyd rhai cyrchoedd ar ôl hyn ond erbyn 1415 daeth y gwrthryfel i ben, a diflannodd Glyn Dŵr. Roedd llawer o ddifrod wedi ei wneud a nifer fawr wedi marw, a daeth pethau’n anodd pan gyflwynwyd cyfreithiau gwrth-Gymreig gan Harri IV. I rai teuluoedd cyfoethog, daeth y gwrthryfel â’u hawdurdod i ben. Newidiodd eraill eu teyrngarwch i Harri IV ac aeth llawer o’r dynion a oedd wedi ymladd ochr yn ochr â Glyn Dŵr ymlaen i ymladd yn erbyn y Ffrancwyr yn Agincourt . Ond yn ystod y gwrthryfel, roedd y Cymry wedi uno o dan arweinydd cenedlaethol gan blannu gweledigaeth o Gymru annibynnol.\nMae Owain Glyn Dŵr yn sefyll fel unigolyn pwysig yn hanes Cymru, nid yn unig fel un oedd yn cael ei weld fel arweinydd cenedlaethol ond hefyd fel gwleidydd a oedd yn gweld rôl i Gymru o fewn cyd-destun Ewropeaidd. Yn Llythyr Pennal a ysgrifennwyd yn 1406 mae’n ceisio llunio cysylltiadau gyda Ffrainc drwy ddangos cefnogaeth i Bab Avignon, yn hytrach na Phab Rhufain a gefnogwyd gan Loegr. Yn y llythyr mae Glyn Dŵr hefyd yn amlinellu ei syniad am sut byddai’n creu Cymru annibynnol drwy sefydlu dwy brifysgol yng Nghymru , Eglwys annibynnol i Gymru gyda\u0027i chronfa arian ei hunan a Chymry Cymraeg yn cael eu penodi i swyddi uchel yn yr Eglwys.\nCeir y cofnod olaf am Owain yn 1412, ac nid oes neb yn sicr beth ddigwyddodd iddo ar ôl hynny. Saif, fodd bynnag, yng nghof y Gymru gyfoes fel un o arwyr pwysicaf y genedl ac mae cerflun ohono yn oriel yr arwyr cenedlaethol Neuadd y Ddinas, Caerdydd.",
  "wikiArticle": "Owain ap Gruffydd a adnabyddir yn gyffredin heddiw fel Owain Glyn Dŵr, neu Owain Glyndŵr oedd y Cymro olaf i gael ei alw yn Dywysog Cymru. Rhoddwyd iddo hefyd y llysenw \u0022Y Mab Darogan\u0022.\nGanwyd Owain Glyndyfrdwy yn 1359. Roedd yn etifedd llinach Powys Fadog ar ochr ei dad, a honnai ei fod yn ddisgynnydd i’r Arglwydd Rhys o’r Deheubarth ar ochr ei fam. Etifeddodd arglwyddiaethau Glyndyfrdwy a Chynllaith gyda\u0027i ganolfan yn Sycharth, ger Llansilin, Powys. Astudiodd y gyfraith yn Llundain, a gwasanaethodd gyda lluoedd Henry Bolingbroke, gwrthwynebwr Rhisiart II, brenin Lloegr, a fyddai\u0027n ddiweddarach Harri IV, brenin Lloegr.\nYn 1400 cododd helynt ynghylch tir rhwng Owain Glyn Dŵr a\u0027r Arglwydd Grey o Ruthun, barwn pwerus o Loegr a oedd yn byw gerllaw. Pan ochrodd Harri IV â Grey, ymosododd Glyn Dŵr a’i ddilynwyr ar dref Rhuthun a threfi Cymreig eraill ger y ffin â Lloegr, gan achosi difrod mawr. Ddydd Gŵyl Mathew 1400 llosgodd Owain dref Rhuthun i\u0027r llawr, heblaw\u0027r castell. Erbyn diwedd 1401 roedd yn ymddangos bod y rhan fwyaf o’r wlad yn cefnogi’r gwrthryfel. Rhwng 1401 ac 1404 ymledodd y gwrthryfel ar draws Cymru a ddatblygodd yn gyflym i fod yn wrthryfel dros annibyniaeth i Gymru. Cipiwyd cestyll Harlech ac Aberystwyth a threchwyd byddinoedd Lloegr yng Nghwm Hyddgen a Bryn Glas yng nghanolbarth Cymru. Gan sylweddoli y byddai’n rhaid iddo drechu’r Saeson mewn brwydr fawr, cynhaliodd Glyn Dŵr, a oedd yn galw ei hun yn Dywysog Cymru, senedd arbennig ym Machynlleth i godi arian ar gyfer yr achos . Yn y Senedd a gynhaliwyd ym Machynlleth roedd cynrychiolwyr o Ffrainc, yr Alban a Sbaen. Ffurfiodd gynghreiriau â Dug Northumberland ac Edmund Mortimer, gelynion Harri IV, a lluniodd gynghrair ffurfiol â Brenin Ffrainc.\nAm gyfnod roedd yn rheoli bron y cyfan o Gymru, ond erbyn 1405, fodd bynnag, roedd y llanw wedi dechrau troi a threchwyd byddinoedd Glyn Dŵr yn y Grysmwnt a Brynbuga. Ni ddaeth cymorth gan y Ffrancwyr a’r Albanwyr, ac ildiodd dynion Morgannwg, Gŵyr, Tywi, Ceredigion ac Ynys Môn i frenin Lloegr. Erbyn 1408 roedd cadarnleoedd pwysig Harlech ac Aberystwyth wedi eu hadennill a daeth y gwrthryfel i ben. Cafwyd rhai cyrchoedd ar ôl hyn ond erbyn 1415 daeth y gwrthryfel i ben, a diflannodd Glyn Dŵr. Roedd llawer o ddifrod wedi ei wneud a nifer fawr wedi marw, a daeth pethau’n anodd pan gyflwynwyd cyfreithiau gwrth-Gymreig gan Harri IV. I rai teuluoedd cyfoethog, daeth y gwrthryfel â’u hawdurdod i ben. Newidiodd eraill eu teyrngarwch i Harri IV ac aeth llawer o’r dynion a oedd wedi ymladd ochr yn ochr â Glyn Dŵr ymlaen i ymladd yn erbyn y Ffrancwyr yn Agincourt . Ond yn ystod y gwrthryfel, roedd y Cymry wedi uno o dan arweinydd cenedlaethol gan blannu gweledigaeth o Gymru annibynnol.\nMae Owain Glyn Dŵr yn sefyll fel unigolyn pwysig yn hanes Cymru, nid yn unig fel un oedd yn cael ei weld fel arweinydd cenedlaethol ond hefyd fel gwleidydd a oedd yn gweld rôl i Gymru o fewn cyd-destun Ewropeaidd. Yn Llythyr Pennal a ysgrifennwyd yn 1406 mae’n ceisio llunio cysylltiadau gyda Ffrainc drwy ddangos cefnogaeth i Bab Avignon, yn hytrach na Phab Rhufain a gefnogwyd gan Loegr. Yn y llythyr mae Glyn Dŵr hefyd yn amlinellu ei syniad am sut byddai’n creu Cymru annibynnol drwy sefydlu dwy brifysgol yng Nghymru , Eglwys annibynnol i Gymru gyda\u0027i chronfa arian ei hunan a Chymry Cymraeg yn cael eu penodi i swyddi uchel yn yr Eglwys.\nCeir y cofnod olaf am Owain yn 1412, ac nid oes neb yn sicr beth ddigwyddodd iddo ar ôl hynny. Saif, fodd bynnag, yng nghof y Gymru gyfoes fel un o arwyr pwysicaf y genedl ac mae cerflun ohono yn oriel yr arwyr cenedlaethol Neuadd y Ddinas, Caerdydd.\r\n\r\n== Bywyd cynnar ==\nMae ansicrwydd ynghylch blwyddyn geni Owain. Awgryma cofnod achos cyfreithiol Grosvenor v Scrope, lle\u0027r ymddangosodd fel tyst, ei fod wedi ei eni yn 1359. Rhydd un llawysgrif ddyddiad pendant: 28 Mai, 1354, tra ceir traddodiad iddo gael ei eni yn 1349, blwyddyn y Pla Du. Nid oes sicrwydd ymhle y ganwyd ef chwaith; mae\u0027n bosib mai Sycharth, ger Llansilin yw\u0027r lle mwyaf tebygol. Bu farw ei dad rywbryd cyn 1370 gan adael ei fam yn weddw. Etifeddodd Glyndyfrdwy a Chynllaith oddi wrth ei dad, a thiroedd yng nghymydau Gwynionydd ac Iscoed Uch Hirwern yng Ngheredigion oddi wrth ei fam. Mae\u0027n debyg bod Owain wedi treulio rhywfaint o\u0027i blentyndod yng nghartref Syr David Hanmer. Bu yn Llundain yn astudio\u0027r gyfraith am rai blynyddoedd, yn ôl pob tebyg ym mlynyddoedd olaf teyrnasiad Edward III. Mae\u0027n bur debyg ei fod yn Llundain adeg Gwrthryfel y Werin yn 1381. Roedd yn ôl yng Nghymru erbyn 1383, a phriododd Margaret Hanmer, a oedd yn ferch i Syr David Hanmer.Gwyddys iddo ymladd yn yr Alban dros Rhisiart II, brenin Lloegr; ceir y cofnod cyntaf amdano fel milwr yn 1384, pan oedd yn aelod o arsiwn Berwick-upon-Tweed, gyda charfan o Gymry dan Syr Gregory Sais. Yn 1385 roedd yn ymladd yn Ffrainc yn y Rhyfel Can Mlynedd, ac yn ddiweddarach y flwyddyn honno roedd yn yr Alban eto dan John o Gaunt. Yn 1386 cofnodir iddo gael ei alw fel tyst yn achos Scrope v. Grosvenor yng Nghaer. Yn 1387, roedd yn ne-ddwyrain Lloegr yn gwasanaethu dan Richard FitzAlan, 11eg Iarll Arundel, a chymerodd ran mewn brwydr ar y môr oddi ar arfordir Caint, pan orchfygwyd llynges o Ffrainc, Sbaen a Fflandrys. Yn ddiweddarach y flwyddyn honno, bu farw ei dad-yng-nghyfraith, Syr David Hanmer, a dychwelodd Owain i Gymru i fod yn ysgutor ei ystâd.Treuliodd Owain y blynyddoedd nesaf ar ei stad. O\u0027r cyfnod yma, yn ôl pob tebyg, y mae cywydd enwog Iolo Goch yn canmol ei lys yn Sycharth yn dyddio. Roedd Gregory Sais wedi marw yn 1390, a thua\u0027r un adeg, dechreuodd Iarll Arundel golli dylanwad; dienyddiwyd ef yn 1397. Yn 1399, cipiwyd grym Lloegr gan Henry Bolingbroke, a ddiorseddodd y brenin Rhisiart II a dod yn frenin fel Harri IV. Carcharwyd Rhisiart, a llofruddiwyd ef yn Chwefror 1400. Datblygodd cweryl rhwng Owain a Reginald Grey, arglwydd Dyffryn Clwyd, a hawliai gyfran o diroedd Owain Glyn Dŵr. Yn ystod teyrnasiad Rhisiart II, penderfynwyd yr achos o blaid Owain, ond wedi i Harri IV gipio\u0027r orsedd, ail-agorodd de Grey yr achos, gan fanteisio ar y ffaith ei fod yn gyfaill i\u0027r brenin. Dywed rhai ffynonellau fod de Grey wedi oedi gyrru gwŷs gan y brenin i Owain yn hawlio cymorth milwrol yn yr Alban. Erbyn i Owain dderbyn y wŷs, roedd yn rhy hwyr iddo ymateb.\r\n\r\n== Y Gwrthryfel, 1400–1415 ==\n\n\n=== Dechrau\u0027r gwrthryfel 1400–1401 ===\nAr 16 Medi, 1400, gweithredodd Owain, a chafodd ei gyhoeddi\u0027n Dywysog Cymru gan ei gefnogwyr. Roedd hyn yn ddatganiad chwyldroadol ynddo\u0027i hun. Ymledodd yr ymgyrch drwy\u0027r gogledd-ddwyrain. Erbyn 19 Medi, ymosodwyd ar Ruthun, cadarnle de Grey, a bu bron iawn iddo gael ei dinistrio\u0027n llwyr. Ymosodwyd ar Ddinbych, Rhuddlan, castell y Fflint, Penarlâg, a Holt yn fuan ar ôl hynny. Ar 22 Medi cafodd tref Croesoswallt ei difrodi mor ddrwg gan gyrch Owain fel y bu rhaid ei hail-siarteru yn ddiweddarach. Erbyn y 24ain, roedd Owain yn symud i\u0027r de drwy Bowys a dinistriodd y Trallwng. Ar yr un pryd lansiodd nifer o aelodau teulu Tuduriaid Penmynydd o ynys Môn, gyfres o ymosodiadau \u0022guerilla\u0022 yn erbyn y Saeson. Roedd y Tuduriaid yn deulu blaenllaw o Fôn ac wedi mwynhau perthynas agos â Rhisiart II , mab hynaf Henry Percy, Iarll 1af Northumberland. Cynigiodd ef bardwn i bawb o ddilynwyr Owain Glyn Dŵr, ac eithrio Owain eu hun a dau o Duduriaid Penmynydd, Rhys ap Tudur a\u0027i frawd Gwilym ap Tudur. Am rai misoedd, ymddangosai fod y gwrthryfel yn dirwyn i ben. Fodd bynnag, ar ddydd Gwener y Groglith 1401, cipiodd Rhys a Gwilym ap Tudur gastell Conwy. Tua mis Mehefin yr un flwyddyn ymladdwyd brwydr Hyddgen yn uchel ar lethrau Pumlumon, ar y ffin rhwng Powys a Cheredigion. Trechodd byddin fach Owain Glyn Dŵr lu mawr o Saeson a Fflemingiaid oedd yn ceisio cyrraedd castell Aberystwyth. Arweiniodd Harri IV gyrch i dde Cymru, a dienyddiwyd un o gefnogwyr Owain, Llywelyn ap Gruffudd Fychan o Gaeo yn Llanymddyfri ar 9 Hydref. Ddiwedd Tachwedd, gyrrodd Owain lythyrau at Robert III, brenin yr Alban ac at benaethiaid Iwerddon yn gofyn am gymorth. Daeth y flwyddyn i ben gyda Brwydr Twthil ar 2 Tachwedd 1401, rhwng llu Owain Glyn Dŵr ac amddiffynwyr Caernarfon.\n\n\n=== Anterth 1402–1405 ===\n\nYmddangosodd comed yn ystod misoedd Chwefror a Mawrth 1402, a ystyrid gan lawer yn argoel o fuddugoliaeth Owain Glyn Dŵr. Tua chanol mis Ebrill, cymerwyd gelyn Owain, Reginald de Grey o Ruthun, yn garcharor ganddo gerllaw Rhuthun. Bu raid i de Grey dalu 10,000 o farciau am ei ryddid. Enillodd Owain fuddugoliaeth bwysig ym Mrwydr Bryn Glas ar 22 Mehefin 1402, ger pentref Pilalau, ar odre gogleddol Fforest Faesyfed, ger Llanandras a\u0027r ffin rhwng Swydd Henffordd a Powys. Cymerwyd arweinydd y fyddin Seisnig, Syr Edmund Mortimer, yn garcharor. Yn nes ymlaen byddai\u0027n priodi Catrin, ferch Owain, ac yn sefyll ysgwydd wrth ysgwydd gyda\u0027r Mab Darogan yn erbyn brenin Lloegr. Yn 1402 hefyd, pasiodd Senedd Lloegr y Deddfau Penyd, cyfres o ddeddfau yn erbyn y Cymry. Dan y deddfau hyn, gwaherddid unrhyw Gymro, heblaw esgobion, rhag dal unrhyw swydd gyhoeddus, rhag dwyn arfau a rhag byw mewn unrhyw fwrdeistref Seisnig. Roedd y gwaharddiad ar ddal swydd gyhoeddus hefyd yn ymestyn i unrhyw Sais oedd yn briod a Chymraes.\nYn 1403, cododd Henry Percy mewn gwrthryfel yn erbyn y brenin, a gwnaeth gytundeb ag Owain. Lladdwyd Hotspur yn ymladd yn erbyn byddin y brenin ym Mrwydr Amwythig ar 21 Gorffennaf. Nid oedd Owain a\u0027i fyddin yn bresennol, er bod rhai o\u0027i gefnogwyr yno. Roedd Owain ei hun yn ymgyrchu yn Sir Gaerfyrddin, lle cododd Cymry Dyffryn Tywi i\u0027w gefnogi, ac ym mis Gorffennaf ildiwyd castell a thref Caerfyrddin iddo. Ym mis Mai 1404, gyrrodd Owain lythyr at Charles VI, brenin Ffrainc, gan ei arwyddo fel Owynus dei gratia princeps Wallie. Cludwyd y llythyr i Baris gan ddau lysgennad, ei frawd-yng-nghyfraith, John Hanmer, a\u0027i ganghellor, Gruffudd Yonge. Rywbryd yn ystod 1404, syrthiodd Castell Harlech a Chastell Aberystwyth i Owain, gan gryfhau ei afael ar ganolbarth Cymru. Yr un flwyddyn, cofnodir gan Adda o Frynbuga i Owain gynnal senedd ym Machynlleth.\nAr 12 Ionawr 1405 arwyddwyd cytundeb ffurfiol gyda brenin Ffrainc, i gynghreirio yn erbyn Harri IV, brenin Lloegr. O fewn wythnosau, glaniodd byddin enfawr o Ffrancwyr yn Aberdaugleddau, Sir Benfro heddiw. Gorymdeithio y Ffrancwyr ochr-yn-ochr â byddin Cymru, trwy Swydd Henffordd ac ymlaen i Swydd Gaerwrangon. Fe wnaethant gyfarfod â byddin Lloegr ddim ond deng milltir o Gaerwrangon. Cymerodd y ddwy fyddin eu safleoedd yn barod i frwydro, a hynny gan wynebu ei gilydd filltir i ffwrdd, ond ni fu unrhyw ymladd. Yna, am resymau nad ydyn nhw erioed wedi dod yn amlwg, enciliodd y Cymry, a throdd y Ffrancwyr adref ychydig wedyn.\nAr 28 Chwefror 1405, arwyddwyd y Cytundeb Tridarn rhwng Owain a\u0027i gynghreiriad Henry Percy, Iarll 1af Northumberland ac Edmund Mortimer. Roedd y cytundeb yma\u0027n rhannu Ynys Brydain rhyngddynt fel penaethiaid sofran, annibynnol. Yn ôl y ddogfen, roedd Owain Glyn Dŵr a phob Tywysog Cymru ar ei ôl, i gael:\n\n\u0022The whole of Cambria or Wales divided from Leogria now commonly called England by the following borders, limits, and bounds: from the Severn estuary as the River Severn flows from the sea as far as the northern gate of the city of Worcester; from that gate directly to the ash trees known in Cambrian or Welsh language as Onennau Meigion which grow on the high road from Bridgnorth to Kinver; then directly along the highway... to the head or source of the River Trent; thence to the head or source of the river commonly known as the Mersey and so along to the sea\u0022.\nYm mis Mawrth 1405 roedd Rhys Gethin yn y de, yn ymosod yn aflwyddiannus ar dref Y Grysmwnt a\u0027i chastell; curwyd ei fyddin o tua 8,000 o wŷr Gwent a Morgannwg gan fyddin gref a anfonwyd o Henffordd i godi\u0027r gwarchae. Ym mis Mai\u0027r un flwyddyn, gorchfygwyd byddin Owain ym Mrwydr Pwll Melyn gerllaw Brynbuga, Sir Fynwy. Lladdwyd ei frawd, Tudur, a chymerwyd ei fab, Gruffudd yn garcharor. Tua 1 Awst, cynhaliwyd ail senedd Owain yn Harlech. Yn fuan wedyn, cyrhaeddodd byddin Ffrengig o tua 2,600 o wŷr dan Jean de Hangest i Aberdaugleddau, Sir Benfro, i gynorthwyo Owain. Ymunodd cefnogwyr Owain â hwy, a chipiwyd tref Hwlffordd, ond nid y castell, yna cipiwyd tref a chastell Caerfyrddin ac Aberteifi. Erbyn diwedd Awst, roeddynt gerllaw Caerwrangon, yn wynebu byddin y brenin. Nid oedd yr un o\u0027r ddwy fyddin yn barod i ymosod, ac ymhen wythnos, enciliodd byddin Owain. Ymosododd y brenin ar Sir Forgannwg, ond roedd y tywydd yn ddrwg, a bu raid iddo yntau encilio.\n\n\n=== Y llanw\u0027n troi 1406–1412 ===\n\nCynhaliwyd cynulliad o\u0027r Cymry ym Mhennal, ger Machynlleth ym mis Mawrth, 1406, ac yno lluniwyd dogfen yn gosod allan bwriadau\u0027r tywysog ynghyd â llythyr i Charles VI; adnabyddir y dogfennau pwysig hyn fel Polisi Pennal. Roedd Owain wedi derbyn llythyr gan Charles VI ar ddechrau Mawrth, yn ei annog i drosglwyddo ei deyrngarwch i Bab Avignon, Bened XIII. Yn y llythyr a anfonodd Owain yn ôl at frenin Ffrainc ar 31 Mawrth, cytunodd i wneud hynny ar rai amodau. Yn eu plith, roedd rhaid i Bened XIII gytuno i sefydlu eglwys Gymreig, yn atebol i Dyddewi yn hytrach nag i Archesgob Caergaint, a sefydlu dwy brifysgol, neu studia generalia, yng Nghymru, un yn y gogledd ac un yn y de.\nFodd bynnag, roedd llanw\u0027r gwrthryfel eisoes ar drai. Yn yr un flwyddyn cofnodir fod Penrhyn Gŵyr, Dyffryn Tywi a rhan helaeth o Geredigion wedi ymostwng i\u0027r Saeson. Erbyn diwedd y flwyddyn, roedd nifer fawr o gefnogwyr Owain at Ynys Môn wedi ymostwng hefyd.\nYn ystod haf 1407, gwnaeth byddin brenin Lloegr, dan y tywysog Harri , ymdrech i ail-gipio Castell Aberystwyth, oedd yn cael ei gadw dros Owain gan Rhys Ddu. Wedi trafodaethau heddwch, cytunodd Rhys i ildio\u0027r castell erbyn dyddiad penodol os nad oedd y gwarchae Seisnig wedi ei godi. Fodd bynnag, pan aeth at Owain i ofyn am ganiatâd i ildio\u0027r castell, daeth Owain i Aberystwyth ei hun, a bygwth torri pen unrhyw un a geisiai ildio\u0027r castell, yn cynnwys Rhys. Methodd yr ymgais yma ar ran y Saeson, ond ymosododd byddin Harri eto yn 1408, a syrthiodd y castell iddynt y tro hwn.\nYn 1409 syrthiodd Castell Harlech i\u0027r Saeson. Roedd Edmund Mortimer wedi marw yn ystod y gwarchae, a chymerwyd Margaret, gwraig Owain, a dwy o\u0027i ferched, yn cynnwys Catrin, gwraig Mortimer, yn garcharorion.\nDienyddiwyd nifer o gefnogwyr amlwg Owain yr un flwyddyn neu yn 1410; Rhys Ddu yn Llundain, Philip Scudamore yn Amwythig a Rhys ap Tudur yng Nghaer.\r\n\r\n== Diflaniad ==\nNid oes cofnod pendant am hanes Owain ar ôl 1412, gan gymerodd Dafydd Gam, un o gefnogwyr Cymreig amlycaf Harri IV, yn garcharor gerllaw Aberhonddu. Dyma\u0027r tro olaf i Owain gael ei weld gan ei elynion. Yn ôl llawysgrif Peniarth 135, a ysgrifennwyd yn fuan ar ôl 1422:\n\nMCCCCxv y ddaeth Owain mewn difant y gwyl Vathe yn y kyngayaf o hynny allan ni wybuwyd i ddifant rrann vawr a ddywaid i varw y brudwyr a ddywedant na bu \n1415 – Diflannodd Owain ar Ŵyl Sant Matthew yn amser cynhaeaf. O hynny allan ni wybuwyd i ble y diflannodd. Dywed llawer ei fod wedi marw, ond dywed y brudwyr na fu.\nRoedd Harri IV wedi marw yn 1413, a\u0027i fab wedi ei olynu ar yr orsedd fel Harri V. Ail-ddechreuodd ef yr ymladd yn y Rhyfel Can Mlynedd yn erbyn Ffrainc, ac yn haf 1415 gofynnodd y brenin newydd i Gilbert Talbot gysylltu ag Owain, a chynnig pardwn iddo. Ni chafwyd ymateb, ac yn 1416 gofynnwyd i Talbot geisio eto, trwy fab Owain, Maredudd ab Owain Glyn Dŵr, y tro hwn. Unwaith eto, ni chafwyd ymateb. Derbyniodd Maredudd bardwn ar 8 Ebrill, 1421. Nid oedd sôn am ei dad, sy\u0027n awgrymu efallai ei fod yn farw erbyn hynny. Buasai Owain Glyn Dŵr ymhell yn ei chwedegau erbyn hynny, pe bai dal yn fyw; gwth o oedran yn yr Oesoedd Canol.\nCeir nifer o draddodiadau lleol yn Swydd Henffordd sy\u0027n awgrymu ei fod wedi cael lloches gyda\u0027i ferch Alys, oedd yn briod a Syr John Scudamore, ym Monnington Stradel, ac iddo farw yno, a\u0027i gladdu yno neu yn Kentchurch gerllaw. Roedd traddodiad arall yn yr ardal mai Owain oedd y bardd Siôn Cent, y bu teulu Scudamore yn un o\u0027i noddwyr.\nYn 2015 cyhoeddodd Gruffydd Aled Williams gyfrol Dyddiau Olaf Owain Glyn Dŵr ac ynddo mae\u0027n awgrymu dau bosibilrwydd: yn gyntaf, sonia fod llawysgrif a fu ym meddiant Robert Vaughan o\u0027r hengwrt yn allweddol wrth geisio ateb i\u0027r cwestiwn ym mhle y claddwyd Owain. Mae\u0027r cofnod, sydd yn llaw Vaughan, yn awgrymu iddo gael ei gladdu ym mynwent eglwys fechan iawn mewn pentref yn Swydd Amwythig: Cappel Kimbell lle i claddwyd Owen Glyn: yn sir Henffordd. Yn ôl Gruffydd Aled Williams, mynwent Eglwys Sant Iago, ym mhentref Kimbolton yw\u0027r fan. Yr ail bosibilrwydd mae\u0027n ei gynnig yw i Owain gael ei gladdu ger cartref un o\u0027i ferched yn Monnington Straddle , eto yn Swydd Henffordd, gan fod traddodiad cryf yn yr ardal iddo\u0027i gladdu yno mewn hen domen gladdu. Bu\u0027r tir yma\u0027n rhan o dir cysegredig a gwyddys fod ar draws y cae i\u0027r domen dŷ o\u0027r enw Chapel Cottage, a oedd yn y 14g yn gapel anwes.\r\n\r\n== Owain a Chenedlaetholdeb Cymreig ==\nYchydig o gyfeiriadau sydd at Owain gan y beirdd yn y cyfnod ar ôl ei ddiflaniad, ond cadwyd nifer fawr o chwedlau a thraddodiadau gwerin o\u0027i gwmpas. Gwelwyd Owain fel y Mab Darogan, ac fel enghraifft o thema\u0027r Brenin yn y mynydd neu\u0027r Arwr Cwsg, gyda\u0027r gred ei fod yn cysgu mewn ogof, i ddeffro ryw ddydd pan fydd angen Cymru fwyaf a gorchfygu ei gelynion. Ceir traddodiadau tebyg am Owain arall, Owain Lawgoch, ac yn aml mae ansicrwydd at ba un y cyfeirir.\nCofnododd Elis Gruffydd , chwedl am Owain yn 1548. Roedd Abad Abaty Glyn y Groes wedi codi yn fore, ac yn cerdded ar y Berwyn. Cyfarfu ag Owain Glyn Dŵr, a\u0027i cyfarchodd ef \u0022Syr Abad, rydych wedi codi yn rhy fore\u0022. \u0022Na\u0022, atebodd yr abad, \u0022chychwi a godasoch yn rhy fore, o gan mlynedd\u0022.\n\nAnffafriol fu barn haneswyr Cymreig ar Owain yn y canrifoedd nesaf, er enghraifft David Powel yn ei Historie of Cambria, now called Wales yn y 16g. Y rheswm pennaf am hynny oedd eu bod yn dibynnu ar lyfrau am y cyfnod gan haneswyr Seisnig a chofnodion swyddogol Coron Lloegr sy\u0027n portreadu Owain fel \u0022bradwr\u0022 penboeth a chreulon a ddaeth a gwae a dioddef i Gymru. Rhoddwyd darlun mwy ffafriol ohono gan Thomas Pennant yn ei Tours in Wales yn 1778. Gyda datblygiad y mudiad Cymru Fydd yn niwedd y 19g, cynyddodd diddordeb yn hanes Owain Glyn Dŵr. Ceir portread ffafriol iawn ohono yn y cylchgrawn Cymru gan O. M. Edwards. Yn 1905, cyhoeddodd Owen Rhoscomyl ei gyfrol ddylanwadol Flame-Bearers of Welsh History sy\u0027n disgrifio Owain fel arwr a ymgeleddai\u0027r werin bobl: yn ateb i\u0027r cwestiwn \u0022ble gladdwyd Glyn Dŵr?\u0022 ceir yr ateb ei fod yn gorffwys yng nghalon pob gwir Gymro lle bydd yn aros yn ysbrydoliaeth i\u0027r genedl am byth. Yn 1931, cyhoeddodd John Edward Lloyd yr astudiaeth safonol gyntaf o fywyd a gwrthryfel Owain, Owen Glendower. Diweddodd y llyfr gyda\u0027r farn:\nFor the Welshmen of all subsequent ages, Glyn Dŵr has been a national hero, the first, indeed, in the country\u0027s history to command the willing support alike of north and south, east and west, Gwynedd and Powys, Deheubarth and Morgannwg. He may with propriety be called the father of modern Welsh nationalism\u0022.\n\nYn ddiweddar mae Diwrnod Owain Glyn Dŵr wedi dod yn ddydd gŵyl answyddogol a ddethlir yng Nghymru ar 16 Medi, y dyddiad y cyhoeddwyd Owain Glyn Dŵr  yn Dywysog Cymru yn 1400. Cytunwyd i hedfan baner Glyn Dŵr ar furiau Castell Caerdydd ar 16 Medi 2006, mewn ymateb i bwysau gan y cyhoedd. Yn 2008, gydag Alun Ffred Jones AC yn Weinidog Treftadaeth yn Llywodraeth Cymru, cyhoeddodd Cadw eu bod am chwifio baner Glyn Dŵr ar gestyll Caernarfon, Caerffili, Conwy a Harlech, ond does dim tystiolaeth bod y llewod erioed wedi cael ei chwifio, ond yn ôl Adda o Frynbuga, yr oedd yna faner o\u0027r ddraig aur ar ben Twthill, Caernarfon.\nEnwyd nifer o bethau ar ôl Owain Glyn Dŵr. Rhoddwyd yr enw Llwybr Glyn Dŵr ar y llwybr cerdded pellter hir ar draws canolbarth Cymru, sy\u0027n ymweld â nifer o safleoedd cysylltiedig ag Owain megis safle brwydr Hyddgen a thref Machynlleth, lle cynhaliodd ei senedd gyntaf. Yn 2008, derbyniodd NEWI, yng ngogledd-ddwyrain Cymru, statws prifysgol, a newidiodd ei enw i Brifysgol Glyn Dŵr. Dyfernir Gwobr Glyn Dŵr yn flynyddol am gyfraniadau arbennig i\u0027r celfyddydau yng Nghymru. Fe\u0027i rhoddir gan Ymddiriedolaeth Tabernacl Machynlleth i ffigyrau blaenllaw ym meysydd cerddoriaeth, celf a llenyddiaeth yn eu tro.\nDefnyddiwyd enw Owain hefyd gan fudiad Meibion Glyn Dŵr, fu\u0027n cynnal ymgyrch losgi tai haf o ddiwedd y 1970au ymlaen. Roedd rhai o\u0027r negesau a anfonid i\u0027r awdurdodau gan y mudiad yn dwyn enw Rhys Gethin. Daeth Owain yn ail yn yr arolwg barn ar-lein 100 o Arwyr Cymru a drefnwyd gan Culturenet Cymru yn 2004.\r\n\r\n== Owain mewn llenyddiaeth ==\n\n\n=== Barddoniaeth ===\nCanoloesol\nRoedd croeso i\u0027r beirdd ar aelwyd llys Owain Glyn Dŵr  yn Sycharth. Canodd Iolo Goch gerddi moliant i Owain Glyn Dŵr a llys Sycharth. Mae ei ddisgrifiad o lys Sycharth ymhlith y cerddi mwyaf adnabyddus o\u0027r cyfnod. Ceir hefyd dwy gerdd o fawl i Owain gan Gruffudd Llwyd a gyfansoddwyd yn y 1380au. Mae\u0027n amlwg o\u0027u cynnwys fod y cerddi hyn i gyd wedi eu cyfansoddi cyn y gwrthryfel; nid erys yr un gerdd gan fardd adnabyddus a gyfansoddwyd yn ystod y gwrthryfel na marwnad i Owain .\nCedwir ar glawr gerddi i Rys Gethin, uchelwr o Nant Conwy a fu\u0027n un o gapteiniaid blaenaf Owain Glyn Dŵr. Mae\u0027n cael ei ddisgrifio mewn un gerdd fel hyn:\n\nMilwr yw â gwayw melyn\nMegis Owain glain y Glyn.\nCeir cerdd arall i Hywel Coetmor, brawd Rhys Gethin, a chapten ym myddin Owain Glyn Dŵr fel ei frawd. Mae\u0027r cerddi hyn, o awduriaeth ansicr, yn hynod wladgarol ac mae lle da i gredu eu bod yn perthyn i gyfnod y gwrthryfel.\nGwyddys fod gan Owain fardd teulu o\u0027r enw Crach Ffinnant gydag enw iddo\u0027i hun fel brudiwr; bu gydag Owain yng ngarsiwn Berwick yn 1384 ac yng Nglyndyfrdwy pan gyhoeddwyd Owain yn Dywysog Cymru ym Medi 1400.\nCeir \u0022Owain\u0022 fel enw am y Mab Darogan mewn nifer fawr o gerddi brud poblogaidd o ddiwedd yr Oesoedd Canol, ond mae\u0027n anodd eu dyddio yn fanwl. Mae\u0027n bosibl fod rhai yn dyddio o gyfnod Owain Lawgoch ond mae\u0027r mwyafrif i\u0027w dyddio i\u0027r 15g ac felly\u0027n perthyn i gyfnod Owain Glyn Dŵr neu gyfnod Rhyfeloedd y Rhosynnau pan oedd y cof amdano fel arweinydd cenedlaethol yn fyw iawn. Mae cerdd rydd a briodolir i Taliesin yn perthyn i gyfnod y gwrthryfel, yn ôl pob tebyg. Cyfeiria at \u0022arth sych )\u0022 a rhyfelwr arall o Eryri yn codi yn erbyn y Saeson. Yna bydd:\n\nLlawer celain gan frain,\nLlawer cleddau heb wain,\nLlawer diras Sais heb gyweithas,\nA blaidd Glyndyfrdwy yn rhannu\u0027r deyrnas.\nMae\u0027n bosibl fod \u0022rhannu\u0027r deyrnas\u0022 yma yn gyfeiriad at y Cytundeb Tridarn .\nCyfnod diweddar\nRoedd \u0022I Owain Glyn Dŵr\u0022 yn un o destunau Eisteddfod Corwen 1789 a drefnwyd gan y Gwyneddigion. Cafwyd cerddi ar y testun gan Twm o\u0027r Nant a Gwallter Mechain. Diddorol nodi i\u0027r eisteddfod gael ei chynnal yng Ngwesty Owain Glyn Dŵr. Ailgydiodd hanes gwrthryfel Owain Glyn Dŵr yn nychymyg y Cymry yn y 19g, ond arhosodd yng nghysgod y ddau Llywelyn tan ddiwedd y ganrif honno. Cyfansoddodd Felicia Hemans gerdd Saesneg ramantaidd amdano sy\u0027n sôn am \u0022the blazing star\u0022 yn rhagfynegi dyfodiad yr arwr. Cyfansoddodd Robert Davies \u0022Gywydd o Hanes Owen Glyndyfrdwy\u0022 yn 1826. Yn Eisteddfod Caerfyrddin 1867 enillodd y bardd Hwfa Môn y tlws am ei gerdd \u0022Owain Glyndwr\u0022. Enillodd Eifion Wyn gadair Eisteddfod Llangollen 1895 gyda\u0027i awdl am Owain. Yn Eisteddfod Corwen 1900 bu T. Twynog Jeffries yn fuddugol gyda\u0027i awdl \u0022Owain Glyn Dwr\u0022, sy\u0027n gweld Owain fel math o ragflaenydd i\u0027r mudiad gwladgarol Cymru Fydd.\nyn yr 20g, canodd sawl bardd am Owain Glyn Dŵr. Ceir dwy gerdd nodedig gan Gwenallt, er enghraifft, cerdd i \u0022Neuadd Glyn Dŵr\u0022 yn Sycharth gan John Penry Jones, \u0022Bedd Owain Glyn Dŵr\u0022 gan Euros Bowen, \u0022Breuddwyd Glyn Dŵr\u0022 gan Dewi Emrys James, a cherdd am Senedd-dŷ Owain Glyn Dŵr ym Machynlleth gan Cyril Jones.\n\n\n=== Drama ===\nYmddengys Owain fel cymeriad yn nrama William Shakespeare Henry IV Rhan Un. Mae\u0027r cymeriad Glendower yn ymffrostgar ac yn haeru ei fod yn medru galw ysbrydion, ond ar y llaw arall disgrifir ef fel:\n\n\u0022...worthy gentleman\nExceedingly well-read, and profited\nIn strange concealments, valiant as a lion\nAnd wondrous affable, and as bountiful\nAs mines of India\u0022.\nYsgrifennodd Beriah Gwynfe Evans ei ddrama boblogaidd \u0027Owain Glyndwr\u0027 ar gyfer Eisteddfod Gadeiriol Llanberis 1879. Drama ramantus iawn ydyw, sy\u0027n ddrych i\u0027r cyfuniad o wladgarwch Cymreig a breningarwch Prydeinig sy\u0027n mor nodweddiadol o\u0027r 19g.\n\n\n=== Ffuglen ===\nJohn Cowper Powys – Owen Glendower .\nEdith Pargeter: A Bloody Field by Shrewsbury .\nMalcolm Pryce: A Dragon to Agincourt ISBN 0-86243-684-2.\nJ. G. Williams, Betws Hirfaen . Nofel hanes am y gwrthryfel wedi\u0027i lleoli yn Eifionydd yn bennaf.",
  "imageNames": [
    "Arms_of_Owen_Glyndwr_02949.jpg",
    "Cofeb_Owain_Glyn_Dŵr_Machynlleth.jpg",
    "Corwen-_Owain_Glyndwr_Statue_geograph_6130573_cropped.jpg",
    "Dialogues_de_Pierre_Salmon_-_BNF_Fr23279_f1v_scène_de_dédicace_cropped.jpeg",
    "Glendower_by_A.C.Michael.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": true,
  "start": 1354,
  "end": 1415,
  "categoryId": "milwrol",
  "id": "owain-glyndwr",
  "label": "Owain Glyndŵr"
}