{
  "wikiSummary": "Mae Eryri yn ranbarth mynyddog a pharc cenedlaethol yng nogledd Cymru.\nMae\u0027n gartref i fynyddoedd uchaf Cymru. Yn draddodiadol defnyddir yr enw am fynyddoedd Arfon, gyda\u0027r Wyddfa fel canolbwynt, ac yn cynnwys Glyderau, y Carneddau, Crib Nantlle, Moel Hebog a Moel Siabod. Ers ffurfio Parc Cenedlaethol Eryri, sy\u0027n cynnwys ardaloedd tu allan i\u0027r Eryri draddodiadol, er enghraifft ym Meirionnydd, mae tuedd wedi bod gan rai, yn enwedig o\u0027r tu allan i Gymru, i gyfeirio at y cyfan o ardal y Parc fel \u0022Eryri\u0022 ond mae\u0027r Parc Cenedlaethol dros ddwywaith mwy ei faint na\u0027r Eryri go iawn. Ffiniau\u0027r Eryri draddodiadol, yn fras, yw\u0027r briffordd A487 o Gaernarfon trwy Borthmadog cyn belled a Maentwrog yn y gorllewin a\u0027r de, y briffordd A470 ymlaen i Fetws y Coed yn y de-ddwyrain ac Afon Conwy yn y dwyrain.",
  "wikiArticle": "Mae Eryri yn ranbarth mynyddog a pharc cenedlaethol yng nogledd Cymru.\nMae\u0027n gartref i fynyddoedd uchaf Cymru. Yn draddodiadol defnyddir yr enw am fynyddoedd Arfon, gyda\u0027r Wyddfa fel canolbwynt, ac yn cynnwys Glyderau, y Carneddau, Crib Nantlle, Moel Hebog a Moel Siabod. Ers ffurfio Parc Cenedlaethol Eryri, sy\u0027n cynnwys ardaloedd tu allan i\u0027r Eryri draddodiadol, er enghraifft ym Meirionnydd, mae tuedd wedi bod gan rai, yn enwedig o\u0027r tu allan i Gymru, i gyfeirio at y cyfan o ardal y Parc fel \u0022Eryri\u0022 ond mae\u0027r Parc Cenedlaethol dros ddwywaith mwy ei faint na\u0027r Eryri go iawn. Ffiniau\u0027r Eryri draddodiadol, yn fras, yw\u0027r briffordd A487 o Gaernarfon trwy Borthmadog cyn belled a Maentwrog yn y gorllewin a\u0027r de, y briffordd A470 ymlaen i Fetws y Coed yn y de-ddwyrain ac Afon Conwy yn y dwyrain.\r\n\r\n== Yr enw ==\nDaw\u0027r cyfeiriad cyntaf ysgrifenedig at yr enw yn 1191 fel \u0027Ereri\u0027 ac yna fel \u0027Eryri\u0027 yn y 15g. Defnyddir yr enw yn Brut y Tywysogion sawl gwaith; fel \u0027mynyded Eryri\u0027 lle ymysododd y Sacsoniaid yn 817; fel y lle mwyaf saff i Owain ap Cadwgan gilio ac i amddiffyn yn erbyn byddin Harri I, brenin Lloegr yn 1111; ac fel safle ffoi Llywelyn Fawr yn 1210.\nMae\u0027n gred boblogaidd fod yr enw Eryri yn golygu \u0022Gwlad yr Eryrod\u0022, ond mae Ifor Williams wedi profi mai \u0022Ucheldir\u0022 yw\u0027r ystyr. \u0022Eryrod\u0022 yw lluosog arferol y gair \u0022eryr\u0022; ni cheir enghraifft o\u0027r ffurf \u0027eryri\u0027 am \u0022eryrod\u0022. Mae eryr ac Eryri yn tarddu o\u0027r un gwreiddyn ieithyddol, serch hynny. O\u0027r gwreiddyn Indo-Ewropeaidd -er/-or y daw\u0027r gair Cymraeg eryr a\u0027r gair Groeg oros . Ceir enghraifft o\u0027r gair eryr yn Llyfr Du Caerfyrddin yn yr ystyr \u0022glan \u0022, Codiad tir yw \u0022eryr \u0022 felly, \u0022tir uchel\u0027 neu \u0027ucheldir\u0022.\nDros y canrifoedd mae sawl bardd a llenor wedi mabwysiadu enw barddol sy\u0027n cynnwys y gair Eryri. Yr enghraifft gynharaf yw\u0027r bardd canoloesol Rhys Goch Eryri , a oedd yn frodor o ardal Beddgelert. Yn ddiweddarach cafwyd Dafydd Ddu Eryri yn arddel yr enw.\nEr nad felly y tarddodd yr enw, mae traddodiad a sylwadau gan deithwyr yn awgrymu yr arferai yr Eryr euraid nythu yn Eryri, efallai hyd y 18g.\r\n\r\n== Daearyddiaeth ==\n\n\n=== Hen ddiffiniad o Eryri ===\nDywedodd Gerallt Gymro yn 1188 fod ardal mynyddog Eryri yn codi yn raddol o diroedd meibion Cynan, ac yn ymestyn tua\u0027r gogledd ger Deganwy ac fod copaon Eryri i\u0027w gweld o arfordir Ynys Môn yn cyrraedd y cymylau.\nYn ôl un llyfr daearyddiaeth o 1948 , hen ddifniad ardal mynyddog Eryri oedd y cantrefi Arfon ac Arllechwedd a\u0027r cymydau Nant Conwy ac Eifionydd.\n\n\n=== Tirwedd a mynyddoedd ===\nCanolbwynt Eryri yw copa\u0027r Wyddfa. O\u0027i gwmpas mae chwe chefnen hir. Nodweddir y llethrau sy\u0027n wynebu\u0027r gogledd a\u0027r dwyrain gan glogwynau syrth ond mae\u0027r llethrau sy\u0027n wynebu\u0027r de a\u0027r gorllewin yn tueddu i fod yn llai syrth a chreigiog ac yn fwy agored a glaswelltog. Rhwng y cefnennau mae cymoedd wedi eu llunio yn ystod Oes yr Iâ, rhai ohonynt â llynnoedd ynddynt. Yr uchaf o\u0027r mynyddoedd yw\u0027r Wyddfa ; ymhlith y copaon o\u0027i chwmpas mae Carnedd Ugain , Crib Goch , Y Lliwedd a\u0027r Aran .\nI\u0027r gogledd-ddwyrain o\u0027r Wyddfa, tu draw i Fwlch Llanberis, mae mynyddoedd y Glyderau; y prif gopaon yma yw\u0027r Glyder Fach , Glyder Fawr a Tryfan . I\u0027r gogledd o\u0027r Glyderau, tu draw i Lyn Ogwen a Nant Ffrancon mae prif gadwyn y Carneddau yn ymestyn tua\u0027r gogledd-ddwyrain, gan orffen nepell o\u0027r môr uwchben Abergwyngregyn. Y prif gopaon yn y Carneddau yw Carnedd Llywelyn , Carnedd Dafydd a Pen yr Ole Wen .I\u0027r gorllewin o\u0027r Wyddfa, mae Mynydd Mawr ar ei ben ei hun, a\u0027r ochr arall i bentref Rhyd Ddu mae Crib Nantlle yn ymestyn tua\u0027r de-orllewin. Tua\u0027r de mae Moel Hebog. Tua\u0027r de-ddwyrain, yr ochr draw i Nant Gwynant mae Cnicht, y Moelwyn Mawr a\u0027r Moelwyn Bach, ac i\u0027r dwyrain o\u0027r Wyddfa mae Moel Siabod.\n\n\n=== Daeareg ===\nO ran daeareg, creigiau Ordoficaidd sy\u0027n ffurfio\u0027r rhan fwyaf o\u0027r mynyddoedd, ond daw creigiau Cambriaidd i\u0027r wyneb yn y gogledd-orllewin, i ffurfio mynyddoedd megis Elidir Fawr a Moel Eilio. Gellir gweld olion rhewlifoedd o Oes yr Iâ yn glir mewn llawer man yn Eryri; mae Cwm Idwal yn enghraifft glasurol.\n\n\n=== Glaw ac afonydd ===\nOherwydd uchder y mynyddoedd a\u0027i safle yn agos i\u0027r arfordir gorllewinol, mae Eryri yn cael llawer o law; ac ystyrir Capel Curig er enghraifft yn un o\u0027r mannau gwlypaf ym Mhrydain. Er nad yw\u0027r glaw yn cael ei fesur yn rheolaidd, credir fod y llethrau o gwmpas Llyn Llydaw ar yr Wyddfa yn cael mwy o law fyth, heb fod ymhell o 5000 mm y flwyddyn. Mae nifer o afonydd yn tarddu yn Eryri, yn arbennig Afon Glaslyn, Afon Ogwen ac Afon Llugwy, sy\u0027n llifo i Afon Conwy. Ceir nifer fawr o lynnoedd yn Eryri; y mwyaf ohonynt yw Llyn Padarn , Llyn Cowlyd , Llyn Cwellyn , Llyn Eigiau a Llyn Llydaw .\r\n\r\n== Parc Cenedlaethol Eryri ==\n\nSefydlwyd Parc Cenedlaethol Eryri ar 18 Hydref 1951 yn dilyn Deddf Parciau Cenedlaethol a Mynediad i Gefn Gwlad 1949, fel y trydydd parc cenedlaethol yng Nghymru a Lloegr. Roedd ei ffiniau wedi\u0027u dynodi flwyddyn ynghynt yn dilyn argymhellion Comisiwn y Parc Cenedlaethol lle gwasanaethodd Syr Clough Williams-Ellis fel aelod. Gan mai un o brif feini prawfar gyfer cynnwys tir o fewn y Parc oedd \u0022harddwch golygfaol eithriadol\u0022, roedd rhai ardaloedd trefol wedi eu gwahardd, ac y tu allan i\u0027w ffiniau.\nMae\u0027n un o dri pharc cenedlaethol yng Nghymru . Mae ffiniau\u0027r parc yn cynnwys tua 214,159 hectar , ardal llawer ehangach na\u0027r ardal a adwaenid fel Eryri yn hanesyddol.\nSefydlwyd Awdurdod Parc Cenedlaethol Eryri o dan Ddeddf yr Amgylchedd 1995 a ddaeth yn weithredol ar 1 Ebrill 1996, ac a ddiffinniodd bwrpas y parc, sef:\n\ngwarchod a gwella harddwch naturiol, bywyd gwyllt a threftadaeth ddiwylliannol y Parc; a\nhyrwyddo cyfleoedd i’r cyhoedd ddeall a mwynhau nodweddion arbennig y Parc.\nMae\u0027r tir cyhoeddus a\u0027r tir preifat ill dau o dan reolaeth yr un awdurdod cynllunio.\nYn Nhachwedd 2022, cyhoeddwyd y byddai\u0027r awdurdod yn defnyddio ei enw Cymraeg \u0027Eryri\u0027 yn unig o hyn ymlaen.\n\n\n=== Rheolaeth ===\nMae\u0027r parc o dan rheolaeth Awdurdod Parc Cenedlaethol Eryri, sy\u0027n cael ei redeg gan bwyllgor sy\u0027n cynnwys cynrychiolwyr o\u0027r awdurdodau lleol, sef Cyngor Gwynedd a Chyngor Sir Conwy, a Llywodraeth Cymru. Mae\u0027r tir cyhoeddus a\u0027r tir preifat ill dau o dan reolaeth yr un awdurdod cynllunio. Rhennir perchnogaeth tir yn y parc fel a ganlyn:\nRheolir yr Awdurdod gan 18 Aelod, 9 Cynghorydd Lleol a benodir gan Gyngor Gwynedd, 3 Cynghorydd Lleol a benodir gan Gyngor Bwrdeistref Sirol Conwy, a 6 aelod a benodir gan Lywodraeth Cymru.\nYn 2014 roedd 93% o\u0027i staff, 144 allan o gyfanswm o 155, yn medru siarad Cymraeg.\nYn y 1970au cynnar, yn dilyn ad-drefniant Llywodraeth Leol, daeth Parc Cenedlaethol Eryri yn adran o Gyngor Sir Gwynedd. Ym 1974 daeth cyfrifoldeb am gynllunio o dan adain y Parc Cenedlaethol. Prynodd y Parc Cenedlaethol dir mewn sawl safle poblogaidd er mwyn cynnig gwasanaethau i ymwelwyr gan gynnwys: Llyn Cwellyn, Llynnau Mymbyr, Betws y Coed, Beddgelert a Nant Peris, ac agorwyd Plas Tan y Bwlch fel canolfan astudio yn 1975. Lansiwyd cynllun bws Sherpa’r Wyddfa i ddatrys problemau parcio mewn safleoedd poblogaidd drwy gludo cerddwyr.\n\nGyda chyllideb o oddeutu 6 miliwn, daw 75% gan Lywodraeth Cymru a\u0027r gweddill trwy ardollau siroedd perthnasol.\r\n\r\n== Bywyd Gwyllt ==\n\nEr bod tirwedd Eryri yn ymddangos yn wyllt, mae dylanwad dyn yn drwm arno. Yn wreiddiol roedd coedwigoedd yn tyfu ar y rhan fwyaf o\u0027r llethrau, heblaw y llethrau uchaf un. Y rhywogaethau nodweddiadol oedd derw, ynn, bedw, cyll a chriafolen. Erbyn hyn mae\u0027r coed wedi diflannu oddi ar lawer o\u0027r llethrau, ac mae pori gan ddefaid yn eu cadw yn laswelltir. Plannwyd llawer o goed bytholwyrdd yn y cyfnod ar ôl yr Ail Ryfel Byd, yn arbennig Coedwig Gwydyr ar lethrau dwyreiniol Eryri o gwmpas Betws y Coed a Choedwig Beddgelert.\nAr y clogwyni lle na all y defaid gyrraedd, er enghraifft ar Glogwyn Du\u0027r Arddu ar yr Wyddfa a chlogwyni Cwm Idwal, ceir amrywiaeth ddiddorol o blanhigion arctig-alpaidd, rhai ohonynt yn eithriadol o brin. Yr enwocaf o\u0027r rhain yw Lili\u0027r Wyddfa ; Eryri yw\u0027r unig fan ym Mhrydain lle ceir y planhigyn yma. Dim ond yn Eryri y ceir Chwilen yr Wyddfa .\n\nHeblaw gor-bori gan ddefaid, un o\u0027r prif broblemau yw tŵf Rhododendron ponticum mewn rhai rhannau o Eryri, er enghraifft yn ardal Beddgelert. Mae\u0027r planhigyn yma yn medru lledaenu\u0027n gyflym, ac yn cael effaith andwyol ar y llystyfiant naturiol. Erbyn hyn mae ymdrechion i\u0027w ddifa wedi lleihau\u0027r broblem rywfaint. Gall y nifer fawr o gerddwyr a dringwyr hefyd greu problemau yn y mannau mwyaf poblogaidd.\nY brithyll yw\u0027r pysgodyn mwyaf cyffredin yn afonydd a llynnoedd Eryri, ond yn ambell un o\u0027r llynnoedd dyfnaf ceir y Torgoch. Ymhlith adar nodweddiadol Eryri mae Tinwen y garn, Corhedydd y waun, Mwyalchen y mynydd, y Frân goesgoch a\u0027r Gigfran; mae nifer dda o barau o\u0027r Hebog tramor yn nythu ar y clogwyni yma hefyd.fb\nY prinnaf o famaliaid Eryri yw\u0027r Bela , yn wir, er fod cryn nifer o bobl wedi adrodd eu bod wedi gweld y Bela yn Eryri yn y blynyddoedd diwethaf, nid oes neb wedi llwyddo i gael llun i brofi hyn. Gellir gweld geifr gwylltion yn aml ar y llechweddau; mae\u0027r rhain yn ddisgynyddion geifr wedi dianc o ffermydd. Mae rhannau o Eryri yn gartref i\u0027r merlyn mynydd Cymreig; maent yn arbennig o niferus ar lethrau gogleddol y Carneddau, lle ceir rhwng 200 a 300.\r\n\r\n== Hanes a diwylliant ==\n\nYn ystod y cyfnod Neolithig, ymddengys mai o gwmpas godreuon Eryri yr oedd presenoldeb dynol. Ymysg yr olion o\u0027r cyfnod hwn mae siambr gladdu Maen y Bardd ar ochr ddwyreiniol y Carneddau, ac olion tŷ yn Llandegai ger Bangor. Yn ystod rhan gyntaf Oes yr Efydd roedd y tywydd yn gynhesach ac yn sychach, gan wneud y tir uchel yn fwy atyniadol. Ceir llawer o weddillion tai a chladdfeydd o\u0027r cyfnod hwn, er enghraifft yng Ngwm Anafon uwchben Abergwyngregyn ac yng Nghwm Ffrydlas uwchben Bethesda. Yn y cyfnod yma y codwyd y meini hirion megis y rhai ym Mwlch y Ddeufaen, ac y codwyd llawer o\u0027r carneddi a welir ar fynyddoedd a bryniau Eryri.\nNid oes cymaint o olion o Oes yr Haearn ar y tir uchel; nid oedd y tywydd mor ffafriol erbyn hyn ac roedd mawnog yn dechrau ffurfio. Ceir cryn nifer o fryngeiri o gwmpas godreuon Eryri, er enghraifft Braich-y-Dinas ger Penmaenmawr a Pen y Gaer gerllaw Llanbedr-y-cennin. Adeiladodd y Rhufeiniaid hefyd nifer o geiri i warchod gororau Eryri, megis Segontium, Caerhun a Thomen y Mur.\n\n\u0022Cadernid Eryri\u0022 oedd calon teyrnas Gwynedd. Yn 1230 mabwysiadodd Llywelyn Fawr y teitl \u0022Tywysog Gwynedd ac Arglwydd Eryri\u0022 a defnyddiwyd teitl cyffelyb gan Llywelyn Ein Llyw Olaf yn 1258. Codwyd cestyll oddi amgylch Eryri gan y tywysogion, yn Nolwyddelan, Cricieth a Dolbadarn.\nYn niogelwch y mynyddoedd megid gwartheg y tywysogion mewn porfeydd brenhinol arbennig er mwyn cael stôr o gig i\u0027r fyddin pan fo rhaid. Ceir un o\u0027r cyfeiriadau cynharaf at Eryri ym marddoniaeth Gymraeg yn y cyd-destun hyn, ym marwnad y bardd Meilyr Brydydd i Gruffudd ap Cynan: \u0022Dybu brenin Lloegr yn lluyddawg, / Cyd doeth ef nid aeth yn warthegawg; / Ni yn Eryri yn rheïawg, / Ni thorres i bawr a fu breiddiawg\u0022 .\nAr ôl cwymp y tywysogion parhaodd enw a thraddodiadau Eryri yn fyw dros y canrifoedd.\r\n\r\n== Economi ==\n\nAmaethyddiaeth a thwristiaeth yw\u0027r diwydiannau pwysicaf yn Eryri ar hyn o bryd. Mae amaethyddiaeth wedi bod yn bwysig ers canrifoedd, ond gan nad yw\u0027r rhan fwyaf o Eryri yn addas ar gyfer tyfu cnydau, canolbwyntir ar gadw da byw. Defaid yw\u0027r mwyaf cyffredin o\u0027r rhain bellach, ond yn y gorffennol roedd gwartheg yn fwy niferus, yn arbennig y Gwartheg Duon Cymreig, sydd wedi eu datblygu i fedru byw ar y llechweddau. Ar un adeg arferid mynd a\u0027r da byw i fyny i\u0027r \u0022hafod\u0022 ar y llechweddau uchaf i bori yn ystod yn haf, ac yna eu symud i lawr i\u0027r \u0022hendre\u0022 ar dir is dros y gaeaf. Yn y 18g byddai\u0027r porthmyn yn eu gyrru i Loegr i\u0027w gwerthu.\nO ddiwedd y 18g hyd ddechrau\u0027r 20g roedd y diwydiant llechi yn bwysig iawn yn Eryri, a cheid rhai o chwareli llechi mwyaf y byd ar lechweddau isaf rhai o fynyddoedd Eryri, megis Chwarel y Penrhyn a Chwarel Dinorwig. Ychydig iawn o bobl sy\u0027n cael eu cyflogi yn y diwydiant yma bellach, ond mae tomennydd sbwriel y chwareli yn parhau yn nodweddiadol o\u0027r ardal. Bu nifer o fwyngloddiau copr yn Eryri hefyd yn y cyfnod yma.\r\n\r\n== Dringo mynyddoedd ==\nMae Eryri yn ardal boblogaidd iawn ar gyfer mynydda. I ddringo\u0027r Wyddfa y llwybr mwyaf poblogaidd yw Llwybr Pen-y-Gwryd, sy\u0027n dechrau o westy Gorffwysfa, Pen-y-pas, uwchben Bwlch Llanberis. Mae\u0027n hen lwybr mwynwyr sydd yn mynd heibio Llyn Llydaw a\u0027r Glaslyn ac wedyn yn dringo\u0027n igam-ogam i fyny Bwlch Glas. Y llwybr anoddaf i ddringo\u0027r Wyddfa yw Pedol yr Wyddfa, sy\u0027n golygu dringo Crib Goch gyntaf, yna copa\u0027r Wyddfa ei hun cyn dychwelyd i Ben-y-pas dros gopa Lliwedd. Mae\u0027r Glyderau hefyd yn boblogaidd iawn, yn enwedig Tryfan, yr unig fynydd yng Nghymru, fe ddywedir, lle mae\u0027n rhaid defnyddio\u0027r dwylo yn ogystal a\u0027r traed i gyrraedd y copa. Llwybr poblogaidd arall yn y Glyderau yw\u0027r llwybr heibio Llyn Idwal a\u0027r Twll Du i ben y Glyder Fach a\u0027r Glyder Fawr. Ceir llawer llai o ddringwyr ar y rhannau llai adnabyddus o Eryri, megis Crib Nantlle. Mae poblogrwydd rhai o\u0027r llwybrau wedi creu problem erydu, ac mae Awdurdod Parc Cenedlaethol Eryri wedi gwneud cryn dipyn o waith i sefydlogi rhai ohonynt.\nMae clogwynnau Eryri wedi chwarae rôl bwysig yn hanes dringo mynyddoedd Prydain. Ymhlith y cyntaf i ddringo mynydd yn yr ardal oedd y Parchedig Peter Williams a\u0027r Parchedig William Bingley oedd yn arfer dringo Clogwyn Du\u0027r Arddu wrth chwilio am blanhigion arctig-alpaidd ym 1798. Lliwedd oedd pwnc y llawlyfr dringo cyntaf i\u0027w gyhoeddi ym Mhrydain yn 1909, The climbs on Lliwedd gan J. M. A. Thomson ac A. W. Andrews. Ers hynny mae Eryri wedi parhau\u0027n gyrchfan boblogaidd i ddringwyr; er enghraifft yn Eryri y bu\u0027r tîm a ddringodd Mynydd Everest am y tro cyntaf yn 1952 yn ymarfer cyn yr ymgyrch.\r\n\r\n== Darllen Pellach ==\nH. C. Carr a G. A. Lister, The Mountains of Snowdonia F. J. North , Snowdonia Ioan Bowen Rees, Dringo Mynyddoedd Cymru W. M. Condry, The Snowdonia National Park, Cyfres New Naturalist Amory Lovins, Eryri, the Mountains of Longing Brinley Roberts, The geology of Snowdonia and Llŷn: an Outline and Field Guide Geraint Roberts, The Lakes of Eryri Dewi Tomos, Eryri, Cyfres Broydd Cymru 16 == Gweler hefyd ==\nBwthyn Ogwen\nY Carneddau\nY Glyderau\nMerlyn mynydd Cymreig\nRhestr mynyddoedd Cymru\nYr Wyddfa\nRhestr o ganeuon a recordiwyd gan Trio",
  "imageNames": [
    "Badgernet_Snowdonia_walks_1.JPG",
    "Eryri_National_Park_logo.png",
    "Eryri_meaning_sign.jpg",
    "Eryri_mountains_reflection_50879310288.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1951,
  "categoryId": "lleoedd",
  "id": "parc-eryri",
  "label": "Eryri"
}