{
  "wikiSummary": "Ardal yn nhalaith Chubut, Patagonia, yr Ariannin lle ymfudodd llawer o Gymry yng nghanol y bedwaredd ganrif ar bymtheg yw\u0027r Wladfa . Mae cymunedau Cymreig mewn gwledydd eraill hefyd, megis Pennsylvania ac ardaloedd eraill UDA neu Awstralia, ond mae\u0027r diwylliant a\u0027r iaith Gymraeg yn amlycaf yn y Wladfa.\nCraidd y Wladfa yw Dyffryn Camwy, tua 60 km i\u0027r de o Borth Madryn. Afon Camwy yw prif ffynhonnell ddŵr yr ardal. Ystyr yr enw gwreiddiol Chupat yn iaith y Tehuelches brodorol yw \u0027Tryloyw\u0027. Y prif drefi yw Rawson, prifddinas y dalaith ers 1884, Gaiman, y dref fwyaf Cymreig yn yr ardal, Dolavon a Threlew. Tua 500 milltir i\u0027r gorllewin o Ddyffryn Camwy, yng Nghwm Hyfryd wrth draed yr Andes ceir Esquel a Threvelin, dwy dref arall a sefydlwyd gan y Cymry.\nHeddiw, mae tua 150,000 o bobl yn byw yn yr ardal a thua 72,685 ohonynt yn ddisgynyddion i\u0027r Cymry. Mae tua 5,000 ohonynt yn siarad Cymraeg a channoedd yn dysgu\u0027r iaith. Yn ôl Cathrin Williams, sydd wedi ysgrifennu llawer am y Wladfa, \u0022Bellach mae pobl ifanc yn hapus i fy nghyfarch yn Gymraeg ar y stryd ac yn gallu cynnal sgwrs ac iddi ddyfnder. Diflannodd yr hen gywilydd ac yn ei le daeth balchder.\u0022",
  "wikiArticle": "Ardal yn nhalaith Chubut, Patagonia, yr Ariannin lle ymfudodd llawer o Gymry yng nghanol y bedwaredd ganrif ar bymtheg yw\u0027r Wladfa . Mae cymunedau Cymreig mewn gwledydd eraill hefyd, megis Pennsylvania ac ardaloedd eraill UDA neu Awstralia, ond mae\u0027r diwylliant a\u0027r iaith Gymraeg yn amlycaf yn y Wladfa.\nCraidd y Wladfa yw Dyffryn Camwy, tua 60 km i\u0027r de o Borth Madryn. Afon Camwy yw prif ffynhonnell ddŵr yr ardal. Ystyr yr enw gwreiddiol Chupat yn iaith y Tehuelches brodorol yw \u0027Tryloyw\u0027. Y prif drefi yw Rawson, prifddinas y dalaith ers 1884, Gaiman, y dref fwyaf Cymreig yn yr ardal, Dolavon a Threlew. Tua 500 milltir i\u0027r gorllewin o Ddyffryn Camwy, yng Nghwm Hyfryd wrth draed yr Andes ceir Esquel a Threvelin, dwy dref arall a sefydlwyd gan y Cymry.\nHeddiw, mae tua 150,000 o bobl yn byw yn yr ardal a thua 72,685 ohonynt yn ddisgynyddion i\u0027r Cymry. Mae tua 5,000 ohonynt yn siarad Cymraeg a channoedd yn dysgu\u0027r iaith. Yn ôl Cathrin Williams, sydd wedi ysgrifennu llawer am y Wladfa, \u0022Bellach mae pobl ifanc yn hapus i fy nghyfarch yn Gymraeg ar y stryd ac yn gallu cynnal sgwrs ac iddi ddyfnder. Diflannodd yr hen gywilydd ac yn ei le daeth balchder.\u0022\r\n\r\n== Datblygu\u0027r syniad ==\nErbyn y 1840au, roedd llawer o ymfudo o Gymru, yn bennaf i\u0027r Unol Daleithiau. Aeth Michael D. Jones i fyw yn yr Unol Daleithiau am gyfnod, i astudio gwerinlywodraeth a chaethwasiaeth, a daeth yn weinidog yn Cincinnati, Ohio ym 1848. Gwelodd ef fod mewnfudwyr Cymreig yn colli eu hiaith a\u0027u diwylliant mewn ychydig iawn o amser ar ôl dod i\u0027r Unol Daleithiau a byw mewn cymunedau lleol, yn fwy felly na mewnfudwyr o wledydd eraill. Awgrymodd Michael D. Jones y dylid sefydlu \u0022Gwladfa\u0022 Gymreig mewn rhan arall o\u0027r byd, fel y gellid cadw iaith a diwylliant y Cymry.\nBu nifer o ymdrechion i sefydlu gwladfeydd o\u0027r fath yn yr Unol Daleithiau, ac un yn Ne America pan sefydlodd Thomas Benbow Phillips wladfa Gymreig yn Rio Grande do Sul, Brasil yn 1851. Ymhen dwy flynedd roedd tua chant o Gymry yno, ond erbyn diwedd 1854, roedd y rhan fwyaf o\u0027r sefydlwyr wedi gwasgaru; yn ôl Phillips, yn bennaf oherwydd i lawer ohonynt, oedd yn gyn-lowyr, symud i weithio i weithfeydd glo ym Mrasil.\nYn 1856, ffurfiwyd cymdeithas yn Camptonville, Califfornia, i geisio sefydlu gwladfa Gymreig. Yma, i bob golwg, y soniwyd gyntaf am Patagonia fel lleoliad posibl i\u0027r Wladfa yma. Gyrrwyd llythyron i bapurau Cymraeg i ofyn am gefnogaeth, a threfnodd Michael D. Jones gyfarfod cyhoeddus yn Y Bala, lle ffurfiwyd cymdeithas arall. Dilynwyd hon gan gymdeithasau eraill yng Nghymru, gyda\u0027r gymdeithas yng Nghaernarfon yn arbennig o bwysig.\nUn o\u0027r arweinwyr pwysicaf yn yr Unol Daleithiau oedd Edwin Cynrig Roberts . Roedd ef yn enedigol o bentref Cilcain yn Sir Fflint, ond ymfudodd gyda\u0027i deulu i Wisconsin yn 1847. Daeth yn amlwg yn y mudiad gwladfaol, a phan fethwyd trefnu i garfan o Gymry o America deithio i Batagonia yn 1859, bwriadodd ymfudo yno ar ei ben ei hun. Fe\u0027i perswadiwyd i deithio i Gymru i chwilio am eraill a oedd yn barod i ymfudo i Batagonia, a daeth i gysylltiad â Michael D. Jones. Teithiodd drwy Gymru yn siarad ar y pwnc, a daeth yn rhan o gymdeithas o\u0027r enw Cymdeithas Wladychol Lerpwl oedd wedi ei ffurfio yn Lerpwl yn 1861 i drefnu\u0027r fenter. Ymhlith yr arweinwyr roedd Lewis Jones a Hugh Hughes .\nCysylltodd y Gymdeithas â chynrychiolydd yr Ariannin yn Lerpwl, Samuel R. Phibbs. Yn unol â\u0027i gyngor ef, sefydlwyd bwrdd o ymddiriedolwyr i gysylltu â llywodraeth yr Ariannin, yn cynnwys Michael D. Jones a\u0027r Capten Love Jones-Parry o Fadryn. Daeth y Gymdeithas yn \u0022Bwyllgor Cenedlaethol\u0022, a chyhoeddodd lyfryn Llawlyfr y Wladychfa Gymreig , a chyfnodolyn pythefnosol Y Ddraig Goch.\r\n\r\n== Paratoi ar gyfer yr ymfudo ==\n\nYn 1862 aeth Lewis Jones a\u0027r Capten Love Jones-Parry o Fadryn i Buenos Aires ar ran y Pwyllgor, lle buont yn trafod telerau gyda swyddogion y llywodraeth. Wedi peth trafod, aethant ymlaen i Batagonia i weld a oedd yr ardal yn addas ar gyfer sefydlwyr Cymreig. Ariannwyd hyn yn bennaf gan Jones-Parry, a dalodd o leiaf £750 o\u0027i boced ei hun. Cyraeddasant mewn llong fechan o’r enw \u0022Candelaria\u0022, a gyrrwyd hwy gan storm i fae a enwyd ganddynt yn \u0022Borth Madryn\u0022 ar ôl cartref Jones-Parry. Heddiw gelwir y bae yn Bae Newydd a\u0027r dref a dyfodd gerllaw’r man y glaniodd y ddau yn Puerto Madryn. Dychwelodd y ddau i Buenos Aires ar gyfer trafodaethau pellach gyda\u0027r llywodraeth. Nid oedd llywodraeth Ariannin yn barod i ystyried annibyniaeth i\u0027r gwladfaoedd Cymreig, ond cytunwyd y byddai\u0027n cael ei chydnabod yn swyddogol fel talaith o\u0027r Ariannin unwaith yr oedd ei phoblogaeth yn cyrraedd 20,000. Gwnaed cytundeb ar 25 Mawrth 1863. Dychwelodd Lewis Jones a Love Jones-Parry i Gymru gydag adroddiad ffafriol dros ben - rhy ffafriol fel y gwelwyd yn nes ymlaen.\nYm mis Medi 1863, rhoddwyd gwybod i\u0027r Pwyllgor fod Cyngres Ariannin wedi gwrthod cadarnhau\u0027r cytundeb. Roeddynt yn ofni y byddai gwledydd Prydain yn defnyddio presenoldeb y gwladfaoedd fel esgus i gipio Patagonia. Penderfynodd y Pwyllgor wneud cais am dir ar yr un telerau ag ymfudwyr cyffredin, a gyrrwyd Samuel Phibbs i Buenos Aires i drafod cytundeb newydd â\u0027r llywodraeth. Yn Hydref 1864, derbyniodd y Pwyllgor lythyr oddi wrth Guillermo Rawson, Gweinidog y Fewnwlad, yn cynnig 25 cuadra o dir yn Nyffryn Camwy i bob teulu.\nAr 12 Mawrth 1865, gadawodd Edwin Cynrig Roberts a Lewis Jones a\u0027i wraig Ellen am Buenos Aires ar y stemar Córdoba. Erbyn iddynt gyrraedd Buenos Aires, roedd yr Ariannin mewn rhyfel yn erbyn Paragwái, ac nid oedd llawer o gymorth i\u0027w gael. Gyda chymorth Thomas Duguid, llwyddwyd i gael dwy long, y Juno a\u0027r Mary Ellen. Hwyliasant tua\u0027r de, a chyrraedd tref fechan Patagones, y man mwyaf deheuol lle\u0027r oedd cymuned Ewropeaidd, ar 24 Mai. Casglasant anifeiliaid, bwyd a nwyddau yn barod i\u0027w gyrru i\u0027r Guolfo Nuevo ar gyfer yr ymfudwyr. Dychwelodd Lewis Jones i Batagones i gasglu rhagor o nwyddau, gan adael Edwin Roberts yno gyda nifer o weision i warchod y gweddill. Cafodd Edwin Roberts rai problemau, gan gael ei adael ar waelod ffynnon am ddwy noson gan y gweision, nes i un ohonynt ddychwelyd i\u0027w achub.\r\n\r\n== Y Mimosa ==\n\nAr yr 28 Mai, 1865 gadawodd y llong Mimosa borthladd Lerpwl am Batagonia, gyda thua 160 o ymfudwyr ar ei bwrdd. Ceir rhestr lawn o\u0027r teithwyr yn yr erthygl ar y Mimosa. Deuai cryn nifer ohonynt o ardaloedd diwydiannol Aberpennar ac Aberdâr, efallai oherwydd dylanwad y Parchedig Abraham Mathews, gweinidog o Aberdâr oedd yn un o\u0027r arweinwyr. Roedd nifer o lowyr a chwarelwyr, ysgolfeistr, adeiladwr, a meddyg, ond dim ond ychydig iawn o ffermwyr.\nCyrhaeddodd y llong y Bae Newydd ger Porth Madryn ar 28 Gorffennaf, ac roedd Lewis Jones ac Edwin Cynrig Roberts yno yn barod i\u0027w cyfarfod. Mae traddodiad iddynt lochesu yn yr ogofâu ar lan y môr yn Puerto Madryn, ond ymddengys hyn yn annhebygol.\n\nRoedd taith o 37 milltir o\u0027r man lle glaniodd yr ymfudwyr i Ddyffryn Camwy, dros dir anial. Gyrrwyd tair mintai o\u0027r dynion ieuanc i baratoi\u0027r ffordd, a gadawodd y fintai gyntaf dan arweiniad Edwin Cynrig Roberts ar 1 Awst. Bu\u0027r daith yn un anodd iawn, ond llwyddasant i gyrraedd y dyffryn ac ymsefydlu mewn hen amddiffynfa a alwasant wrth yr enw \u0022Caer Antur\u0022. Roedd Lewis Jones wedi dychwelyd i Batagones i geisio mwy o nwyddau, a dychwelodd gyda dwy long, y Mary Ellen a\u0027r Rio Negro, oedd yn cludo catrawd o filwyr i drosglwyddo\u0027r tir i\u0027r ymfudwyr. Cariwyd tua hanner y mamau a\u0027r plant i Ddyffryn Camwy yn y Mary Ellen; mordaith a droes yn un enbyd oherwydd storm. Dychwelodd y llong am y gweddill, a chafwyd mordaith well y tro yma.\nWedi rhannu\u0027r tir yn ffermydd, cynhaliwyd seremoni i drosglwyddo\u0027r tiroedd i\u0027r Cymry. Ail-enwyd Caer Antur yn Pueblo de Rawson, neu \u0022Trerawson\u0022 yn fersiwn y Cymry, ar ôl Guillermo Rawson; daeth yn ddinas Rawson, prifddinas talaith Chubut heddiw.\r\n\r\n== Blynyddoedd cynnar 1866–1888 ==\n\nPlannwyd cnydau, ond methodd y cynhaeaf oherwydd diffyg glaw. Bu cweryl pan gwynodd rhai o\u0027r fintai nad oedd y wlad mor addas ag yr oedd Lewis Jones wedi ei adrodd, a symudodd yntau i Buenos Aires i weithio fel argraffydd am gyfnod. Ni ddaeth y gwladfaoedd i gysylltiad â\u0027r brodorion lleol hyd 19 Ebrill 1866 pan gyrhaeddodd y pennaeth Francisco a\u0027i wraig Rawson a dod ar draws gwledd briodas ddwbl – Edwin Cynrig Roberts ag Ann Jones, a\u0027i brawd hi, Richard Jones Glyn Du â Hannah Davies. Yn ystod Gorffennaf cyrhaeddodd dau lwyth, sef Tehuelches deheuol y \u0027cacique\u0027 Gallach a Tehuelches Gorllewinol y \u0022cacique\u0022 Chiquichano. Dysgasant i\u0027r Cymry sut i hela yn null y brodorion, a bu hyn yn gymorth mawr iddynt gael digon i\u0027w fwyta. Gydag ychydig eithriadau, datblygodd cysylltiadau arbennig o dda rhwng y Cymry a\u0027r Tehuelche.\nMethodd y cynhaeaf eto yn nechrau 1867, a phenderfynodd nifer o\u0027r ymfudwyr symud i ran arall o\u0027r Ariannin. Pan glywodd Lewis Jones am hyn, dychwelodd i\u0027r Wladfa. Roedd wedi cael addewidion am gymorth gan lywodraeth yr Ariannin, a llwyddodd i ddarbwyllo\u0027r mwyafrif ohonynt i aros am flwyddyn arall. Ym mis Tachwedd yr un flwyddyn, cafodd Rachel Jenkins, gwraig Aaron Jenkins, y syniad o dorri camlesi i ddod a dŵr o Afon Camwy i ddyfrhau\u0027r tir. Dyna yw\u0027r chwedl, ond y gwir yw, gwyddai\u0027r arloeswyr am yr angen i ddyfrhau ers cyn gadael Cymru, a chafwyd sawl arbrawf llwyddiannus yn ystod 1866, fel yr edrydd John Jones yn ei lythyrau. Cyfraniad mawr Aaron a Rachel Jenkins oedd darganfod bod y tir du , sef y mwyafrif o dir dyffryn Camwy, yn ffrwythlon dim ond iddo gael ei ddyfrhau. Cafwyd cynhaeaf llwyddiannus, a gwelwyd mai hau a dyfrhau\u0027r tir du oedd yr allwedd i ddatblygiad y Wladfa. Yn Chwefror 1868 collwyd y llong Denby, gyda llawer o ddynion ifainc y Wladfa arni. Sefydlwyd Gaiman yn 1874 ar lannau Afon Camwy.\nYm 1885, sefydlwyd cwmni cydweithredol y Compañía Mercantil de Chubut, a fu\u0027n rhan bwysig yn natblygiad y Wladfa. Mae\u0027n debyg mai\u0027r cwmni yma oedd y cwmni cydweithredol cyntaf o\u0027i fath yn yr Ariannin.\nRoedd aber Afon Camwy yn anodd iawn i longau fynd iddi, gan nad oedd llawer o ddyfnder a\u0027r sianel yn newid yn barhaus. Roedd angorfa llawer gwell ym Mhorth Madryn, a phenderfynwyd fod angen rheilffordd i gysylltu rhan isaf Diffryn Camwy a Phorth Madryn. Yn 1884, awdurdododd Cyngres Ariannin adeiladu rheilffordd y Ferrocarril Central del Chubut gan gwmni Lewis Jones y Cia. Roedd yn anodd codi digon o arian yn lleol, felly aeth Lewis Jones i Brydain i chwilio am arian, a chafodd gymorth y peiriannydd Asahel P. Bell. Dechreuodd y gwaith ar y rheilffordd yn 1886, gyda chymorth 465 o ymfudwyr Cymreig eraill a gyrhaeddodd ar y stemar Vesta. Tyfodd tref ym mhen y rheilffordd, a galwyd hi ar ôl Lewis Jones: Trelew. Tyfodd Trelew yn gyflym, ac yn 1888 daeth yn bencadlys y Compañía Mercantil del Chubut.\nRoedd yn awr yn bosibl danfon cynnyrch yr ardal i Buenos Aires. Estynnwyd y rheilffordd hyd at Gaiman ym 1909 ac wedi hynny hyd at Ddôl y Plu.\r\n\r\n== I gyfeiriad yr Andes: Cwm Hyfryd 1883–1909 ==\nErbyn hyn roedd y cyfan o\u0027r tir addas yn Nyffryn Camwy eisoes yn cael ei ffermio, a dechreuodd y Cymry fforio tua\u0027r gorllewin i gyfeiriad yr Andes. Heblaw\u0027r gobaith o ddarganfod mwy o dir amaethyddol, roedd gobaith o ddarganfod aur. Daeth John Daniel Evans yn amlwg fel un oedd yn awyddus i fforio’r Paith. Ym mis Tachwedd  1883 arweiniodd grŵp tua\u0027r Andes. Ar y ffordd, daethant ar draws mintai o filwyr yn dwyn carcharorion Tehuelche i Valcheta, rhan o un o ymgyrchoedd olaf Concwest yr Anialwch. Penderfynodd rhai o\u0027r grŵp droi yn ôl, ond aeth pedwar yn eu blaenau dan arweiniad John Evans. Erbyn diwedd Chwefror 1884, roeddynt wedi cyrraedd Afon Gualjaina, ac yno roedd tri aelod o\u0027r llwyth oedd dan arweiniad y cacique Foyel. Roedd un o\u0027r tri, Juan Salvo, yn eu hadnabod, a dywedodd ei fod yn amau eu bod yn ysbïo dros y fyddin, Ceisiodd ei harwain at  Foyel, a phan wrthodasant, datblygodd cweryl. Penderfynodd y pedwar dychwelyd i ran isaf Dyffryn Camwy, 600 km i ffwrdd, gyda rhyfelwyr Foyel yn ei dilyn. Ar 4 Mawrth ymosodwyd arnynt, a lladdwyd tri chydymaith Evans. Anelodd Evans, ar gefn ei geffyl Malacara, tua dibyn serth, a llamodd y ceffyl i lawr y dibyn ac i fyny\u0027r ochr arall. Ni feiddiai\u0027r un o\u0027r ymosodwyr geisio ei ddilyn, a llwyddodd John Evans i ddychwelyd i\u0027r Wladfa yn ddiogel. Cafodd y man lle bu\u0027r ymosodiad yr enw Dyffryn y Merthyron .\nYn 1884 penodwyd Luis Jorge Fontana yn llywodraethwr cyntaf tiriogaeth newydd Chubut. Gofynnodd y Cymry iddo am ganiatâd i fynd ar deithiau i gyfeiriad yr Andes i chwilio am dir ffrwythlon newydd, gan fod y cyfan o\u0027r tir addas yn Nyffryn Camwy eisoes yn cael ei ffermio. Penderfynodd Fontana fynd gyda hwy, ac yn 1885 arweiniodd daith cwmni a elwid y Rifleros del Chubut, oedd yn cynnwys nifer o Gymry o\u0027r Wladfa, John Daniel Evans yn eu plith, i fforio rhan uchaf Dyffryn Camwy i gyfeiriad yr Andes. Ar y daith yma y cafwyd hyd i\u0027r diriogaeth a alwyd yn valle 16 de Octubre, neu Cwm Hyfryd i\u0027r Cymry. Roedd yn amlwg yn ardal ffrwythlon, a threfnwyd i wladychwyr Cymreig symud yno o ran isaf Dyffryn Camwy. Ym mis Hydref 1891 mudodd John Evans a’i deulu i Gwm Hyfryd ac adeiladodd felin yno, a’r felin hon a roes yr enw Trefelin i’r dref.\nPan gododd cynnen rhwng yr Ariannin a Tsile oherwydd bod y ddwy wlad yn hawlio sofraniaeth dros yr ardal, gwahoddwyd y Deyrnas Gyfunol i gyflafareddu. Y gŵr a benodwyd i wneud y gwaith oedd Sir Thomas Holdich, a benderfynodd gynnal pleidlais i setlo\u0027r mater 30 Ebrill, 1902. Er bod Tsile yn cynnig dwywaith cymaint o dir iddynt, dewisodd mwyafrif llethol y Gwladfaoedd aros o dan faner yr Ariannin, yn bennaf oherwydd nad oeddent am osod ffin rhyngddynt eu hunain a\u0027u teuluoedd yn Nyffryn Camwy. Yn ddiweddarach sefydlwyd tref Esquel.\nTua dechrau\u0027r 20g symudodd Llwyd ap Iwan, mab Michael D. Jones, a\u0027i deulu i Gwm Hyfryd . Roedd yn gyfrifol am gangen Rhyd y Pysgod o\u0027r  Compañía Mercantil  del Chubut, tua 30 km o Esquel. Ar 29 Rhagfyr 1909, daeth dau ysbeiliwr Americanaidd o\u0027r enw Wilson ac Evans, a saethwyd Llwyd ap Iwan yn farw wrth iddynt geisio dwyn arian oddi yno. Cred rhai awduron mai Butch Cassidy a\u0027r Sundance Kid oedd y ddau yma, ond ymddengys fod y ddau yma eisoes wedi eu lladd ym Molifia cyn dyddiad y llofruddiaeth.\r\n\r\n== Anawsterau yn Nyffryn Camwy 1899–1916 ==\nDioddefodd rhan isaf Dyffryn Camwy oherwydd effeithiau nifer o lifogydd difrifol yn y 1890au a\u0027r 1900au, gan beri difrod difrifol yn nhref Rawson ac i raddau yn Gaiman, er na effeithiwyd Trelew. Bu anghydfod rhwng y Cymry a\u0027r llywodraeth, oedd yn mynnu bod pob dyn o oed milwrol yn drilio bob dydd Sul. Nid oedd y Cymry yn gwrthod drilio fel y cyfryw, ond yr oeddynt yn amharod i wneud ar y Sul. Carcharwyd rhai ohonynt, ond yn y diwedd cafwyd cyfaddawd wedi i\u0027r Arlywydd  Julio Argentino Roca gymryd diddordeb yn y mater.\nProblem arall oedd nad oedd unrhyw dir addas i\u0027w ffermio yn weddill i\u0027w rannu i newydd-ddyfodiaid. Hyn yn anad dim, efallai, a barodd i 234 adael y Wladfa am Lerpwl ar y llong Orissa ar 14 Mai 1902. Aeth 208 ohonynt ymlaen i Ganada, gan gyrraedd Saskatchewan ddiwedd Mehefin, er i rai teuluoedd ddychwelyd i\u0027r Wladfa yn nes ymlaen. Symudodd eraill i dalaith Río Negro yn yr Ariannin.\nNewydd-ddyfodiaid oedd wedi methu cael tir oedd llawer ohonynt, a daeth mwy o fewnfudwyr o Gymru yn eu lle. Erbyn diwedd y 19g roedd tua 4,000 o bobl o dras Gymreig yn byw yn Chubut. Cyrhaeddodd tua 1000 o fewnfudwyr Cymreig rhwng 1886 a 1911, ond rhoddodd y Rhyfel Byd Cyntaf ddiwedd ar fewnfudiad o Gymru, ac ni ail-ddechreuodd ar ôl y rhyfel, er i rai unigolion symud i\u0027r Wladfa. Barn Glyn Williams yw na ymfudodd mwy na tua 2,300 o Gymry i Batagonia. Rhwng 1910 a 1916, ymfudodd cyfanswm o 151 o drigolion y Wladfa i Awstralia.\r\n\r\n== Crefydd ==\nCred Robert Owen Jones fod Ymneilltuaeth Gymraeg wedi bod yn allweddol i sicrhau ymwybyddiaeth gymdeithasol gref, er yn cydnabod mai mynd allan i gael tir y gwnaethant i ddianc rhag gorthrwm meistri tir Yng nghanol amodau cyntefig y misoedd a\u0027r blynyddoedd cynnar ni fyddai yn syndod i weld diffyg trefn a diffyg arweiniad, ond fel arall y bu. Yng nghanol y pentref adeiladwyd capel a ddefnyddid yn ogystal i wasanaethau ac ysgol Sul, ond hefyd i\u0027r ysgol ddyddiol, fel llys barn, siambar i\u0027r cyngor llywodraethol, ac weithiau hyd yn oed fel carchar.\nTri chapel oedd yn y Dyffryn yn 1879 ond erbyn 1896 roedd yno 17.\r\n\r\n== Y Wladfa heddiw ==\n\nErbyn heddiw, mae diwylliant a thraddodiadau Cymru yn fyw yn yr ardal. Er enghraifft mae Eisteddfod yn cael ei chynnal ddwywaith y flwyddyn. Adeiladwyd yr ysgol gyntaf ac argraffwyd y papur newydd cyntaf gan Richard Berwyn ym 1868.\nEr i\u0027r mewnfudwyr fynd i\u0027r Wladfa er mwyn cadw eu hiaith a\u0027u traddodiadau, daeth Sbaeneg i fod yn iaith swyddogol ym 1880 a thros y blynyddoedd roedd nifer y bobl yn siarad Cymraeg yn lleihau. Ond mae cysylltiadau rhwng y Wladfa a Chymru yn cryfhau ers y 1960au. Dechreuodd y Swyddfa Gymreig ariannu cyrsiau Cymraeg ar gyfer pobl y Wladfa gan anfon athrawon atynt i gryfhau\u0027r iaith. Mae\u0027r rhaglen hon yn parhau hyd heddiw, dan nawdd Llywodraeth Cymru.\nAllan o\u0027r tua 150,000 o bobl sy\u0027n byw yn yr ardal mae tua 20,000 ohonynt yn ddisgynyddion i\u0027r Cymry. Mae tua 5,000 ohonynt yn siarad Cymraeg a nifer eraill yn dysgu\u0027r iaith. Gelwir tafodiaith yr ardal yn Gymraeg y Wladfa.\nCafwyd ffrae yn 2009 pan wrthododd swyddogion tollau a mewnfudo\u0027r DU fynediad i wledydd Prydain i ddwy Archentwraig Gymreig o\u0027r Wladfa a oedd wedi trefnu dod i aros yng Nghymru am gyfnod i aros gyda theuluoedd lleol yng ngogledd Cymru er mwyn gwella eu Cymraeg. Cawsant eu hanfon yn ôl i\u0027r Ariannin ar ôl glanio yn y maes awyr. Protestiodd nifer o bobl yn erbyn penderfyniad yr awdurdodau a chynhaliwyd cyngerdd yn Nyffryn Nantlle i\u0027w cefnogi.\r\n\r\n== Llenyddiaeth y Wladfa ==\n\nCyhoeddwyd llawer o farddoniaeth ac ysgrifau\u0027r cyfnod cynnar yn Y Drafod, y newyddiadur pythefnosol a gychwynnwyd gan Lewis Jones. Efallai mai prif lenorion y Wladfa oedd Eluned Morgan, awdur nifer o lyfrau megis Dringo\u0027r Andes a ystyrir yn glasuron, ac R. Bryn Williams, a enillodd gadair yr Eisteddfod Genedlaethol am ei awdl Patagonia ac a oedd hefyd yn awdur nifer o nofelau megis Bandit yr Andes. Ymhlith llenorion y Wladfa yn y cyfnod diweddar, gellir nodi Irma Hughes de Jones.\nCyhoeddwyd nifer o gyfrolau o atgofion am y Wladfa, yn eu plith Atgofion o Batagonia gol. R. Bryn Williams, sy\u0027n cynnwys ysgrifau gan nifer o drigolion y Wladfa, Pethau Patagonia gan Marian Elias ar sail cyfweliadau gyda Fred Green, Atgofion am y Wladfa gan Valmai Jones a Nel fach y bwcs gan Marged Lloyd Jones.\nCyhoeddodd R. Bryn Williams flodeugerdd o farddoniaeth y Wladfa yn Awen Ariannin . Enillodd Sian Eirian Rees Davies Wobr Goffa Daniel Owen yn Eisteddfod Genedlaethol Cymru Eryri a\u0027r Cyffiniau 2005 gyda I Fyd Sy Well, nofel hanesyddol am ddechreuadau\u0027r Wladfa.\r\n\r\n== Map ==\r\n\r\n== Adar y Wladfa ==\nLuiz Carrizo[1], tud. 7. Cymraeg, gwyddonol, Saeneg a Sbaeneg yn eu trefn.\nCNOCELL MAGELLAN\nCampephilus magellanicus\nMagellanic woodpecker\nCarpintero gigante\nTAPACWLO CHUCAO\nSchlerochilus rubecula\nChucao tapaculo Chucao\nGŴYDD BENLLWYD\nChloephaga poliocephala\nAshy headed goose\nCauquén real\nCONDOR YR ANDES\nVultur gryphus\nAndean condor\nCondor\nCARACARA CYFFREDIN BARCUD MAWR\nCaracara plancus\nSouthern crested caracara\nCarancho\nDIWCON\nXolmis pyrope\nFire-eyed diucon\nDiucón\nERYR BRONDDU\nGeranoaetus melanoleucus\nBlack-chested Buzzard- Eagle \nÁquila mora\nFFLAMINGO CHILE\nPhoenicopterus chilensis\nChilean flamingo\nFlamenco\nIBIS GYDDFDDU\nTheristicus melanopis\nBlack-faced ibis\nBandurria\nSENOPS GYDDFWYN \nPygarrhichas albogularis \nWhite-throated Treerunner\nPicatezna patagarrico\nTEYRN BARFOG\nTachuris rubigastra\nMany-colored Rush Tyrant\nTachuri\nGWYACH FAWR\nPodiceps major\nGreat grebe\nHuela\nCONWRA DEHEUOL\nEnicognathus ferrugineus\nAustral Parakeet\nCachaña\nERYRDYLLUAN EWROP\nBubo magellanicus\nLesser Horned Owl\nTucúquere\nPYSGOTWR TORGOCH\nMegaceryle torquata\nKingfisher\nMarn pescador grande\r\n\r\n== Ffynonellau ==",
  "imageNames": [
    "Beach_at_Puerto_Madryn.jpg",
    "Capel_Bethel.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1865,
  "categoryId": "cymdeithasol",
  "id": "patagonia",
  "label": "Patagonia"
}