{
  "wikiSummary": "Pont y Borth yw’r bont  barhaol gyntaf rhwng Ynys Môn a’r tir mawr, ac mae’n parhau i gludo’r A5.",
  "wikiArticle": "Pont y Borth yw’r bont  barhaol gyntaf rhwng Ynys Môn a’r tir mawr, ac mae’n parhau i gludo’r A5.\r\n\r\n== Adeiladu’r bont ==\nCyn adeiladu’r bont, dim ond ar y dŵr y gellid teithio rhwng yr Ynys a’r tir mawr. ‘Roedd fferi Bangor i Borthaethwy y pennaf ohonynt, ac mae cofnod i Elisabeth I o Loegr osod yr hawl i un John Williams yn 1594.\n‘Roedd Undeb Prydain Fawr gydag Iwerddon wedi creu galw am gryfhau’r cysylltiad ymarferol rhwng Llundain a Dulyn. Wedi sefydlu pwyllgor seneddol, comisiynwyd Thomas Telford, nid yn unig i adeiladu’r bont hon, ond i wella safon y ffyrdd yr holl ffordd o Lundain i Gaergybi. Gan mai ffyrdd tyrpeg yn nwylo preifat oedd yn y wlad bryd hynny, hwn oedd y tro cyntaf i arian cyhoeddus gyllido adeiladu ffyrdd ym Mhrydain ers oes y Rhufeiniaid.\nGofynnwyd i Telford hefyd wella’r ffordd rhwng Bangor a Chonwy ac i groesi’r Afon Conwy yno. Adeiladodd bont grog hefyd yng Nghonwy i batrwm cyffelyb, ac agorwyd y ddwy bont yr un flwyddyn.\n\n‘Roedd y dasg o groesi Afon Menai yn fwy uchelgeisiol, nid yn unig oherwydd lled y culfor, ond hefyd am fod raid iddo osod y gerbydlon 100 troedfedd uwchben y dŵr, er mwyn caniatáu mynediad i longau hwylio tal yr oes.\nCychwynwyd ar y gwaith ar 10 Awst 1819 gan osod y garreg sylfaen. Adeiladwyd y tyrau o galchfaen lleol o chwareli Penmon dros y pum mlynedd nesaf. Rhwng Ebrill a Gorffennaf  1825, codwyd y cadwyni haearn at ben y tyrau ar draws o Sir Fôn i Sir Gaernarfon. Wedi hynny, gosodwyd y gerbydlon yn crogi dan y cadwyni. ‘Roedd rhai wedi amau a fyddai’r cynllun yn llwyddo, ond mewn gwirionedd roedd y bont grog yn gampwaith peirianyddol. Serch hynny collwyd bywydau wrth adeiladu\u0027r bont ac mae cofeb i\u0027r meirw mewn eglwys gyfagos Llanfairpwllgwyngyll\nGorffenwyd ar 30 o Ionawr 1826.\nAgorwyd y bont i’r cyhoedd am 1.35am ar 30 Ionawr 1826.\r\n\r\n== Gwelliannau ac atgyweirio ==\n‘Roedd rhaid atgywerio’r bont yn sylweddol wedi i gorwynt ddifa rhannau o’r gerbydlon yn 1839, a chryfhawyd y dec yn 1842. Erbyn 1893 ‘roedd rhaid ei gryfhau drachefn, gan amnewid y dec o goed gyda strwythur o ddur.\nErbyn dechrau’r 20g, sylweddolwyd bod y pwysau uwch ar y dec, ynghyd a’r traffig modur oedd yn defnyddio’r bont erbyn hynny, yn rhoi straen gormodol ar gadwyni haearn Telford. ‘Roedd rhaid gosod cyfyngiad ar gyflymder ac ar bwysau. Effaith yr ail oedd bod raid i deithwyr ar fws esgyn oddi ar y bws a cherdded ar draws y bont, wedyn ail-ymuno a’r bws yr ochr arall.\nYn dilyn difrod pellach mewn storm ym 1936, penderfynwyd mynd ati i atgyfnerthu’r bont unwaith eto. Ym 1940 gwnaed gwaith sylweddol iawn gan gwmni Dorman Long, yn cynnwys –\n\ntynnu’r pedair cadwyn haearn a gosod dwy gadwyn dur yn eu lle;\nadeiladu cerbydlon newydd o goncrit rhyng y tyrau;\nadeiladu llwybrau troed newydd y tu allan i’r gerbydlon;\nOherwydd cyfyngiadau’r Ail Ryfel Byd, roedd rhaid cadw’r gwaith hwn yn gyfrinachol. A gwnaed hyn i gyd heb dorri llif y traffig ar y ffordd. Wrth gwblhau’r gwaith, fe’i rhyddhawyd hefyd o’r toll ar 1 Ionawr 1941.\n\nRhwng Chwefror a Rhagfyr 2005 gwnaed gwaith ail-beintio sylweddol. Roedd hi wedi ei pheintio yn rheolaidd wrth gwrs, ond y tro hwn, aethpwyd yn ôl at y metel ac ail-wampio y cyfan am y tro cyntaf ers gwaith Dorman Long ym 1940.\r\n\r\n== Y bont heddiw ==\nErs 2022, mae’r bont ar gau. Mae Pont y Borth yn parhau i fod yn rhan o rwydwaith cefnffyrdd cenedlaethol, am fod  Pont Britannia mor agored i wyntoedd cryfion, ac rhaid cyfeirio lorïau trymion ar draws Pont y Borth. Mae’r ddwy bont yn cael eu rheoli gan gonsortiwm Menter Cyllid Preifat ar ran Cynulliad Cenedlaethol Cymru.\nPont y Borth yw’r unig bont ar draws y Fenai sy’n agored i gerddwyr. Mae Llwybr Arfordirol Ynys Mon yn mynd oddi tani. Saif cofeb i Drychineb Aberfan ar ochr Ynys Môn o’r bont.\nYmddangosodd llun o\u0027r bont, ar un o stampiau Swyddfa\u0027r Post yn 1968, cyfres o bedwar stamp yn dangos pontydd. Cofnodir Pont y Borth hefyd ar gefn y darnau un bunt a fathwyd yn 2005, ac a arluniwyd gan Edwins Ellis. Cafodd y bont ei henwebu ar gyfer dod yn un o Safleoedd Treftadaeth y Byd UNESCO, ond gwrthodwyd y cais ym 1998.\r\n\r\n== Mesuriadau ==\nEi hyd yw  417 m. Mae ganddo 7 bwa. Lled y bont 12m.\r\n\r\n== Arddangosfeydd a chreiriau ==\nMae nifer o luniau, cynlluniau a chreiriau o hanes y bont yn cael eu harddangos yn lleol, yn cynnwys –\n\nOriel Ynys Môn Archifwyd 2007-03-11 yn y Peiriant Wayback\nAmgueddfa Bangor Archifwyd 2009-10-10 yn y Peiriant Wayback\nPlas Newydd Archifwyd 2007-03-11 yn y Peiriant Wayback Arddangosfa\u0027r Pontydd Archifwyd 2006-09-24 yn y Peiriant Wayback == Englyn ==\nUchelgaer uwch y weilgi - gyr y byd\nEi gerbydau drosti,\nChwithau holl longau y lli\nEwch o dan ei chadwyni . \nDewi Wyn o Eifion",
  "location": {
    "lat": 53.22,
    "long": -4.16305556
  },
  "imageNames": [
    "A_plan_and_view_of_a_chain_bridge_-_erecting_over_the_menai_at_Bangor_Ferry_1820.jpeg",
    "Bangor_View_on_Suspension_Bridge_8571590364.jpg",
    "Menai_Bridge_at_dusk.jpg",
    "Select_Sketches_-_Menai_Bridge_2.jpg",
    "The_Menai_Suspension_Bridge_35349065306.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1819,
  "categoryId": "diwydiant",
  "id": "pont-menai",
  "label": "Pont y Borth"
}