{
  "wikiSummary": "Pentref ac atyniad twristiaid yng Ngwynedd, Cymru, yw Portmeirion . Lleolir ym Meirionnydd, a roes iddo\u0027i enw, ynghyd â\u0027r rhagddodiad \u0022Port\u0022 i gyfleu naws Port arall, sef Portofino yn Yr Eidal. Saif ar benrhyn Aber Iâ ar lannau Afon Dwyryd, ger Bae Tremadog. Mae\u0027r fynedfa iddo hanner ffordd rhwng Penrhyndeudraeth a Phorthmadog, ar yr A487. \nRoedd y pentref yn arbrawf ac yn ymgais i greu datblygu cynaladwy sy\u0027n gydnaws a\u0027i amgylchfyd o ran tirwedd a diwylliant. Mae yna dai a siopau, bwytai a gwestai yn y pentref, rai ohonyn nhw\u0027n adeiladau gwreiddiol ac eraill wedi eu cynllunio gan y pensaer a\u0027r cadwriaethwr Syr Clough Williams-Ellis a\u0027i codi ganddo. Prynodd Williams-Ellis y safle ym 1925 a\u0027i agor fel gwesty dros y Pasg 1926. Ei fwriad oedd dangos ei bod yn bosibl datblygu lle hardd heb ei ddinistrio, ac y gellid, o arddel disgyblaeth lem, ychwanegu at yr harddwch naturiol. Ar dir y gwesty gellir ymweld ag adfeilion Castell Deudraeth, a godwyd gan feibion Cynan ab Owain Gwynedd tua chanol y 12g.",
  "wikiArticle": "Pentref ac atyniad twristiaid yng Ngwynedd, Cymru, yw Portmeirion . Lleolir ym Meirionnydd, a roes iddo\u0027i enw, ynghyd â\u0027r rhagddodiad \u0022Port\u0022 i gyfleu naws Port arall, sef Portofino yn Yr Eidal. Saif ar benrhyn Aber Iâ ar lannau Afon Dwyryd, ger Bae Tremadog. Mae\u0027r fynedfa iddo hanner ffordd rhwng Penrhyndeudraeth a Phorthmadog, ar yr A487. \nRoedd y pentref yn arbrawf ac yn ymgais i greu datblygu cynaladwy sy\u0027n gydnaws a\u0027i amgylchfyd o ran tirwedd a diwylliant. Mae yna dai a siopau, bwytai a gwestai yn y pentref, rai ohonyn nhw\u0027n adeiladau gwreiddiol ac eraill wedi eu cynllunio gan y pensaer a\u0027r cadwriaethwr Syr Clough Williams-Ellis a\u0027i codi ganddo. Prynodd Williams-Ellis y safle ym 1925 a\u0027i agor fel gwesty dros y Pasg 1926. Ei fwriad oedd dangos ei bod yn bosibl datblygu lle hardd heb ei ddinistrio, ac y gellid, o arddel disgyblaeth lem, ychwanegu at yr harddwch naturiol. Ar dir y gwesty gellir ymweld ag adfeilion Castell Deudraeth, a godwyd gan feibion Cynan ab Owain Gwynedd tua chanol y 12g.\r\n\r\n== Hanes ==\n\nRhwng 1926 a 1939 codwyd tua hanner y pentref gan gynnwys addasu\u0027r Gwesty, codi bythynnod Neifion ac Angel, y twr clychau, ty\u0027r llywodraeth, dolffin, y drindod, y siantri, llety\u0027r foneddiges, llety\u0027r prior, neuadd y dref, y twr gwylio—ac yna daeth seibiant tan 1954 oherwydd y rhyfel, deddfau cyfyngu ar adeiladu a\u0027r tân yn ei garterf Plas Brondanw yn 1951. Wedi trwsio\u0027i dy, aeth ati o 1954 i 1973 i orffen ei waith gydag adeiladau megis y gatws, colofnres bryse 1957, y gromen 1960, ty pont, ty clogwyn, uncorn, twr telfford, y bwâu, y sgwâr canol. Ym 1966 dewiswyd y lle fel cefndir i\u0027r gyfres The Prisoner gyda Patrick McGoohan a ddaeth yn glasur cwlt teledu\u0027r 1960au. Mae\u0027r pentref tua 6 milltir o Blas Brondanw, tŷ\u0027r teulu ers pum can mlynedd. Mae pentref Portmeirion ar agor i ymwelwyr dydd a phreswylwyr nos bob dydd o\u0027r flwyddyn. Perchennog y pentref a hefyd stad Brondanw, eiddo Williams-Ellis yng Nghwm Croesor, sy\u0027n cynnwys Plas Brondanw, yw\u0027r Elusen y Second Portmeirion Foundation neu Ail Ymddiriedolaeth Portmeirion yn unol a dymuniad y sylfaenydd.\nCyn iddo godi Portmeirion, roedd Williams-Ellis yn chwilio am leoliad addas i bentref ei freuddwydion am flynyddoedd, yn bennaf ar ynysoedd ym mhob cwr o Gymru, ond o\u0027r diwedd penderfynodd brynu a datblygu gorynys Aber Iâ. Roedd e\u0027n credu nad oedd yr enw Aber Iâ yn ddigon \u0022Cymraeg\u0022 ac felly newidiodd yr enw i Bortmeirion.\n\nAdeiladwyd y pentref lliwgar ar lethr creigiog ar lan yr afon ac mae\u0027r Campanile, Tŵr y Cloch, sydd ar gopa\u0027r bryn yn ganolbwynt iddo. Y Plasdy sydd yn cael ei ddefnyddio fel gwesty heddiw yw\u0027r unig tŷ gwreiddiol. Ymhlith y tai sydd yn dod o ardaloedd eraill mae tý\u0027r arlunydd Augustus John. Mae\u0027r Neuadd Hercules yn dod o Sir y Fflint a\u0027r Pantheon o Sir Gâr—ond nid yn unig tai cyfan wedi eu symud sy\u0027 yn y pentref, ond hefyd colofnau o Fryste a Hooton Hall yn Sir Gâr. Ac er bod y pentref yn ymdebygu i bentref Eidalaidd mae Bwda yno hefyd.\nMae\u0027r pentref yn enwog am fod yn lleoliad y gyfres teledu The Prisoner ac mae e\u0027n safle twristiaid gydag oddeutu 250,000 o ymwelwyr yn dod pob blwyddyn. Ymhlith ei ymwelwyr enwog mae Noël Coward, Gregory Peck, Ingrid Bergman a Paul McCartney. Ym 1956 ymwelodd y pensaer Frank Lloyd Wright â\u0027r pentref ac roedd e\u0027n falch iawn o\u0027r amgylchedd a\u0027r adeiladau hardd.",
  "location": {
    "lat": 52.91305556,
    "long": -4.09916667
  },
  "imageNames": [
    "Hercules_statue_by_William_Brodie_Portmeirion_Wales.jpg",
    "Portmeirion_Wales_48559387366.jpg",
    "Portmeirion_Wales_49280865701.jpg",
    "Portmeirion._48576915327.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1925,
  "end": 1975,
  "categoryId": "lleoedd",
  "id": "portmeirion",
  "label": "Portmeirion"
}