{
  "wikiSummary": "Prifddinas Cymru yw Caerdydd ; hon yw dinas fwyaf Cymru a\u0027r ddegfed fwyaf yn y Deyrnas Unedig. Daeth yn ddinas yn 1905 ac yn brifddinas Cymru yn 1955. Yma mae canolfan fasnachol fwyaf Cymru ac mae\u0027r rhan fwyaf o sefydliadau cenedlaethol Cymru wedi eu lleoli yma hefyd. Mae poblogaeth Caerdydd oddeutu 383,536 a\u0027r ddinas gyfan sy\u0027n cynnwys Penarth a Dinas Powys yn 447,487.\nCeir llawer o brifddinasoedd ledled y byd sy\u0027n llai na Chaerdydd gan gynnwys prifddinasoedd: Bern, Y Swistir ), Brwsel, Gwlad Belg ) a Wellington, Seland Newydd ).\nRoedd Caerdydd yn dref fechan tan ddechrau\u0027r 19g. Tyfodd yn gyflym gyda dyfodiad y chwyldro diwydiannol ac yn enwedig pan gysylltwyd cymoedd De Cymru â rheilffyrdd fel y gellid allforio glo o borthladd Caerdydd. Yn 1851 roedd poblogaeth Caerdydd yn 20,000 ond erbyn 1911 roedd yn 182,000 ac erbyn 1991 roedd yn 269,000. Yn 1891 roedd Caerdydd yn allforio 708,000 o dunelli o lo: erbyn 1911 roedd yr allforion yn 10 miliwn tunnell.\nRoedd porthladd Caerdydd yn cael ei adnabod fel \u0022Tiger Bay\u0022, ac ar un adeg hon oedd un o borthladdoedd prysuraf y byd. Ar ôl cyfnod hir o ddirywiad, mae\u0027r ardal wedi cael ei hadnewyddu fel Bae Caerdydd. Gobeithir y daw yn ardal boblogaidd ar gyfer y celfyddydau, bywyd nos ac adloniant. Daw\u0027r twf aruthrol yma ar ôl adeiladu argae ar draws y bae, gan greu llyn enfawr. Roedd hyn yn ddadleuol iawn ar y pryd, ac yr oedd hefyd yn ofid fod y gymuned leol a oedd yn bodoli yn Tiger Bay yn cael ei chwalu. Ym Mae Caerdydd yr ymsefydlodd Cynulliad Cenedlaethol Cymru ac yno mae Canolfan y Mileniwm hefyd, sydd yn gartref i Urdd Gobaith Cymru ac Opera Cenedlaethol Cymru yn ogystal â Stadiwm y Mileniwm.",
  "wikiArticle": "Prifddinas Cymru yw Caerdydd ; hon yw dinas fwyaf Cymru a\u0027r ddegfed fwyaf yn y Deyrnas Unedig. Daeth yn ddinas yn 1905 ac yn brifddinas Cymru yn 1955. Yma mae canolfan fasnachol fwyaf Cymru ac mae\u0027r rhan fwyaf o sefydliadau cenedlaethol Cymru wedi eu lleoli yma hefyd. Mae poblogaeth Caerdydd oddeutu 383,536 a\u0027r ddinas gyfan sy\u0027n cynnwys Penarth a Dinas Powys yn 447,487.\nCeir llawer o brifddinasoedd ledled y byd sy\u0027n llai na Chaerdydd gan gynnwys prifddinasoedd: Bern, Y Swistir ), Brwsel, Gwlad Belg ) a Wellington, Seland Newydd ).\nRoedd Caerdydd yn dref fechan tan ddechrau\u0027r 19g. Tyfodd yn gyflym gyda dyfodiad y chwyldro diwydiannol ac yn enwedig pan gysylltwyd cymoedd De Cymru â rheilffyrdd fel y gellid allforio glo o borthladd Caerdydd. Yn 1851 roedd poblogaeth Caerdydd yn 20,000 ond erbyn 1911 roedd yn 182,000 ac erbyn 1991 roedd yn 269,000. Yn 1891 roedd Caerdydd yn allforio 708,000 o dunelli o lo: erbyn 1911 roedd yr allforion yn 10 miliwn tunnell.\nRoedd porthladd Caerdydd yn cael ei adnabod fel \u0022Tiger Bay\u0022, ac ar un adeg hon oedd un o borthladdoedd prysuraf y byd. Ar ôl cyfnod hir o ddirywiad, mae\u0027r ardal wedi cael ei hadnewyddu fel Bae Caerdydd. Gobeithir y daw yn ardal boblogaidd ar gyfer y celfyddydau, bywyd nos ac adloniant. Daw\u0027r twf aruthrol yma ar ôl adeiladu argae ar draws y bae, gan greu llyn enfawr. Roedd hyn yn ddadleuol iawn ar y pryd, ac yr oedd hefyd yn ofid fod y gymuned leol a oedd yn bodoli yn Tiger Bay yn cael ei chwalu. Ym Mae Caerdydd yr ymsefydlodd Cynulliad Cenedlaethol Cymru ac yno mae Canolfan y Mileniwm hefyd, sydd yn gartref i Urdd Gobaith Cymru ac Opera Cenedlaethol Cymru yn ogystal â Stadiwm y Mileniwm.\r\n\r\n== Enw ==\nYstyr yr enw Caerdydd yw \u0027caer afon Taf\u0027. Datblygodd y ffurf honno o\u0027r ffurf gynharach Caerdyf. Mae\u0027r elfen -dyf yn tarddu o ffurf dreigledig gynnar ar enw afon Taf. Mae\u0027n dangos affeithiad i\u0027r llafariad dan ddylanwad terfyniad sydd bellach wedi ei golli.\r\n\r\n== Hanes ==\nYmwelodd Gerallt Gymro â Chaerdydd yn ystod ei daith trwy Gymru yn 1188.\r\n\r\n== Yr iaith Gymraeg ==\nYn ôl Cyfrifiad 2021, roedd 42,584 o bobl Caerdydd yn gallu siarad Cymraeg.\nCeir fersiynau electronig o erthyglau gan yr Athro E. Wyn James ar y Gymraeg a\u0027i diwylliant yng Nghaerdydd a Bro Morgannwg ar wefan Y Dinesydd: http://dinesydd.cymru/teithiau/\r\n\r\n== Economi ==\n\nFel prifddinas Cymru, economi Caerdydd yw\u0027r brif fan am dwf economi Cymru. Mae\u0027r ddinas wedi\u0027i lleoli ar Goridor yr M4, ac mae ei heconomi a\u0027i hardaloedd cyfagos yn cyfrif am bron 20% o CMC Cymru. Yn y 19g, allforio glo a chynhyrchu dur oedd seiliau economi Caerdydd, gyda phorth y brifddinas yn allforio mwy o lo na Llundain a Lerpwl. Heddiw, mae\u0027r ddinas yn dibynnu ar sectorau adwerthu, gwasanaethau ariannol, y cyfryngau, a thwristiaeth, ac wedi bod yn lleoliad i adfywiad ers hwyr yr 20g yn enwedig yng nghanol dinas Caerdydd a Bae Caerdydd.\r\n\r\n== Cestyll ==\nCastell Caerdydd\nCastell Coch\nCastell Sain Ffagan\nLlys yr Esgob Llandaf\nTwmpath Rhiwbeina\r\n\r\n== Chwaraeon ==\nMae clwb pêl-droed proffesiynol y ddinas, C.P.D. Dinas Caerdydd , yn chwarae yn Stadiwm Dinas Caerdydd. Ar hyn o bryd mae\u0027r clwb yn chwarae yn y Bencampwriaeth. Enillodd y clwb Gwpan FA Lloegr yn 1927.\r\n\r\n== Trafnidiaeth ==\nMae\u0027r rhwydwaith trafnidiaeth cyhoeddus yn y ddinas yn cael ei redeg gan Fws Caerdydd a Trafnidiaeth Cymru. Mae\u0027r rhwydwaith yn cynnwys wyth rheilffordd, i Faesteg, Bro Morgannwg a Maes Awyr Caerdydd, Treherbert, Merthyr Tudful ac Aberdâr, Coryton, Rhymni, a Bae Caerdydd. Mae gan y ddinas 22 orsaf fel gorsafoedd Caerdydd Canolog a Chaerdydd Heol Y Frenhines, ill dwy yng nghanol y ddinas.\nMae Maes Awyr Rhyngwladol Caerdydd ym Mro Morgannwg.\r\n\r\n== Pobl o Gaerdydd ==\r\n\r\n== Cymunedau Caerdydd ==\r\n\r\n== Eisteddfod Genedlaethol ==\nCynhaliwyd Eisteddfod Genedlaethol yng Nghaerdydd ym 1883, 1899, 1938, 1960, 1978, 2008, a 2018. Am wybodaeth bellach gweler:\n\nEisteddfod Genedlaethol Cymru Caerdydd 1883\nEisteddfod Genedlaethol Cymru Caerdydd 1899\nEisteddfod Genedlaethol Cymru Caerdydd 1938\nEisteddfod Genedlaethol Cymru Caerdydd 1960\nEisteddfod Genedlaethol Cymru Caerdydd 1978\nEisteddfod Genedlaethol Cymru Caerdydd a\u0027r Cylch 2008\nEisteddfod Genedlaethol Cymru Caerdydd 2018\r\n\r\n== Gefeilldrefi ==",
  "location": {
    "lat": 51.48166667,
    "long": -3.17916667
  },
  "imageNames": [
    "71_Bridge_Street_1_Cardiff_city_centre.jpg",
    "A_view_of_the_jubilee_dock_Cardiff_from_the_eastern_side.jpeg",
    "Adeilad_y_Pierhead_Caerdydd.jpg",
    "Amgueddfa_Genedlaethol_Caerdydd.JPG",
    "Aquabushydro1.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1955,
  "categoryId": "lleoedd",
  "id": "prif-ddinas",
  "label": "Caerdydd"
}