{
  "wikiSummary": "Rhodri ap Merfyn neu Rhodri Mawr fel yr adnabuwyd ef yn ddiweddarach, oedd y brenin cyntaf i reoli\u0027r rhan fwyaf o Gymru a\u0027r cyntaf hefyd i gael ei alw\u0027n \u0022Fawr\u0022.\nRhoddwyd y teitl hwn iddo oherwydd ei fod yn perthyn i genhedlaeth o reolwyr a oedd wedi ceisio creu undod gwleidyddol yn eu gwledydd eu hunain. Roedd cyfoedion iddo, fel Siarlymaen a’r Brenin Alffred, neu Alffred Fawr, wedi llwyddo i greu ymdeimlad o genedligrwydd ymhlith eu pobloedd eu hunain yn Ffrainc ac yn Lloegr. Yn yr un modd, roedd Rhodri wedi uno prif deyrnasoedd Cymru o dan ei arweinyddiaeth, sef Gwynedd, Powys a\u0027r Deheubarth ac wedi cyfarwyddo’r Cymry gyda’r syniad o uno o dan un arweinydd yn hytrach na pharhau i fod yn glytwaith o deyrnasoedd bychan.\nDaeth yn Frenin Gwynedd yn 844 ar farwolaeth ei dad, Merfyn Frych, yn rheolwr Powys yn 855 a Seisyllwg yn 871. Roedd yn awr yn frenin ar y rhan fwyaf o Gymru, gyda’i deyrnas yn ymestyn o Ynys Môn i Benrhyn Gŵyr.",
  "wikiArticle": "Rhodri ap Merfyn neu Rhodri Mawr fel yr adnabuwyd ef yn ddiweddarach, oedd y brenin cyntaf i reoli\u0027r rhan fwyaf o Gymru a\u0027r cyntaf hefyd i gael ei alw\u0027n \u0022Fawr\u0022.\nRhoddwyd y teitl hwn iddo oherwydd ei fod yn perthyn i genhedlaeth o reolwyr a oedd wedi ceisio creu undod gwleidyddol yn eu gwledydd eu hunain. Roedd cyfoedion iddo, fel Siarlymaen a’r Brenin Alffred, neu Alffred Fawr, wedi llwyddo i greu ymdeimlad o genedligrwydd ymhlith eu pobloedd eu hunain yn Ffrainc ac yn Lloegr. Yn yr un modd, roedd Rhodri wedi uno prif deyrnasoedd Cymru o dan ei arweinyddiaeth, sef Gwynedd, Powys a\u0027r Deheubarth ac wedi cyfarwyddo’r Cymry gyda’r syniad o uno o dan un arweinydd yn hytrach na pharhau i fod yn glytwaith o deyrnasoedd bychan.\nDaeth yn Frenin Gwynedd yn 844 ar farwolaeth ei dad, Merfyn Frych, yn rheolwr Powys yn 855 a Seisyllwg yn 871. Roedd yn awr yn frenin ar y rhan fwyaf o Gymru, gyda’i deyrnas yn ymestyn o Ynys Môn i Benrhyn Gŵyr.\r\n\r\n== Etifeddiaeth a Llinach ==\nLlwyddodd Merfyn Frych a’i fab, Rhodri, i gael eu gafael ar rai o brif deyrnasoedd Cymru drwy gyfrwng cyfres o briodasau gwleidyddol yn hytrach na lansio cyfres o ymgyrchoedd milwrol. Roedd Merfyn ei hun wedi etifeddu Gwynedd yn 825 pan fu farw ei ewythr ar ochr ei fam, Hywel ap Rhodri, yn ddi-etifedd ac yn aelod gwrywaidd olaf teulu Maelgwn. Wedyn, priododd Merfyn â Nest ferch Cadell, o deulu brenhinol Powys, a phriododd Rhodri eu mab ag Angharad, chwaer Gwgon, brenin Ceredigion.\nEr bod Cyfraith Cymru yn gwahardd trosglwyddo unrhyw etifeddiaeth drwy linell deuluol y fam, defnyddiwyd cysylltiad Rhodri â Phowys, drwy ei fam, i gyfiawnhau bod Powys yn dod i’w feddiant yn 855 yn dilyn marwolaeth ei ewythr Cyngen ap Cadell tra\u0027r oedd ar bererindod i Rufain. Roedd hynny ar draul y ffaith bod gan Cadell etifeddion.\nYn yr un ffordd, defnyddiodd ei briodas ag Angharad ferch Meurig i gyfiawnhau ei hawl i olynu Gwgon, ei frawd-yng-nghyfraith, yn rheolwr teyrnas Seisyllwg yn 871. Camp ei deyrnasiad oedd llwyddo i glymu teyrnasoedd Gwynedd, Powys a\u0027r Deheubarth mewn undod fel bod y rhan helaethaf o Gymru o dan ei awdurdod erbyn 878.\r\n\r\n== Teyrnasiad ==\nAmlygodd Rhodri ei hun nid yn unig yn arweinydd craff ond hefyd fel milwr medrus a dewr. Wynebai fygythiadau ac ymosodiadau o sawl cyfeiriad, oddi wrth y Saeson, y Daniaid a theyrnasoedd eraill yng Nghymru.\nRoedd yn gorfod wynebu pwysau gan yr Eingl-sacsoniaid ac yn gynyddol gan y Daniaid hefyd, a fu\u0027n anrheithio Môn yn 854 yn ôl y croniclau. Yn 856 enillodd Rhodri fuddugoliaeth nodedig dros y Daniaid ger y Gogarth, Llandudno, gan ladd eu harweinydd Gormr . \nRoedd ei fuddugoliaeth dros y Northmyn yn nodedig, a soniwyd amdani yn llenyddiaeth y cyfnod. Roedd ei fuddugoliaeth yn hysbys ar draws y Cyfandir. Mae dwy gerdd gan Sedulius Scotus, y bardd ac ysgolhaig Gwyddelig, wedi eu hysgrifennu yn llys Siarl Foel, brenin y Ffranciaid Gorllewinol, yn dathlu buddugoliaeth \u0022Roricus\u0022 dros y Llychlynwyr. Cyfeiriwyd at y fuddugoliaeth yn y Brut Gwyddelig hefyd. Roedd hon yn fuddugoliaeth filwrol bwysig gan fod pŵer milwrol y Northmyn yn gryf ac yn ddidrugaredd. Erbyn 865 roeddent wedi cyrraedd ynysoedd yr Alban a sefydlu trefedigaethau yn Iwerddon, gan gynnwys un yn Nulyn. Aethant ymlaen wedyn i feddiannu teyrnasoedd brenhinol Lloegr oni bai am Wessex, a chipio tiroedd yng ngogledd Ffrainc. Cymaint oedd eu henwogrwydd bu\u0027n rhaid i Alffred Fawr ffoi i Wlad yr Haf a Rhodri i Iwerddon ar un adeg er mwyn dianc rhag rhaib y Northmyn.\nCafodd Rhodri fuddugoliaeth arall yn erbyn y Daniaid ym Mrwydr Parciau yn 872. Mae Cronicl y Tywysogion yn nodi buddugoliaeth mewn dau le, sef Bangolau lle trechodd y Llychlynwyr yn Ynys Môn mewn brwydr galed, a’r ail ym Manegid neu Enegyd, lle cafodd y Llychlynwyr eu dinistrio.\nYn 876 ymladdodd Rhodri frwydr arall yn erbyn y Daniaid, ond y tro hwn bu\u0027n rhaid iddo ffoi i Iwerddon. Pan ddychwelodd y flwyddyn wedyn yn 877, dywedir iddo ef a\u0027i fab Gwriad gael eu lladd gan y Saeson, sef gwŷr Mersia, er nad yw\u0027r manylion yn hysbys. Sonia rhywfaint o ffynonellau’r cyfnod mai Ceolwulf o Mersia a’i filwyr a’u lladdodd gan fod Alffred Fawr yn ymladd yn erbyn y Llychlynwyr yn Nwyrain Anglia ar y pryd. Pan enillodd ei fab, Anarawd ap Rhodri, fuddugoliaeth dros wŷr Mersia ym Mrwydr Conwy yn 881 fe\u0027i dathlwyd yn y brutiau fel \u0022dial Duw am Rhodri\u0022.\nRoedd Rhodri Fawr yn gefnogwr brwdfrydig i ddiwylliant y beirdd - traddodiad a oedd yn cofnodi hanesion y Cymry, ac mae cerdd gan yr ysgolhaig Gwyddelig, Sedulus Scottus, i Rhodri yn dangos ei bwysigrwydd fel noddwr a chefnogwr diwylliant. Hwn oedd cyfnod Canu Heledd a Llywarch Hen a’r cyfnod pan fu diddordeb yn y cysylltiad brenhinol rhwng yr Hen Ogledd a llinach frenhinol teyrnasoedd Cymru. Mae’n amlwg bod safon dysg yng Nghymru’r cyfnod yn cael ei gydnabod gan Loegr, oherwydd gwahoddwyd yr ysgolhaig Asser o Dyddewi draw i Wessex gan Alffred Fawr i ysgrifennu ei gofiant.\r\n\r\n== Yr olyniaeth ==\nYn ôl Trioedd Ynys Prydain, creodd Rhodri Mawr dair talaith, sef Dinefwr, Aberffraw a Mathrafal gyda \u0022thywysog talieithog\u0022 i bob talaith.\nYn ôl rhai haneswyr roedd pedwar o feibion gan Rhodri, ond dywedai eraill bod chwech ganddo. Ymhlith y meibion hynny roedd ei fab hynaf, sef Anarawd, a etifeddodd Wynedd a Phowys. Y gangen hon o’r teulu sefydlodd llys Aberffraw, ac roedd Gruffudd ap Cynan a Llywelyn Fawr ymhlith ei ddisgynyddion. Cadell oedd un o’r meibion eraill, a thad Hywel Dda, a’r gangen hon a ymsefydlodd gangen frenhinol teulu Dinefwr, a ddaeth yn bencadlys i deyrnas y Deheubarth.\n\n\n=== Plant ===\nAnarawd ap Rhodri Cadell ap Rhodri Gwriad ap Rhodri: a laddwyd mewn brwydr yn erbyn y Saeson gyda’i dad, Rhodri yn 877.  Lladdwyd ei fab, Gwgawn yn 955.\nTudwal ap Rhodri == Cyfeiriadau ==",
  "includeMainMenu": true,
  "amDdim": false,
  "start": 820,
  "end": 877,
  "categoryId": "arweinwyr",
  "id": "rhodri-mawr",
  "label": "Rhodri Mawr"
}