{
  "wikiSummary": "Roedd Cymru yn rhan o\u0027r Ymerodraeth Rufeinig am tua 350 o flynyddoedd. Cawsai\u0027r Rhufeiniaid a\u0027u diwylliant effaith sylweddol ar y wlad a\u0027i phobl. Gadawodd y Rhufeiniaid rwydwaith o ffyrdd ar eu ôl a sefydlasant nifer o drefi. Cafodd ei hiaith, Lladin, ddylanwad mawr ar yr iaith Gymraeg wrth iddi ymffurfio o Frythoneg Diweddar; mae tua 600 o eiriau Cymraeg yn tarddu o\u0027r cyfnod hwnnw . Credir i Gristnogaeth gyrraedd Cymru yn y cyfnod Rhufeinig hefyd.",
  "wikiArticle": "Roedd Cymru yn rhan o\u0027r Ymerodraeth Rufeinig am tua 350 o flynyddoedd. Cawsai\u0027r Rhufeiniaid a\u0027u diwylliant effaith sylweddol ar y wlad a\u0027i phobl. Gadawodd y Rhufeiniaid rwydwaith o ffyrdd ar eu ôl a sefydlasant nifer o drefi. Cafodd ei hiaith, Lladin, ddylanwad mawr ar yr iaith Gymraeg wrth iddi ymffurfio o Frythoneg Diweddar; mae tua 600 o eiriau Cymraeg yn tarddu o\u0027r cyfnod hwnnw . Credir i Gristnogaeth gyrraedd Cymru yn y cyfnod Rhufeinig hefyd.\r\n\r\n== Y llwythau brodorol ==\nPrif erthygl: Llwythau Celtaidd Cymru.\n\nMae’r rhan fwyaf o’r wybodaeth sydd gennym ynghylch llwythau Celtaidd Cymru yn deillio o’r cyfnod wedi i’r Rhufeiniaid gyrraedd i’r diriogaeth sy’n ffurfio Cymru fodern tua 48 O.C. Ni wyddom pa mor hir yr oedd y llwythau hyn wedi bodoli cyn y cyfnod Rhufeinig. Mae rhywfaint o dystiolaeth o Oes yr Efydd bod yr ardaloedd lle cafwyd hyd i rai mathau o gelfi yn cyd-fynd yn bur agos a thiriogaethau rhai o\u0027r llwythau, er enghraifft yn dilyn y ffin rhwng y Silwriaid a\u0027r Demetae yn y de.\nY llwythau y mae cofnod amdanynt oedd:\n\nY Silwriaid yn ne-ddwyrain Cymru.\nY Demetae yn y de-orllewin.\nYr Ordoficiaid yng nghanolbarth a rhan o ogledd-orllewin Cymru.\nY Gangani ar benrhyn Llŷn.\nY Deceangli yn y gogledd-ddwyrain .\r\n\r\n== Goresgyniad ==\n\nDaeth y Rhufeiniaid i wrthdrawiad a llwythau Cymru am y tro cyntaf yn 48, pan ymosododd llywodraethwr Prydain Ostorius Scapula ar y Deceangli. Nid ymddengys fod y Deceangli wedi gwrthwynebu rhyw lawer, ond bu raid i Ostorius ddychwelyd tua\u0027r dwyrain pan fu gwrthryfel ymysg y Brigantes.\n\nRoedd y Silwraid a\u0027r Ordoficiaid yn llai parod i ymostwng i\u0027r drefn Rufeinig. Yn y cyfnod yma, yr oeddynt yn cael eu harwain mewn rhyfel gan Caradog. Wedi i\u0027w lwyth ef ei hun, y Catuvellauni o dde-ddwyrain Lloegr, gael eu gorchfygu gan y Rhufeiniaid yr oedd wedi symud i diriogaeth y Silwriaid yn ne-ddwyrain Cymru. Dan bwysau gan y Rhufeiniaid, aeth Caradog tua\u0027r gogledd i diriogaeth yr Ordoficiaid, ond yn 51 gorchfygwyd ef gan Ostorius mewn brwydr, efallai ar lannau Afon Hafren.\nYmddengys i golledion yr Ordoficiaid yn y frwydr hon fod yn ddigon trwm i\u0027w cadw yn ddistaw am gyfnod, ond parhaodd y Silwriaid i ymladd yn erbyn y Rhufeiniaid gyda chryn lwyddiant. Dywedir i Ostorius ddatgan fod y llwyth mor beryglus nes byddai raid eu lladd i gyd neu eu halltudio. Ymosododd y Silwriaid ar gorff o filwyr Rhufeinig oedd yn adeiladu caerau yn eu tiriogaeth, a dim ond trwy ymdrech fawr y gallodd y Rhufeiniaid eu hachub. Dywedir i\u0027r Silwriaid gymeryd Rhufeinwyr yn garcharorion a\u0027u rhannu ymhlith llwythau cyfagos i greu cynghrair yn erbyn Rhufain. Bu farw Ostorius yn annisgwyl yn 52 heb fod wedi concro\u0027r Silwriaid. Wedi ei farwolaeth ef gallasant orchfygu yr Ail Leng, Legio II Augusta, oedd yn cael ei harwain gan Gaius Manlius Valens, cyn i\u0027r llywodraethwr newydd, Aulus Didius Gallus, gyrraedd.\nRoedd yr ymgyrch fawr nesaf i Gymru dan Gaius Suetonius Paulinus, oedd wedi ei benodi\u0027n llywodraethwr yn 59. Bu\u0027n ymladd am ddwy flynedd yn erbyn llwythi Cymru ac yn 61 ymosododd ar Ynys Môn. Roedd yr ynys yn amlwg o bwysigrwydd arbennig, nid yn unig yn noddfa i ffoaduriaid oddi wrth y Rhufeiniaid ond yn gadarnle y Derwyddon. Croesodd y Rhufeiniaid Afon Menai mewn cychod, ond er bod cryn dipyn o drafod wedi bod nid oes sicrwydd ymhle y croesodd. Mae\u0027r hanesydd Rhufeinig Tacitus yn rhoi disgrifiad byw o\u0027r olygfa ar lannau Môn, gyda\u0027r Derwyddon a merched Môn yn gymysg a\u0027r rhyfelwyr. Cipiodd Paulinus yr ynys a thorri coed y llennyrch sanctaidd. Yr oes i bob golwg ar fin cymryd meddiant o ogledd Cymru pan gyrhaeddodd y neges fod llwyth yr Iceni, yn nwyrain Lloegr, wedi codi mewn gwrthryfel dan eu brenhines Buddug . Bu raid i Suetonius Paulinus a\u0027i fyddin ddychwelyd tua\u0027r dwyrain i\u0027w hwynebu.\nYn 75 penodwyd Sextus Julius Frontinus yn llywodraethwr Prydain. Bu\u0027n ymladd yn erbyn y Silwriaid, a llwyddodd i orchfygu\u0027r llwyth hwnnw, oedd wedi gwrthwynebu Rhufain am bron 30 mlynedd. Sefydlodd ganolfan newydd yng Nghaerllion i\u0027r ail leng, Legio II Augusta, a rhwydwaith o gaerau llai. Cwblhawyd y goncwest dan ei olynydd Agricola. Ychydig cyn iddo gyrraedd Prydain fel llywodraethwr yr oedd yr Ordoficiaid wedi codi mewn gwrthryfel ac wedi llwyr ddinistrio corff o ŵyr meirch. Arweiniodd Agricola ymgyrch yn eu herbyn yn syth ar ôl cyrraedd Prydain, a\u0027u llwyr orchfygu. Yn ôl yr hanesydd Rhufeinig Tacitus, lladdodd bron bob copa gwalltog o\u0027r llwyth, ond o ystyried natur tiriogaeth y llwyth yma prin y byddai hynny\u0027n bosibl. Adeiladodd Agricola gaerau Segontium a Canovium , ac erbyn dechrau 79 yr oedd pob un o\u0027r llwythau wedi ymostwng i Rufain.\r\n\r\n== Caerau a Ffyrdd ==\nPrif erthyglau: Caerau Rhufeinig Cymru a Ffyrdd Rhufeinig Cymru.\n\nGellir meddwl am y caerau a ffyrdd Rhufeinig yng Nghymru fel bocs hirsgwar yn amgylchynu\u0027r mynyddoedd. Roedd caer bwysig ymhob cornel. Yn y de-ddwyrain ceir caer Isca Silurum , ger Casnewydd heddiw. Hon oedd pencadlys y Rhufeiniaid yn y de. Yn y gogledd-ddwyrain dewiswyd safle ger aber Afon Dyfrdwy ar gyfer Deva . Yn y ddwy gaer hyn sefydlwyd pencadlysoedd y llengoedd yng Nghymru, sef y Legio II Adiutrix yn Deva hyd 66 ac yna\u0027r Legio XX Valeria Victrix, a\u0027r Legio II Augusta yn Isca Silurum. Yn y gorllewin roedd caer Segontium yn y gogledd a chaer Maridunum yn y de. Rhwng y caerau yma roedd cyfres o gaerau llai.\nYn cysylltu\u0027r caerau hyn a\u0027i gilydd roedd cyfres o ffyrdd. Yn y gogledd roedd y ffordd yn cysylltu Caer a Segontium, oedd yn mynd heibio Canovium . Roedd Sarn Helen yn rhedeg o Canovium yn y gogledd i Gaerfyrddin, gyda fforch yn arwain i gaer Castell Nedd.\r\n\r\n== Economi ==\nMae\u0027n debyg mai un o\u0027r rhesymau i\u0027r Rhufeiniaid ddod i Gymru oedd y presenoldeb o  fetalau gwerthfawr. Cawsant gopor ar Fynydd Parys, Ynys Môn, arian a phlwm yng ngogledd-ddwyrain Cymru a Gwent, ac aur yn Nolaucothi, Sir Gaerfyrddin.\nNid oedd y Gymru Rufeinig mor gyfoethog a de-ddwyrain talaith Britannia o bell ffordd. Am gyfnod credid mai Venta Silurum , canolfan y Silwriaid, oedd yr unig dref yng Nghymru, ond ymddengys fod tref lai ym  Maridunum hefyd. Tyfodd sefydliadau llai, a elwid yn vicus, o gwmpas rhai o\u0027r caerau eraill megis Segontium a Chaerhun. Roedd y rhain yn ganolfannau ar gyfer masnach.\nDaeth y Rhufeiniaid ag amryw o lysiau llesol gyda nhw gan gynnwys Persli, Saets,Rosmari a Teim.\r\n\r\n== Llywodraeth ==\nRoedd Cymru\u0027n ran o dalaith Britannia yn wreiddiol. Yn ddiweddarach, pan rannwyd y dalaith wreiddiol yn ddwy, roedd yn rhan o Britannia Superior, yna pan rannwyd y rhan Rufeinig o\u0027r ynys yn bedair talaith roedd yn rhan o Britannia Prima, oedd hefyd yn cynnwys de-orllewin Lloegr.\r\n\r\n== Diwedd cyfnod y Rhufeiniaid ==\n\nYn ôl y traddodiad Cymreig, ymadawodd y fyddin Rufeinig o Gymru pan gyhoeddwyd Macsen Wledig , oedd yn gwasanaethu ym Mhrydain, yn ymerawdwr gan ei filwyr. Croesodd Macsen i Gâl gyda byddin fawr i wrthwynebu Gratianus, ymerawdwr y gorllewin, ac ni ddychwelodd y milwyr. Fodd bynnag mae tystiolaeth yn awgrymu presenoldeb filwrol yn Segontium yn y 390au.\nParhaodd dylanwad y Rhufeiniaid hyd yn oed ar ôl i\u0027r milwyr adael. Mae carreg fedd o ddiwedd y 5g yn eglwys Penmachno sy\u0027n taflu goleuni diddorol ar hyn. Mae\u0027n coffhau gwr o\u0027r enw Cantiorix, a ddisgrifir yn yr arysgrif Ladin fel Cantiorix hic iacit/Venedotis cives fuit/consobrinos Magli magistrati, neu mewn Cymraeg \u0022Yma y gorwedd Cantiorix. Roedd yn ddinesydd o Wynedd ac yn gefnder i Maglos yr ynad\u0022. Mae\u0027r cyfeiriadau at \u0022ddinesydd\u0022 ac ynad yn awgrymu parhad y drefn Rufeinig, yng Ngwynedd o leiaf, am gyfnod ar ôl i\u0027r llengoedd adael.",
  "imageNames": [
    "Aerial_view_of_Caerleon_Roman_amphitheatre.jpg",
    "Atlas_Van_der_Hagen-KW1049B11_031-WALLIA_PRINCIPATUS_Vulgo_WALES..jpeg",
    "Britain.Deisi.Laigin.jpg",
    "British.coinage.Roman.invasion.jpg",
    "Pillar_of_Eliseg.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 47,
  "end": 410,
  "categoryId": "lleoedd",
  "id": "rhufeiniaid",
  "label": "Rhufeiniaid "
}