{
  "wikiSummary": "Dechreuodd y Rhyfel Byd Cyntaf yn 1914 a daeth i ben yn 1918. Dyma\u0027r tro cyntaf y defnyddiwyd arfau cemegol a\u0027r tro cyntaf y gollyngwyd bomiau o awyrennau. Y ddwy ochr a ymladdai oedd y Pwerau Canolog ar y llall: Ffrainc, yr Ymerodraeth Brydeinig, Ymerodraeth Rwsia, Brenhiniaeth Serbia, Montenegro, Japan, yr Eidal , Portiwgal , Rwmania , Teyrnas Hijaz , Unol Daleithiau America , Gwlad Groeg a Siam .\nRoedd y Rhyfel Byd Cyntaf yn gyfnod o newidiau mawr, gan roi terfyn ar yr hen drefn a pharatoi\u0027r ffordd i\u0027r drefn newydd. Dyma gyfnod cwymp teuluoedd fel yr Habsburg, y Romanov, a\u0027r Hohenzollern a oedd wedi bod mor ddylanwadol yng ngwleidyddiaeth Ewrop gyda\u0027u gwreiddiau yn mynd yn ôl i ddyddiau y croesgadau.\nAchosodd y rhyfel hon yr Ail Ryfel Byd yn ogystal â Chomiwnyddiaeth a\u0027r Rhyfel Oer ac felly roedd yn ddylanwad sylweddol ar fywyd yr ugeinfed ganrif. Oherwydd y rhyfel daeth cyfnod absoliwtiaeth Ewrop i ben a chafwyd Chwyldro Rwsia. Cwymp yr Almaen oedd achos Natsïaeth a dechrau yr Ail Ryfel Byd ym 1939.\nDyma\u0027r rhyfel modern cyntaf i ddibynnu ar dechnoleg arfau a lledaenu dychryn rhwng pobl cyffredin nad oeddent yn filwyr.",
  "wikiArticle": "Dechreuodd y Rhyfel Byd Cyntaf yn 1914 a daeth i ben yn 1918. Dyma\u0027r tro cyntaf y defnyddiwyd arfau cemegol a\u0027r tro cyntaf y gollyngwyd bomiau o awyrennau. Y ddwy ochr a ymladdai oedd y Pwerau Canolog ar y llall: Ffrainc, yr Ymerodraeth Brydeinig, Ymerodraeth Rwsia, Brenhiniaeth Serbia, Montenegro, Japan, yr Eidal , Portiwgal , Rwmania , Teyrnas Hijaz , Unol Daleithiau America , Gwlad Groeg a Siam .\nRoedd y Rhyfel Byd Cyntaf yn gyfnod o newidiau mawr, gan roi terfyn ar yr hen drefn a pharatoi\u0027r ffordd i\u0027r drefn newydd. Dyma gyfnod cwymp teuluoedd fel yr Habsburg, y Romanov, a\u0027r Hohenzollern a oedd wedi bod mor ddylanwadol yng ngwleidyddiaeth Ewrop gyda\u0027u gwreiddiau yn mynd yn ôl i ddyddiau y croesgadau.\nAchosodd y rhyfel hon yr Ail Ryfel Byd yn ogystal â Chomiwnyddiaeth a\u0027r Rhyfel Oer ac felly roedd yn ddylanwad sylweddol ar fywyd yr ugeinfed ganrif. Oherwydd y rhyfel daeth cyfnod absoliwtiaeth Ewrop i ben a chafwyd Chwyldro Rwsia. Cwymp yr Almaen oedd achos Natsïaeth a dechrau yr Ail Ryfel Byd ym 1939.\nDyma\u0027r rhyfel modern cyntaf i ddibynnu ar dechnoleg arfau a lledaenu dychryn rhwng pobl cyffredin nad oeddent yn filwyr.\r\n\r\n== Colledion ==\n\nLladdwyd mwy na 9 miliwn o filwyr yn ystod y brwydrau a bron cynifer o bobl cyffredin o achos newyn, hil-laddiad a bomiau.\n\nGwasanaethodd 272,924 o Gymry yn y fyddin Brydeinig – sef 21.5 o holl wrywod Cymru – a lladdwyd 40,000 ohonynt ). Erbyn Ionawr 1916 pan gyflwynwyd gorfodaeth filwrol roedd 122,986 wedi gwirfoddoli. Llwyddodd John Williams, Brynsiencyn ac eraill i berswadio nifer o Gymry i ymuno. Roedd gwrthwynebu cydwybodol yn uwch yng Nghymru nag yn Lloegr. Yn yr ardaloedd Cymraeg eu hiaith yr oedd y niferoedd prinnaf o recriwtiaid drwy gwledydd Prydain hefyd a gwnaed llai o Gymry yn swyddogion nag unrhyw wlad arall.\r\n\r\n== Ras arfau yn Ewrop ==\nRoedd ras arfau milwrol wedi tyfu ac wedi dwysau erbyn 1906 rhwng Prydain a\u0027r Almaen. Roedd adeiladu\u0027r llong ryfel HMS Dreadnought wedi peri i\u0027r holl longau rhyfel blaenorol fod yn ddiwerth.\r\n\r\n== Dechrau\u0027r rhyfel ==\n\nYn 1914 roedd nifer o gytundebau milwrol rhwng gwledydd Ewrop, yn arbennig cytundeb rhwng yr Almaen ac Awstria-Hwngari a chytundeb rhwng Ffrainc, y Deyrnas Unedig a Rwsia. Y digwyddiad a ddechreuodd y broeses a arweiniodd at y rhyfel oedd llofryddiaeth yr Archddug Franz Ferdinand, a etifedd coron Awstria, a\u0027i wraig Sofía Chotek, yn Sarajevo ar 28 Mehefin 1914 gan fyfyriwr Serbaidd ieuanc o\u0027r enw Gavrilo Princip. Gyda chefnogaeth yr Almaen, gyrrodd Awstria-Hwngari restr o bethau y byddai\u0027n rhaid i Serbia gytuno iddynt neu wynebu ymosodiad. Pan na chafwyd ateb boddhaol gan Serbia, ymosododd Awstria ar Serbia ar yr 29 Gorffennaf 1914.\nWedi dechrau\u0027r rhyfel rhwng Awstria-Hwngari a Serbia, canlyniad y gwahanol gytundebau milwrol oedd fod yr Almaen yn dod i mewn i\u0027r rhyfel ar ochr Awstria-Hwngari – ac i Ffrainc a Rwsia ddod i mewn ar ochr Serbia erbyn 3 Awst 1914. Trannoeth ymunodd Prydain a\u0027r rhyfel ar ochr Ffrainc a Rwsia.\r\n\r\n== Cwrs y rhyfel ==\n\n\n=== 1914 ===\nCafodd yr Almaen fuddugoliaethau cynnar ar y ffrynt gorllewinol ym Mrwydr y Ffiniau . Fodd bynnag, ymosododd Rwsia yn y dwyrain, gan orfodi\u0027r Almaen i symud milwyr a fwriedid i atgyfnerthu\u0027r ffrynt gorllewinol i\u0027r dwyrain. Enillodd yr Almaen dan Paul von Hindenburg fuddugoliaeth dros Rwsia mewn cyfres o frwydrau a adnabyddir fel Brwydr Gyntaf Tannenberg , ond oherwydd yr angen i drosglwyddo adnoddau i\u0027r dwyrain ac arafwch symud adnoddau i\u0027r ffrynt, a oedd yn dibynnu yn helaeth ar geffyl a throl, ni allwyd gweithredu Cynllun Schlieffen yn llawn. Ym Mrwydr Gyntaf y Marne , llwyddodd byddin Ffrainc, gyda pheth cymorth o Brydain, i atal ymosodiad yr Almaen.\nYm Mrwydr Gyntaf Ypres llwyddodd y Prydeinwyr a\u0027u cynghreiriad i atal yr ymosodiad Almaenig ond roedd y colledion ar y ddwy ochr yn anferth. Ym mis Tachwedd ymunodd Ymerodraeth yr Otomaniaid a\u0027r rhyfel ar ochr yr Almaen ac Awstria-Hwngari.\n\n\n=== 1915 ===\n\nCeisiodd byddin yr Ymerodraeth Brydeinig, milwyr o Awstralia a Seland Newydd yn bennaf, gipio Penrhyn Gallipoli yn Chwefror 1915. Y bwriad oedd cipio Istanbul, prifddinas Ymerodraeth yr Otomaniaid. Byddai hyn wedi agor y culfor sy\u0027n arwain i\u0027r Môr Du, a\u0027i gwneud yn bosibl i yrru adnoddau rhyfel i gynorthwyo Rwsia.\nParhaodd Brwydr Gallipoli hyd Ionawr 1916, pan orfododd y Twrciaid y cyngheiriaid i encilio. Gwnaeth y frwydr yma Mustafa Kemal Atatürk yn arwr cenedlaethol yn Nhwrci.\nAr 7 Mai suddwyd y llong Brydeinig Lusitania yn ddirybudd gan dorpedo a daniwyd gan y llong danfor Almaenig U-20 gyferbyn a Kinsale ar arfordir deheuol Iwerddon. Collwyd 1198 o fywydau; tua 228 ohonynt yn ddinasyddion Americanaidd. Gwaethygodd hyn y berthynas rhwng yr Almaen a\u0027r Unol Daleithiau yn fawr.\nAr 9 Mai ymosododd lluoedd Prydain a Ffrainc yn Artois; parhaodd Brwydr Lens hyd ganol Mehefin, ond cafwyd colledion mawr heb fedru torri trwodd.\n\n\n=== 1916 ===\n\nErbyn dechrau 1916, roedd y sefyllfa ar y ffrynt gorllewinol wedi sefydlogi, a nifer o ymdrechion gan y ddwy ochr i dorri trwodd wedi methu. Penderfynodd pennaeth y fyddin Almaenig, Erich von Falkenhayn, ymosod ar ardal Verdun. Roedd Brwydr Verdun, rhwng 21 Chwefror ac 18 Rhagfyr, yn un o frwydrau pwysicaf y rhyfel ac un o\u0027r rhai mwyaf gwaedlyd; lladdwyd dros chwarter miliwn o filwyr ar y ddwy ochr a chlwyfwyd o leiaf filiwn.\nAr ddechrau\u0027r ymosodiad, enillodd yr Almaenwyr lawer o diriogaeth. Ar 25 Chwefror cipiasant Fort Douaumont. Apwyntiwyd y cadfridog Philippe Pétain i fod yn gyfriol am yr amddiffyniad Ffrengig, a llwyddwyd i arafu ymosodiad yr Almaenwyr. Galluogodd hyn y Ffrancwyr i ddod a mwy o filwyr ac adnoddau rhyfel i faes y gad ar hyd y Voie Sacrée.\nParhaodd yr ymosodiadau am fisoedd, gyda cholledion enbyd ar y ddwy ochr. Ar 1 Mai cymerodd y cadfridog Robert Nivelle le\u0027r cadfridog Pétain. Ar 22 Mehefin 1916, defnyddiodd yr Almaenwyr nwy gwenwynig am y tro cyntaf yn y rhyfel.\nAr 1 Gorffennaf dechreuodd Brwydr y Somme, oedd wedi ei bwriadu i geisio lleihau\u0027r pwysau ar Verdun. Lladdwyd neu anafwyd mwy na miliwn a hanner o filwyr ym Mrwydr y Somme, a barhaodd hyd fis Tachwedd. Ceisiodd y Cyngheiriaid, unedau Prydeinig yn bennaf ond gyda rhai Ffrenngig, dorri trwy\u0027r llinellau Almaenig ar hyd ffrynt 12 milltir o hyd i\u0027r gogledd a\u0027r de o Afon Somme yng ngogledd Ffrainc. Cofir y frwydr yn bennaf am ei diwrnod cyntaf, 1 Gorffennaf 1916, pan gollodd y fyddin Brydeinig 67,470 o filwyr, 19,240 wedi eu lladd; y nifer uchaf yn ei hanes.\nGwrth-ymosododd y Ffrancwyr yn Verdun ar 21 Hydref 1916, a chipiasant Fort Douaumont ar 24 Hydref. Erbyn ymosodiad olaf y Ffrancwyr a ddechreuodd ar 11 Rhagfyr, roedd yr Almaenwyr wedi eu gyrru yn ôl bron i\u0027w man cychwyn. Ar 6 Rhagfyr daeth David Lloyd George yn Brif Weinidog y Deyrnas Unedig.\n\n\n=== 1917 ===\n\nYn Rwsia, arweiniodd prinder bwyd ac anfodlonrwydd ynghylch rôl y wlad yn ystod y rhyfel at Chwyldro Chwefror ym 1917, pan sefydlwyd llywodraeth ddemocrataidd yn lle teyrnas y Tsar Nicholas II o Rwsia. Yn ystod yr ail gyfnod, Chwyldro Hydref, sefydlodd y sofietau lywodraeth dros dro dan arweiniad Lenin. Ar 7 Tachwedd, 1917 dymchwelwyd y llywodraeth dros dro o dan Aleksandr Kerensky gan chwyldrowyr Lenin.\nAr 6 Ebrill cyhoeddodd yr Unol Daleithiau ryfel yn erbyn yr Almaen, yn bennaf oherwydd ymosodiadau llongau tanfor yr Almaen ar ei llongau. Ar 9 Ebrill dechreuodd milwyr Prydeinig, Canadaidd ac Awstralaidd yr ymosodiad a elwur yn Frwydr Arras. Parhaodd hyd 16 Mai; enillwyd rhywfaint o dir ond ni lwyddwyd i dorri trodd.\nGwelodd Brwydr Cambrai y defnydd llwyddiannus cyntaf o danciau gan y fyddin Brydeinig. Enillwyd llawer o diriogaeth yn rhan gyntaf y frwydr wrth eu defnyddio, ond ail-gipiwyd bron y cyfan gan wrth-ymosodiad Almaenig yn ddiweddarch.\n\n\n=== 1918 ===\n\nYn dilyn y chwyldro yn Rwsia, arwyddwyd Cytundeb Brest-Litovsk rhwng Rwsia a\u0027r Almaen ar 3 Mawrth. Collodd Rwsia nifer o diriogaethau yn gyfnewid am heddwch. Galluogodd hyn yr Almaen i symud milwyr i\u0027r ffrynt gorllewinol. Ar yr ochr arall, roedd nifer gynyddol o filwyr yr Unol Daleithiau yn ymuno a\u0027r ymladd.\nAr 21 Mawrth, dechreuodd y fyddin Almaenig dan y cadfridog Erich Ludendorff ymosodiad newydd yn y gorllewin, i geisio rhoi diwedd ar y rhyfel cyn i fwy o luoedd yr Unol Daleithiau gyrraedd. Cawsant gryn lwyddiant, a dynesodd y ffrynt hyd at 120 km o ddinas Paris. Ar ôl ymladd caled, llwyddodd y cyngheiriaid i sefydlogi\u0027r ffrynt.\nDechreuodd gwrthymosodiad y cyngheiriaid ar 8 Awst, gyda byddinoedd Prydain, Ffrainc, Awstralia a Chanada yn cymryd rhan ym Mrwydr Amiens, gyda 414 o danciau a 120,000 o filwyr. Erbyn yr Hydref, roedd gallu\u0027r Akmaen a\u0027i chyngheiriaid i barhau\u0027r rhyfel bron ar ben. Arwyddodd Bwlgaria gadoediad ar 29 Medi, ac ar 30 Hydref ildiodd Ymerodraeth yr Ottomaniaid. Ar 24 Hydref dechreuodd byddin yr Eidal ymosodiad newydd yn erbyn Awstria-Hwngari, a dinistriwyd byddin Awstria-Hwngait ym Mrwydr Vittorio Veneto. Ar 3 Tachwedd gofynnodd Awstria-Hwngari am gadoediad,\nBu chwyldro yn yr Almaen, a chyhoeddwyd gweriniaeth ar 9 Tachwedd; ffôdd y Kaiser Wilhelm II i\u0027r Iseldiroedd. Arwyddwyd cadoediad a\u0027r Almaen yn Compiègne, ac am unarddeg y bore ar 11 Tachwedd 1918 daeth y rhyfel i ben.\nAr 28 Mehefin 1919, arwyddwyd Cytundeb Versailles rhwng yr Almaen a\u0027r Cyngheiriaid yn sgîl Cynhadledd Heddwch Paris 1919. Yn ddiweddarach arwyddwyd cytundebau ag Awstria, Hwngari, Bwlgaria ac Ymerodraeth yr Ottomaniaid.\r\n\r\n== Brwydrau pwysig y Rhyfel Byd Cyntaf ==\n1914\n12 Awst – Brwydr Cer\n14 Awst – 2 Medi - Brwydr Tannenberg\n17 Awst – Brwydr Stalluponen\n21 Awst – Brwydr yr Ardennes\n23 Awst – Brwydr Mons\n28 Awst – Brwydr Heligoland\nMedi – Brwydr Gyntaf y Marne\n31 Hydref-22 Tachwedd – Brwydr Gyntaf Ypres\n1 Tachwedd – Brwydr Coronel\n11 Tachwedd – Brwydr Lodz\n1915\n22 Ebrill – 25 Mai – Ail Frwydr Ypres\n9 Mai – Ail Frwydr Artois\n6 Awst – Brwydr Sari Bair\n25 Medi-28 Medi – Brwydr Loos\n1916\nChwefror-Rhagfyr – Brwydr Verdun\n27 Ebrill – Brwydr Hulluch\n31 Mai – Brwydr Jutland\n7 Gorffennaf – Brwydr Coed Mametz\n27 Hydref – Brwydr Segale\nBrwydr y Somme 1916\n23 Rhagfyr – Brwydr Magdhaba\n1917\n26 Mawrth – Brwydr Gyntaf Gaza\n31 Gorffennaf – 10 Tachwedd – Brwydr Passchendaele 24 Hydref-9 Tachwedd – Brwydr Caporetto\n1918\nBrwydr Gyntaf y Somme  – Yr enw Saesneg ar ymosodiad yr Almaen.\n1 Mehefin – Brwydr Coed Belleau\n15 Gorffennaf – Ail Frwydr y Marne\nAil Frwydr y Somme  – ail ran o ymosodiad Prydain yn Picardy yn ystod y Can Niwrnod.\nAwst – Brwydr Amiens\nMedi – Brwydr Megiddo\r\n\r\n== Llenyddiaeth y Rhyfel ==\n\nY bardd Cymraeg a gysylltir yn arbennig a\u0027r rhyfel yw Hedd Wyn , brodor o Drawsfynydd, a aeth yn filwr ym 15fed Bataliwn y Ffiwsilwyr Cymreig yn 1917 ac a laddwyd ym Mrwydr Cefn Pilkem ar 31 Gorffennaf yn yr un flwyddyn. Enillodd gadair Eisteddfod Genedlaethol Cymru Penbedw 1917 am ei awdl \u0022Yr Arwr\u0022, er iddo gael ei ladd chwe mis ynghynt yn Ypres. Pan gyhoeddwyd ei fod wedi\u0027i ladd yn y frwydr honno gorchuddiwyd y gadair â llen ddu. Dyna pam y cyfeirir at yr eisteddfod honno fel Eisteddfod y Gadair Ddu. Ysgrifennodd y bardd Robert Williams Parry gyfres nodedig o englynion er cof amdano, sy\u0027n dechrau gyda\u0027r linell cofiadwy \u0022Y bardd trwm dan bridd tramor.\u0022\nMae\u0027r nofel Plasau\u0027r Brenin gan Gwenallt yn seiliedig ar brofiad yr awdur fel carcharor cydwybodol oherwydd iddo wrthwynebu gwasanaethu yn y lluoedd arfog am ei ddaliadau fel heddychwr. Nofel Gymraeg arall sy\u0027n deillio o\u0027r rhyfel yw Amser i Ryfel gan T. Hughes Jones.\nYmhlith beirdd Saesneg y rhyfel, roedd Rupert Brooke, Wilfred Owen, Siegfried Sassoon ac Isaac Rosenberg. Yr enwocaf o\u0027r nofelau a ysbrydolwyd gan y rhyfel oedd nofel Almaeneg gan Erich Maria Remarque, Im Westen nichts Neues , a gyhoeddwyd fel llyfr yn gynnar yn 1929 ac a oedd eisoes wedi ei throsi i 26 o ieithoedd erbyn diwedd y flwyddyn honno.\r\n\r\n== Gwledydd Prydain, yn dilyn y Rhyfel ==\nYn Rwsia, arweiniodd yr holl golledion, a\u0027r holl filitariaeth at syrffed at ryfel, sosialaeth ac yn y diwedd gwelwyd twf y Chwyldro Bolsieficiaidd, gyda\u0027i ddylanwad ar lawer o wledydd gan gynnwys Cymru. Er i Lloyd-George ddod yn arwr Prydeinig, rhannwyd y Blaid Rhyddfrydol oherwydd ei safiad dros orfodaeth filwrol, a\u0027r holl golledion a dirywiodd y blaid wedi\u0027r Rhyfel. Cafwyd streic gan y glowyr yng Ngorffennaf 1915 a arweiniodd at wladoli\u0027r diwydiant ac unwyd yr undebau llafur mewn modd nas gwelwyd cyn hynny. Oherwydd fod llynges Prydain mor ddibynol ar lo fel tanwydd, roedd sicrhau cydweithrediad y glowyr yn hanfodol. Gwelwyd menywod yn parhau mewn swyddi – a chafodd hyn ddylanwad aruthrol ar agweddau cymdeithasol yr 20g. Tyfodd y Blaid Lafur a oedd am ddefnyddio\u0027r wladwriaeth i ddileu tlodi a diweithdra. Yn dilyn y cytundebau heddwch, gwelwyd nifer o wledydd bychan canolbarth a dwyrain Ewrop yn derbyn pwerau ychwanegol – ffactor a gafodd gryn effaith ar dwf cenedlaetholdeb Cymru, yr Alban ac Iwerddon.\r\n\r\n== Nofelau ==\nAll Quiet on the Western Front. Erich Maria Remarque 1929. Original German – Im Westen nichts Neues\nBirdsong – Sebastian Faulks. 1993\r\n\r\n== Barddoniaeth ==\n\n\n=== Cymraeg ===\nAlbert Evans-Jones – Telyn y Nos Hedd Wyn – Cerddi\u0027r Bugail === Almaeneg ===\nAugust Stramm – Du === Ffrangeg ===\nGuillaume Apollinaire – Calligrammes, poèmes de la paix et de la guerre 1913–1916 === Saesneg ===\nDavid Jones – In Parenthesis Francis Ledwidge – Songs of the Fields John Masefield – \u0022August 1914\u0022\nJohn McCrae – \u0022In Flanders Fields\u0022\nWilfred Owen – Poems Siegfried Sassoon\nThe Old Huntsman Counter-Attack and Other Poems == Beirniadaeth lenyddol ==\nWilliams, Gerwyn Y rhwyg: arolwg o farddoniaeth Gymraeg ynghylch y Rhyfel Byd Cyntaf ISBN 0-86383-999-1",
  "imageNames": [
    "12pdr8cwtFortDachangCameroons1915.jpg",
    "1914-06-29_-_Aftermath_of_attacks_against_Serbs_in_Sarajevo.png",
    "1917_ortler_vorgipfelstellung_3850_m_highest_trench_in_history_of_first_world_war.jpg",
    "1stGazaBritishPrisoners00118v.jpg",
    "Affiche-guerre_Femmes-au-travail.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1914,
  "end": 1918,
  "categoryId": "milwrol",
  "id": "rhyfel-byd-cyntaf",
  "label": "Rhyfel Byd Cyntaf"
}