{
  "wikiSummary": "Darlledwr sy\u0027n darparu gwasanaethau teledu yn y Gymraeg yw Sianel Pedwar Cymru neu S4C. Dechreuodd ddarlledu ar y 1af Tachwedd 1982. SuperTed oedd y rhaglen gyntaf i\u0027w ddarlledu ar S4C.\nSefydlwyd S4C gan Ddeddfau Darlledu 1980/1981. Cychwynodd y sianel wreiddiol ar deledu analog yn 1982, lle roedd yn gyfrifol am ddarlledu rhaglenni Cymraeg yn ystod oriau brig a rhaglenni Channel 4 am weddill yr amser. Yn dilyn y newid i deledu digidol, daeth yn sianel uniaith Gymraeg. Nid yw S4C yn cynhyrchu rhaglenni ei hun, ond yn eu comisiynu oddi wrth gwmnïau annibynnol. Yn yr 1980au cafodd y sianel enw da am gomisiynu cartwnau a ddaeth yn llwyddiannau byd-eang megis SuperTed, Sam Tân, Shakespeare - The Animated Tales. Mae\u0027r sianel hefyd yn nodedig am ddramau o safon uchel sydd wedi llwyddo yn rhyngwladol, yn cynnwys Y Gwyll, 35 Diwrnod ac Un Bore Mercher. Mae rhaglenni chwaraeon yn denu nifer fawr o wylwyr i\u0027r sianel ac er y gystadleuaeth frwd am hawliau chwaraeon gan sianel masnachol, mae S4C yn ceisio darparu amrywiaeth o chwaraeon yn cynnwys pêl-droed a rygbi.\nGoruwchwylir y gwasanaeth gan Adran Ddigidol, Diwylliant, Cyfryngau a Chwaraeon yn San Steffan. Roedd yr adran yn arfer ariannu\u0027r sianel yn llawn ond ers 2010 torrwyd y grant i tua £6.8m y flwyddyn a daw gweddill cyllid S4C drwy\u0027r BBC a\u0027r drwydded deledu. Mae S4C hefyd yn derbyn arian am werthu hysbysebion ond bu gostyngiad yn lefel yr incwm o hysbysebu wrth i wylwyr droi at ddulliau digidol o dderbyn eu gwasanaethau teledu, gan mai dim ond ar analog yr oedd S4C yn gallu gwerthu hysbysebion o gwmpas rhaglenni Saesneg Channel 4. Ar ôl diffodd analog mae\u0027r Sianel yn ceisio incwm masnachol o sawl ffynhonnell yn cynnwys hysbysebion ar y teledu ac ar wasanaethau arlein; drwy bartneriaethau masnachol; gwerthiant rhaglenni a chyd-gynhyrchu ac ecwiti mewn prosiectau a chwmniau digidol.\nMae\u0027r BBC yn cyflawni ei ddyletswydd gyhoeddus trwy gynhyrchu deg awr o raglenni bob wythnos, gan gynnwys rhaglenni poblogaidd megis Pobol y Cwm a Newyddion. Fel gweddill gwasanaethau cyhoeddus y BBC, mae\u0027r rhain yn cael eu hariannu drwy\u0027r drwydded deledu.",
  "wikiArticle": "Darlledwr sy\u0027n darparu gwasanaethau teledu yn y Gymraeg yw Sianel Pedwar Cymru neu S4C. Dechreuodd ddarlledu ar y 1af Tachwedd 1982. SuperTed oedd y rhaglen gyntaf i\u0027w ddarlledu ar S4C.\nSefydlwyd S4C gan Ddeddfau Darlledu 1980/1981. Cychwynodd y sianel wreiddiol ar deledu analog yn 1982, lle roedd yn gyfrifol am ddarlledu rhaglenni Cymraeg yn ystod oriau brig a rhaglenni Channel 4 am weddill yr amser. Yn dilyn y newid i deledu digidol, daeth yn sianel uniaith Gymraeg. Nid yw S4C yn cynhyrchu rhaglenni ei hun, ond yn eu comisiynu oddi wrth gwmnïau annibynnol. Yn yr 1980au cafodd y sianel enw da am gomisiynu cartwnau a ddaeth yn llwyddiannau byd-eang megis SuperTed, Sam Tân, Shakespeare - The Animated Tales. Mae\u0027r sianel hefyd yn nodedig am ddramau o safon uchel sydd wedi llwyddo yn rhyngwladol, yn cynnwys Y Gwyll, 35 Diwrnod ac Un Bore Mercher. Mae rhaglenni chwaraeon yn denu nifer fawr o wylwyr i\u0027r sianel ac er y gystadleuaeth frwd am hawliau chwaraeon gan sianel masnachol, mae S4C yn ceisio darparu amrywiaeth o chwaraeon yn cynnwys pêl-droed a rygbi.\nGoruwchwylir y gwasanaeth gan Adran Ddigidol, Diwylliant, Cyfryngau a Chwaraeon yn San Steffan. Roedd yr adran yn arfer ariannu\u0027r sianel yn llawn ond ers 2010 torrwyd y grant i tua £6.8m y flwyddyn a daw gweddill cyllid S4C drwy\u0027r BBC a\u0027r drwydded deledu. Mae S4C hefyd yn derbyn arian am werthu hysbysebion ond bu gostyngiad yn lefel yr incwm o hysbysebu wrth i wylwyr droi at ddulliau digidol o dderbyn eu gwasanaethau teledu, gan mai dim ond ar analog yr oedd S4C yn gallu gwerthu hysbysebion o gwmpas rhaglenni Saesneg Channel 4. Ar ôl diffodd analog mae\u0027r Sianel yn ceisio incwm masnachol o sawl ffynhonnell yn cynnwys hysbysebion ar y teledu ac ar wasanaethau arlein; drwy bartneriaethau masnachol; gwerthiant rhaglenni a chyd-gynhyrchu ac ecwiti mewn prosiectau a chwmniau digidol.\nMae\u0027r BBC yn cyflawni ei ddyletswydd gyhoeddus trwy gynhyrchu deg awr o raglenni bob wythnos, gan gynnwys rhaglenni poblogaidd megis Pobol y Cwm a Newyddion. Fel gweddill gwasanaethau cyhoeddus y BBC, mae\u0027r rhain yn cael eu hariannu drwy\u0027r drwydded deledu.\r\n\r\n== Hanes ==\n\n\n=== Ymgyrch y sianel ===\nCyn sefydlu S4C roedd Cymry Cymraeg yn ddibynnol ar raglenni achlysurol ar BBC Cymru a HTV Cymru, yn aml yn hwyr yn y nos neu adegau amhoblogaidd eraill. Roedd hyn yn annerbyniol i\u0027r Cymry Cymraeg ac i\u0027r di-Gymraeg hefyd am fod rhaglenni Saesneg o weddill Prydain yn cael eu darlledu ar amseroedd gwahanol neu ddim o gwbl.\nDros y 1970au bu ymgyrchwyr iaith yn brwydro dros gael gwasanaeth teledu Cymraeg. Gwrthodwyd talu\u0027r drwydded deledu gan Gymry amlwg, torrwyd i mewn i stiwdios teledu a bu protestwyr hyd yn oed yn dringo mastiau a distrywio cyfarpar darlledu. Yn 1980 gwnaeth Gwynfor Evans fygwth ymprydio hyd at farwolaeth ar ôl i Lywodraeth Margaret Thatcher fynd yn ôl ar addewid a wnaethant i roi sianel Gymraeg i Gymru. Ar ôl i Gymry amlwg megis Archesgob Cymru ar y pryd, Cledwyn Hughes a Goronwy Daniel fynd i gyfarfod ag aelod o\u0027r cabinet fe newidiodd Margaret Thatcher ei meddwl ac fe gytunwyd i sefydlu\u0027r sianel.\n\n\n=== Newid i ddigidol ===\nYn 1998 lansiwyd gwasanaeth teledu digidol daearol a llwyfan lloeren Sky ar draws y DU. Ar y gwasanaeth daearol cafodd S4C ei wobrwyo gyda hanner Amlblecs A. Sefydlwyd cwmni S4C Digital Networks i werthu\u0027r gofod hwn ac y tu allan i Gymru llogwyd y gofod i sawl darlledwr yn cynnwys QVC. Cychwynwyd darlledu sianel uniaith Gymraeg S4C Digidol, ac S4C2, a oedd yn darlledu cyfarfodydd Cynulliad Cenedlaethol Cymru. Roedd S4C Digidol ac S4C2 ar gael drwy wledydd Prydain drwy loeren, yn ogystal â thrwy Gymru ar TDD ac ar wasanaeth cebl Virgin Media mewn rhannau o Dde Cymru. Wedi cwblhau y newid i ddigidol yng Nghymru ar 31 Mawrth 2010, caewyd hen wasanaeth analog S4C gan adael y gwasanaeth S4C Digidol fel y brif sianel Gymraeg.\nAr yr adegau pan nad oedd sianel analog S4C yn darlledu yn Gymraeg dangoswyd rhaglenni Channel 4 a gynhyrchwyd i weddill y Deyrnas Unedig, ond daeth hyn i ben pan diffoddwyd teledu analog yng Nghymru yn 2009 a 2010 fel rhan o\u0027r Newid i Ddigidol yng ngwledydd Prydain.\n\n\n=== Adleoli Pencadlys S4C ===\n\nYm mis Medi 2013 cychwynodd S4C astudiaeth i\u0027r posibilrwydd o symud eu pencadlys. Ym mis Mawrth 2014 cyhoeddwyd mai Caerfyrddin oedd yn fuddugol gyda chais a arweiniwyd gan Brifysgol Cymru Y Drindod Dewi Sant. Y Brifysgol sydd berchen y tir lle adeiladwyd Canolfan S4C Yr Egin a mae\u0027r adeilad hefyd yn gartref i gwmnïau eraill yn y diwydiannau creadigol. Cafwyd cais cryf ar gyfer adleoli i Gaernarfon ond roedd siom nad oedd y cais yn llwyddiannus.\nYn 2016 datgelwyd fod S4C yn talu £3 miliwn o rent rhag-blaen i Brifysgol Y Drindod Dewi Sant, bydd yn talu am rhent dros yr 20 mlynedd dilynol. Mynegwyd pryder am y trefniant a\u0027r diffyg tryloywder ynghylch taliadau masnachol rhwng dau gorff sy\u0027n derbyn arian cyhoeddus. Gwnaed cais gan Brifysgol Cymru Y Drindod Dewi Sant am arian at y gwaith adeiladu a cafwyd £3 miliwn gan Lywodraeth Cymru a £3m arall o fargen ddinesig Bae Abertawe.\nYm Mehefin 2018 datgelwyd y bydd mwy o staff yn gadael y sianel na\u0027r rhai fyddai\u0027n symud i weithio yng Nghaerfyrddin. Cychwynnodd S4C adleoli i\u0027r adeilad newydd o fis Medi 2018 a byddai 54 o swyddi yn symud i\u0027r ganolfan. Cadwyd swyddfa yng Nghaerdydd ar gyfer dibenion technegol, wedi ei gyd-leoli ym Pencadlys newydd BBC Cymru gyda 70 o staff yno, ond bydd canran sylweddol o\u0027r swyddi technegol yn trosglwyddo i\u0027r BBC. Er hyn, ni fyddai BBC Cymru yn symud ei stiwdio yng Nghaerfyrddin i\u0027r Egin. Yn Medi 2018, ymrwymodd S4C i ddeg mlynedd o les ar ei swyddfa yng Nghaernarfon, sydd a 12 o staff llawn amser.\nYn 2021 symudodd adrannau Cyflwyno, Llyfrgell, Hyrwyddo a Masnachol S4C i bencadlys BBC Cymru yn Sgwâr Canolog, Caerdydd. Y rhaglenni cyntaf a ddarlledwyd oddi yno oedd gwasanaeth plant y sianel, Cyw am 6:00. Daeth y cyflwyniad byw cyntaf gan Liz Scourfield ar 27 Ionawr 2021 cyn y bwletin newyddion am 12:00.\n\n\n=== Lledaenu llwyfannau ===\nYn 2008 lansiwyd gwasanaeth i blant ar y sianel o\u0027r enw Cyw, gyda chwech awr a hanner o raglenni bob dydd o ddydd Llun i Ddydd Gwener.\nYn 2016 lansiwyd cyfres i bobl ifanc rhwng 16-35 oed. Roedd y cynnwys ar gael ar YouTube gyda pob rhaglen yn bum munud o hyd. Yn dilyn y cynllun peilot, lansiwyd gwasanaeth Hansh yn Mehefin 2017, gyda cynnwys digidol ar sawl cyfrwng cymdeithasol yn cynnwys YouTube, Facebook, Twitter ac Instagram.\nYn 2019 lansiwyd Lŵp sy\u0027n Sianel ar-lein traws blatfform ar gyfer cerddoriaeth a diwylliant cyfoes Cymraeg gan S4C. Fe\u0027i lansiwyd ym mis Awst 2019. Mae\u0027r gwasanaeth i\u0027w weld ar S4C Clic, BBC iPlayer a llwyfannau rhyngrwyd eraill sy\u0027n annibynnol o\u0027r Sianel, fel Youtube, a chyfryngau cymdeithasol megis Facebook, Twitter, TikTok ac ati.\nYn 2021 lansiwyd gwasanaeth Newyddion S4C sy\u0027n wasanaeth ar-lein yn annibynnol ar ddarpariaeth rhaglen deledu Newyddion. Mae\u0027r gwasanaeth newydd yno i lenwi bwlch wrth i arferion gwylio newyddion ar y teledu yn ôl ymchwil S4C fod yn parth i bobl dros 65 oed, tra bod pobl iau yn derbyn ei newyddion drwy\u0027r cyfryngau cymdeithasol . Mae gwasanaeth Newyddion S4C yn derbyn newyddion gan y BBC, Golwg360, ITV Cymru Wales a ffrydiau annibynnol eraill.\r\n\r\n== Helyntion ==\n\n\n=== 2010 - Argyfwng ariannol ===\nYn dilyn Etholiad Cyffredinol 2010 ar 6 Mai 2010 ffurfiwyd llywodraeth glymblaid rhwng y Ceidwadwyr a\u0027r Democratiaid Rhyddfrydol. Cychwynodd cyfnod o lymder gyda thoriadau mawr mewn gwariant cyhoeddus.\nAr 28 Gorffennaf 2010, cyhoeddwyd fod Iona Jones wedi gadael S4C. Ni roddwyd unrhyw esboniad am ei hymddiswyddiad. Mewn cyfweliad gyda\u0027r Guardian yng Nghorffennaf 2010, esboniodd Iona fod cadeirydd awdurdod S4C wedi gofyn iddi lunio cynigion ar gyfer toriadau, ac aeth drwy rai ohonynt. Cyn cyflwyno ei chynlluniau, rhybuddiodd nad oedd model S4C \u0022wedi ei gynllunio ar gyfer dirwasgiad economaidd\u0022. Fe\u0027i diswyddwyd o fewn wythnos.\nAr 20 Hydref 2010 cyhoeddodd Canghellor y DU George Osborne AS y byddai\u0027r cyfrifoldeb am ariannu S4C yn cael ei drosglwyddo i\u0027r BBC. Roedd hyn yn dilyn cyfres o drafodaethau rhwng Adran Ddigidol, Diwylliant, Cyfryngau a Chwaraeon llywodraeth y DU a\u0027r BBC. Doedd S4C na llywodraeth Cymru yn gwybod dim am y trafodaethau hyn ac roedd y cyhoeddiad yn gwbl annisgwyl iddynt. Clywodd John Walter Jones, Cadeirydd S4C, amdano am y tro cyntaf pan oedd yn gwrando ar Radio Cymru. Dywedodd \u0022Rydw i\u0027n rhyfeddu at yr agwedd sarhaus mae Llywodraeth Llundain wedi\u0027i dangos, nid yn unig tuag at S4C, ond hefyd tuag at bobl Cymru ac i\u0027r iaith.\u0022 Disgrifiodd Cymdeithas yr Iaith y penderfyniad fel \u0022anghredadwy\u0022 gan rybuddio fod hyn yn mynd â darlledu Cymraeg \u0022yn ôl i\u0027r 1970au pan nad oedd S4C yn bodoli. Y gwir yw, erbyn 2015, mae\u0027n bosib fydd na ddim sianel ar ôl i\u0027r BBC gymryd drosodd oherwydd toriadau Jeremy Hunt.\u0022  Cyhoeddodd Awdurdod S4C eu bod am wneud cais am adolygiad barnwrol o\u0027r modd y penderfynwyd ar y newidiadau hyn a\u0027r sail cyfreithiol iddynt. Ymateb Gweinidog Treftadaeth Cymru, Alun Ffred Jones AC, oedd fod y penderfyniad i newid y drefn o ariannu S4C yn \u0022gywilyddus\u0022. Ychwanegodd nad oedd unrhyw drafodaeth wedi bod, a\u0027i fod yn dal heb gael gwybod yn swyddogol am y penderfyniad. Dywedodd ei fod yn \u0022ddiwrnod du\u0022 i Gymru.\nAr 25 Hydref cafwyd ymateb swyddogol Bwrdd yr Iaith Gymraeg. Dywedodd Cadeirydd y Bwrdd, Meri Huws, fod y penderfyniad yn un \u0022cwbl sarhaus\u0022 ac y byddai\u0027n cael \u0022effaith andwyol\u0022 ar yr iaith Gymraeg. Datganodd:\n\n\u0022Dros y degawdau diwethaf, fe ddaeth S4C â statws i\u0027r iaith, a hynny drwy gyfoeth y rhaglenni a\u0027r ffilmiau yr oedd yn ei darlledu. Lle\u0027r oedd corff annibynnol yn gwneud penderfyniadau darlledu yn seiliedig ar arbenigedd mewn cynllunio ieithyddol, bellach mae dryswch llwyr. Trwy gynnal eu trafodaethau y tu ôl i ddrysau caeedig yn Llundain, mae\u0027r Llywodraeth Brydeinig wedi tanseilio a sarhau holl ddarlledu yng Nghymru.\u0022\nYchwanegodd:\n\n\u0022Maen nhw wedi ein hamddifadu o unrhyw gynllunio hirdymor ar gyfer darlledu trwy gyfrwng y Gymraeg, a\u0027n cyfyngu i ryw dair neu bedair blynedd yn unig. Fe gymerodd hi flynyddoedd o ymgyrchu i sefydlu\u0027r Sianel, a bu hi\u0027n gwasanaethu pobl Cymru i safon uchel am 28 oed. Cwta wythnos a gymerodd hi i\u0027r Llywodraeth Brydeinig dynnu\u0027r plwg. Mae\u0027n anghredadwy.\u0022\nAr y rhaglen ddogfen Week In Week Out a ddarlledwyd ar y 25 Hydref, 2010 dywedodd cyn-Uwch Gyfarwyddwr S4C, Geraint Stanley Jones na fyddai\u0027n ddoeth petai\u0027r sianel yn dechrau brwydro yn erbyn y llywodraeth. Dywedodd hefyd fod S4C wedi colli \u0022hygrededd ac awdurdod\u0022 yn ystod y misoedd diwethaf. Beirniadwyd Awdurdod S4C hefyd gan yr aelod seneddol Ceidwadol Alun Cairns a ddywedodd fod yr awdurdod wedi tanseilio\u0027i hun. Yn ogystal â hyn, croeswyd y penderfyniad y byddai\u0027r BBC yn cymryd rheolaeth o beth o gyllid S4C gan gyfarwyddwr BBC Cymru, Menna Richards. Dywedodd Ms Richards ei bod yn falch fod y BBC wedi gwneud y penderfyniad i gefnogi teledu cyfrwng Cymraeg yn y dyfodol ac y byddai cwmnïau annibynnol sy\u0027n cynhyrchu rhaglenni ar gyfer S4C yn elwa yn y dyfodol. Cyn yr argyfwng cyllidol, roedd cyn-weinidog y Swyddfa Gymreig, Rod Richards AS, wedi galw am i\u0027r BBC gymryd rheolaeth o S4C o achos \u0022eu hystadegau gwylwyr siomedig\u0022.\nMewn cyfarfod cyhoeddus ar 30 Hydref, galwodd Cymdeithas yr Iaith ar yr holl aelodau a\u0027r cyhoedd yn gyffredinol i beidio talu eu trwydded deledu oni bai bod Llywodraeth San Steffan yn gwarantu annibyniaeth S4C. Cefnogwyd hyn gan AC Llafur Canolbarth a Gorllewin Cymru, Alun Davies. Dywedodd \u0022fod rhaid gwrthsefyll yr ymosodiad \u0022.\nAr 1 Tachwedd 2010, ysgrifennodd arweinwyr y pedair prif blaid yn y Cynulliad Cenedlaethol - sef Nick Bourne , Carwyn Jones , Ieuan Wyn Jones a Kirsty Williams - lythyr ar y cyd at David Cameron, Prif Weinidog y DU yn galw ar lywodraethau Cymru a\u0027r DU i gomisiynu adolygiad annibynnol o gynlluniau\u0027r llywodraeth Brydeinig ar gyfer S4C. Disgrifwyd y cydweithredu hyn gan y pedair plaid fel \u0022cam anarferol\u0022 gan Olygydd Gwleidyddol BBC Cymru, Betsan Powys. Dywedodd llefarydd ar ran Swyddfa Cymru fod llywodraeth Prydain eisiau i S4C fod yn annibynnol.\n\n\n=== 2023 - Honiadau am fwlio a diwylliant o ofn ===\nYn Mai 2023, cyhoeddwyd fod y sianel wedi gofyn i cwmni cyfreithiol ymchwilio i honiadau o fwlio a \u0022diwylliant o ofn\u0022. Roedd hyn dilyn e-bost anhysbys yn honni bod staff sy\u0027n gweithio i\u0027r sianel yn cael eu hanwybyddu a\u0027u tanseilio gan y tîm rheoli ac \u0022yn aml yn eu dagrau\u0022.\nYm mis Hydref 2023, diswyddwyd Llinos Griffin-Williams, Prif Swyddog Cynnwys S4C wedi honiadau o \u0022gamymddwyn difrifol\u0022. Gwadwyd y cyhuddiadau yma ganddi mewn cyfweliad yn Tachwedd 2023, gan ddweud ei bod hithau wedi cael ei bwlio ac wedi ei diswyddo\u0027n annheg. Ar yr un pryd, cyhoeddwyd fod y prif weithredwr am gymryd amser ffwrdd o\u0027i gwaith oherwydd salwch. Ar 24 Tachwedd 2023 cyhoeddodd Awdurdod y sianel bod y prif weithredwr, Siân Doyle wedi ei diswyddo, yn sgîl ymchwiliad gan gwmni cyfreithiol Capital Law. O fewn oriau cafwyd ymateb gan Siân Doyle yn beirniadu y penderfyniad i\u0027w diswyddo – gan ddweud nad oedd wedi cael cyfle i ymateb a nid oedd \u0022rheswm dilys y tu ôl i\u0027r penderfyniad.\u0022 \nYr wythnos ganlynol dywedodd cyn-brif swyddog cyfathrebu y sianel, Gwyn Williams, ei fod wedi rhybuddio Awdurdod S4C am \u0022ymddygiad amhriodol\u0022 o fewn y sefydliad ym mis Ebrill 2022. Esboniodd bod staff wedi dioddef oherwydd y awyrgylch tocsig ac bod nifer fawr o staff wedi gadael. Datgelodd cais Rhyddid Gwybodaeth i 27 aelod o staff adael ym mlwyddyn ariannol 2022/23, allan o\u0027r 118 oedd yn gweithio i S4C yn y cyfnod.\nAr 10 Hydref 2025 cyhoeddwyd bod S4C wedi dod i setliad gyda Siân Doyle \u0022i ddod â\u0027i holl achosion\u0022 yn erbyn y darlledwr a\u0027r cyn-gadeirydd Rhodri Williams i ben. Ni ddatgelwyd telerau\u0027r setliad, a dywedodd S4C fod y cytundeb wedi\u0027i gyrraedd \u0022heb unrhyw gydnabyddiaeth o atebolrwydd\u0022. Yn adroddiad gwefan Nation.cymru dywedwyd bod y setliad wedi\u0027i gyrraedd ar anogaeth yswirwyr S4C er mwyn osgoi costau cyfreithiol a gofid pellach i\u0027r rhai a roddodd dystiolaeth i ymchwiliad allanol i honiadau bwlio a wnaed yn erbyn Ms Doyle. Nid oedd unrhyw arian cyhoeddus yn gysylltiedig â\u0027r setliad, sydd wedi\u0027i dalu gan yswirwyr y darlledwr, a dalodd hefyd am ei gynrychiolaeth gyfreithiol.\r\n\r\n== Prif Weithredwyr ==\nOwen Edwards Geraint Stanley Jones Huw Jones Iona Jones Arwel Elis Owen Ian Jones Owen Evans Siân Doyle Sioned Wiliam Geraint Evans == Cadeiryddion ==\nGoronwy Daniel John Howard Davies Ifan Prys Edwards Elan Closs Stephens John Walter Jones Rheon Tomos Huw Jones Hugh Hesketh Evans Rhodri Williams Guto Bebb Delyth Evans == Gweler hefyd ==\nTG4 - Gwyddeleg\nBBC Alba - Gaeleg\nETB 1 - Basgeg\nWhakaata Māori - Maorieg\nBrezhoweb - teledu ar-lein Llydaweg\nGŵyl Cyfryngau Celtaidd",
  "imageNames": [
    "BBC_Cymru_Wales_geograph_6226511_cropped.jpg",
    "CCTV_cameras_on_a_pole_Cathedral_Road_Cardiff_-_geograph.org.uk_-_4088227.jpg",
    "Canolfan_S4C_Yr_Egin_cropped.jpg",
    "Doc_Fictoria_-_Caernarfon_Marina_geograph_7115219.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1982,
  "categoryId": "modern",
  "id": "s4c",
  "label": "S4C"
}