{
  "wikiSummary": "Amgueddfa awyr-agored sy\u0027n cofnodi hanes pensaernïaeth, diwylliant a ffordd o fyw y Cymry yw Amgueddfa Werin Cymru. Mae\u0027n rhan o Amgueddfa Cymru. Lleolir yr amgueddfa yn nhiroedd castell Sain Ffagan, ar gyrion Caerdydd.\nMae\u0027r amgueddfa yn nodedig am ei chasgliad o adeiladau traddodiadol a symudwyd yno o bob rhan o Gymru, carreg wrth garreg. Mae\u0027n gofnod gwerthfawr o hanes y genedl ac er mwyn arddangos ac astudio agweddau ar ddiwylliant Cymru o\u0027r 15g ymlaen, gan gynnwys pensaernïaeth draddodiadol, crefftau, offer amethyddol, llên gwerin, dillad, ac ati. Mae yno hefyd nifer o dai Celtaidd wedi\u0027u codi ac arteffactau o\u0027r cyfnod ynghyd ag elfen o ail-greu ac ail-actio cyfnod o\u0027n hanes.",
  "wikiArticle": "Amgueddfa awyr-agored sy\u0027n cofnodi hanes pensaernïaeth, diwylliant a ffordd o fyw y Cymry yw Amgueddfa Werin Cymru. Mae\u0027n rhan o Amgueddfa Cymru. Lleolir yr amgueddfa yn nhiroedd castell Sain Ffagan, ar gyrion Caerdydd.\nMae\u0027r amgueddfa yn nodedig am ei chasgliad o adeiladau traddodiadol a symudwyd yno o bob rhan o Gymru, carreg wrth garreg. Mae\u0027n gofnod gwerthfawr o hanes y genedl ac er mwyn arddangos ac astudio agweddau ar ddiwylliant Cymru o\u0027r 15g ymlaen, gan gynnwys pensaernïaeth draddodiadol, crefftau, offer amethyddol, llên gwerin, dillad, ac ati. Mae yno hefyd nifer o dai Celtaidd wedi\u0027u codi ac arteffactau o\u0027r cyfnod ynghyd ag elfen o ail-greu ac ail-actio cyfnod o\u0027n hanes.\r\n\r\n== Hanes ==\nSyniad y bardd a\u0027r arbenigwr llên gwerin Iorwerth C. Peate oedd sefydlu\u0027r amgueddfa, ar sail Skansen, sef amgueddfa awyr-agored pensaernïaeth brodorol Sweden yn Stockholm. Ond roedd rhan fwyaf o adeiladau Skansen yn rai pren, a byddai amgueddfa tebyg yng Nghymru yn naturiol yn fwy uchelgeisiol ocherwydd fod adeiladau brodorol Cymru wedi eu adeiladu o gerrig yn bennaf. Dechreuwyd y gwaith o ddatblygu\u0027r amgueddfa ym 1946 yn dilyn y rhodd o\u0027r castell a\u0027i thiroedd gan Iarll Plymouth, agorodd yn swyddogol ym 1948. Peate oedd y curadur cyntaf, ac fe\u0027i olynwyd gan Trefor M. Owen.\nCynlluniwyd prif adeilad yr amgueddfa gan Dale Owen, yn gweithio ar gyfer Partneriaeth Percy Thomas, ac fe\u0027i adeiladwyd rhwng 1968 a 1974. Enillodd y Fedal Aur am Bensaernïaeth yn Eisteddfod Genedlaethol 1978.\r\n\r\n== Adeiladau yn Amgueddfa Werin Cymru ==\r\n\r\n== Digwyddiadau ==\nMae\u0027r amgueddfa wedi cynnal yr \u0022Everyman Open Air Theatre Festival\u0022 ers 1996, pan symudwyd yno o Erddi Dyffryn ger Casnewydd. Mae\u0027r ŵyl yn cynnwys drama Shakespeare, cynhyrchiad gerddorol a sioe ar gyfer y teulu, ac mae wedi dod yn rhan elfennol o galendr theatr yng Nghymru dros y 25 mlynedd diwethaf.\nFfilmwyd y rhan fwyaf o benodau Doctor Who \u0022Human Nature\u0022 a \u0022The Family of Blood\u0022 yn Sain Ffagan. Ffilmiwyd penodau Poldark yno hefyd.\r\n\r\n== Ffynonellau ==",
  "location": {
    "lat": 51.4869,
    "long": -3.2725
  },
  "imageNames": [
    "Abernodwydd_Farmhouse_St_Fagans_Museum_of_Welsh_Life.jpg",
    "Anderson_shelter_at_St_Fagans.jpg",
    "Barn_National_History_Museum_of_Wales.jpg",
    "Boat-house_and_Net-house_National_History_Museum_St_Fagans_1458922_geograph.org.uk.jpg",
    "Bryn_Eryr_Farmstead_St_Fagans_National_History_Museum_geograph_5111620.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1948,
  "categoryId": "lleoedd",
  "id": "sain-ffagan",
  "label": "Sain Ffagan"
}