{
  "wikiSummary": "Santes oedd Dwynwen ac un o 24 merch Brychan Brycheiniog, yn y 5g. Heddiw hi yw nawddsant cariadon Cymru. Dethlir diwrnod Santes Dwynwen ar 25 Ionawr trwy i gariadon anfon cardiau i\u0027w gilydd.",
  "wikiArticle": "Santes oedd Dwynwen ac un o 24 merch Brychan Brycheiniog, yn y 5g. Heddiw hi yw nawddsant cariadon Cymru. Dethlir diwrnod Santes Dwynwen ar 25 Ionawr trwy i gariadon anfon cardiau i\u0027w gilydd.\r\n\r\n== Bywyd Dwynwen ==\nYn ôl yr hanes yr oedd Dwynwen mewn cariad â Maelon, mab pennaeth llwyth arall. Ceisiodd Maelon gymryd mantais rhywiol o\u0027i chariad ond gwrthododd Dwynwen. Gwylltiodd Maelon a\u0027i threisio hi \u0022gan ddwyn malais arni yng gŵydd y byd\u0022  Collodd Maelon bob diddordeb ynddi wedyn . Yn ei thrallod dihangodd hi i\u0027r goedwig lle y gweddïodd ar i Dduw ei rhyddhau o\u0027i chariad at Maelon. Gweddïodd yn daer nes blino\u0027n llwyr a syrthiodd i gysgu. Breuddwydiodd ei bod wedi yfed diod oedd yn ei hiacháu hi ond bod Maelon wedi yfed o\u0027r un ddiod a\u0027r diod wedi ei droi yn dalp o iâ. Gwnaeth Dwynwen dri chais mewn gweddi. Yn gyntaf, gofynnodd ar Dduw i ddadmer Maelon. Yn ail gofynnodd i Dduw ateb ei gweddïau dros gariadon fel y buasent, naill ai\u0027n cael dedwyddwch parhaol os oeddent yn caru yn gywir o\u0027r galon, neu yn cael eu hiacháu o\u0027u nwyd a\u0027u traserch. Yn drydydd gofynnodd am beidio â dymuno priodi byth. Ar ôl i\u0027w dymuniadau gael eu gwireddu, daeth Dwynwen  yn nawddsant cariadon.\n\n\n=== Sefydlu Llanddwyn a Llangeinwen ===\nSymudodd Dwynwen a\u0027i chwaer Ceinwen at berthnasau i Fôn. Sefydlodd Dwynwen ar benrhyn a elwir heddiw\u0027n \u0022Ynys Llanddwyn\u0022 ger traeth Niwbwch ond nid oedd yn ynys bryd hynny. Ni bu Llanddwyn yn fan anghysbell yn y 5g fel y mae hi heddiw; y mae\u0027n llai na phum milltir o Aberffraw, un o brif lysoedd Cymru o\u0027r Oes Haearn hyd at yr Oesoedd Canol. Roedd Llanddwyn hefyd yn agos i\u0027r prif llwybr morwrol i Iwerddon – o ollewin Ynys Môn i Dun Laoghaire. Bu Dwynwen fyw yn Llanddwyn tan ei marwolaeth yn 460 O. C.\n\n\n=== Dywediadau Dwynwen ===\nPriodolir iddi y dywediad \u0022nid enillir calonnau cyn gynted â sirioldeb\u0022 a ddyfynnir yng nghân Baring -Gould and Fisher, er eu bod hwy yn cofnodi fersiwn wahanol o\u0027r hanes. Iolo Morganwg yw ffynhonnell dywediad arall: \u0022A glywaist ti chwedl Dwynwen Santes, merch deg Brychan hen? Nid caruaidd ond llawen\u0022 a geir yn llawysgrif 1848\u0027.\n\nYn ôl y tair gweddi Lladin a ychwanegwyd at Lyfr Offeren Bangor ym 1494, cerddodd Dwynwen yr holl ffordd dros fôr Iwerydd rhag llid Maelgwn Gwynedd. Yn llawysgrifau Iolo Morganwg ceir fersiwn wahanol, sef y fersiwn uchod. Ym marddoniaeth Dafydd Trefor disgrifir cleifion yn cael eu hiacháu gerllaw ei ffynnon a\u0027i chapel. Bu Dwynwen yn enwog ledled Gwynedd  yn yr Oesoedd Canol a bu ymweld â Llanddwyn yn boblogaidd iawn.\r\n\r\n== Dafydd ap Gwilym ==\nSaif adfeilion eglwys Dwynwen, a godwyd yn y 14g, hyd heddiw ar ynys Llanddwyn ar safle y llan wreiddiol. Yn ystod y 14g gwelodd y bardd Dafydd ap Gwilym ddelw aur o Ddwynwen y tu mewn i\u0027r eglwys. Yn ddewr gofynnodd iddi fod yn llatai rhyngddo a Morfudd, y ferch a ddymunai ei hennill. Gwnaeth hyn, er fod Morfudd eisoes yn briod.\r\n\r\n== Coelion y Werin am Ddwynwen ==\nYn agos i\u0027r eglwys mae ffynnon a elwir \u0022Crochan Dwynwen\u0022. Dywedid fod symudiad y pysgod yn y ffynnon yn rhagfynegi ffawd rhywun sy\u0027n dymuno priodi. Cysegrwyd sawl ffynnon iddi, gan gynnwys un ger Niwbwrch, sydd erbyn hyn wedi\u0027i llenwi â thywod. Credid hefyd bod dŵr y ffynnon yn iacháu pobl wael. Arferodd pobl leol ddod â\u0027u hanifeiliaid gwael i Landdwyn. Felly dros y canrifoedd daeth Dwynwen yn noddwraig gwartheg hefyd. Cofnodir un hanes a ddigwyddodd tua 1650 am ychen, a oedd yn gweithio ar y Sul, yn cael braw ac a redodd tua\u0027r môr a boddi. Oherwydd hyn dechreuodd yr arfer o osod canhwyllau yn eglwys Llanddwyn i rwystro trychinebau rhag digwydd i ych aredig.[angen ffynhonnell]\r\n\r\n== Agweddau at Ddwynwen ==\nNi ledodd y diddordeb yn Nwynwen y tu allan i Gymru a Chernyw ac ni ddangosodd yr Eglwys Gatholig ddiddordeb ynddi hi fel santes am ganrifoedd. Nid oedd hi\u0027n wyryf; ond ymhlith pobl Môn mae dilyn arferion cysylltiedig â Dwynwen wedi parhau yn ddi-dor.\nYchwanegodd sawl manylyn i \u0027barchuso\u0027 hanes Dwynwen yn ddiweddarach. Honnodd ei bod hi wedi gwrthod priodi Maelon gan nid oedd yn ŵr addas , neu awgrymodd fod Brychan wedi gwrthod caniatáu y briodas . Yn yr 20g ailsefydlwyd Dwynwen fel nawddsant cariadon Cymru.",
  "imageNames": [
    "DwynwenCross1.jpg",
    "LlanddwynRuins.jpg",
    "Ruins_at_Llanddwyn_Anglesey.jpg",
    "StdwynwensChurchLlanddwyn.JPG"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 460,
  "categoryId": "crefydd",
  "id": "santes-dwynwen",
  "label": "Santes Dwynwen"
}