{
  "wikiSummary": "Erthygl am y sefydliad gwleidyddol yw hon. Am yr adeilad sy\u0027n gartref i\u0027r sefydliad gweler Adeilad y Senedd\n\nSenedd Cymru neu\u0027r Senedd yw\u0027r corff datganoledig sy\u0027n cael ei ethol yn ddemocrataidd i drafod polisïau ac sy\u0027n cymeradwyo deddfwriaeth sy\u0027n ymwneud â Chymru. Rhan o\u0027i waith yw dwyn Llywodraeth Cymru i gyfrif. Rhwng Mai 1999 a Mai 2020, enw\u0027r sefydliad oedd Cynulliad Cenedlaethol Cymru . Sefydlwyd y Cynulliad ym 1999 ar ôl cynnal refferendwm ym 1997.\nCeir 60 o aelodau, neu \u0027Aelodau o\u0027r Senedd\u0027 a etholir am dymor o bum mlynedd; mae 40 ohonynt yn cynrychioli etholaeth ddaearyddol ac 20 yn cael eu hethol dan drefn cynrychiolaeth gyfrannol dull D\u0027Hondt dros y pum etholaeth ranbarthol yng Nghymru. Mae\u0027r Senedd yn gweithredu system un siambr, hynny yw, nid oes \u0027ail siambr\u0027 i ddeddfwrfa Cymru.\nFfurfiwyd y Cynulliad Cenedlaethol yn dilyn Deddf Llywodraeth Cymru 1998, a oedd yn ymateb i Refferendwm datganoli i Gymru, 1997. Mae\u0027r Senedd a Llywodraeth Cymru yn ddau gorff ar wahân - yr un fath â Senedd y Deyrnas Unedig a Llywodraeth y Deyrnas Unedig. Y corff democrataidd sy\u0027n cynrychioli buddiannau Cymru a\u0027i phobl, sy\u0027n llunio cyfreithiau Cymru ac sy\u0027n gwneud Llywodraeth Cymru\u0027n atebol yw Senedd Cymru.\nYr enw ar gorff corfforaethol Senedd Cymru yw Comisiwn y Senedd.",
  "wikiArticle": "Erthygl am y sefydliad gwleidyddol yw hon. Am yr adeilad sy\u0027n gartref i\u0027r sefydliad gweler Adeilad y Senedd\n\nSenedd Cymru neu\u0027r Senedd yw\u0027r corff datganoledig sy\u0027n cael ei ethol yn ddemocrataidd i drafod polisïau ac sy\u0027n cymeradwyo deddfwriaeth sy\u0027n ymwneud â Chymru. Rhan o\u0027i waith yw dwyn Llywodraeth Cymru i gyfrif. Rhwng Mai 1999 a Mai 2020, enw\u0027r sefydliad oedd Cynulliad Cenedlaethol Cymru . Sefydlwyd y Cynulliad ym 1999 ar ôl cynnal refferendwm ym 1997.\nCeir 60 o aelodau, neu \u0027Aelodau o\u0027r Senedd\u0027 a etholir am dymor o bum mlynedd; mae 40 ohonynt yn cynrychioli etholaeth ddaearyddol ac 20 yn cael eu hethol dan drefn cynrychiolaeth gyfrannol dull D\u0027Hondt dros y pum etholaeth ranbarthol yng Nghymru. Mae\u0027r Senedd yn gweithredu system un siambr, hynny yw, nid oes \u0027ail siambr\u0027 i ddeddfwrfa Cymru.\nFfurfiwyd y Cynulliad Cenedlaethol yn dilyn Deddf Llywodraeth Cymru 1998, a oedd yn ymateb i Refferendwm datganoli i Gymru, 1997. Mae\u0027r Senedd a Llywodraeth Cymru yn ddau gorff ar wahân - yr un fath â Senedd y Deyrnas Unedig a Llywodraeth y Deyrnas Unedig. Y corff democrataidd sy\u0027n cynrychioli buddiannau Cymru a\u0027i phobl, sy\u0027n llunio cyfreithiau Cymru ac sy\u0027n gwneud Llywodraeth Cymru\u0027n atebol yw Senedd Cymru.\nYr enw ar gorff corfforaethol Senedd Cymru yw Comisiwn y Senedd.\r\n\r\n== Etholiadau ==\nMae aelodau yn cael eu hethol am dymor penodedig. Pedair blynedd oedd y tymor gwreiddiol, ond yn sgil deddfwriaeth yn San Steffan i greu Seneddau o 5 mlynedd ymestynnwyd cyfnod y Senedd i bum mlynedd. Cynhaliwyd etholiadau ym 1999, 2003, 2007, 2011, 2016 a 2021. Cynhelir is-etholiadau os oes sedd etholaeth leol o\u0027r Senedd yn dod yn wag, ond os oes gwagle ar y rhestr ranbarthol bydd pleidiau gwleidyddol yn enwebu\u0027r unigolyn nesaf ar y rhestr i ymuno â\u0027r Senedd.\nAr 27 Tachwedd 2019 pasiwyd deddf, sef y Ddeddf Senedd ac Etholiadau, i roi\u0027r bleidlais i bobl 16 oed, yn dechrau o etholiadau Senedd 2021. Yn ogystal, cafodd preswylwyr o dramor sy\u0027n byw yng Nghymru hawl i bleidleisio. Adeg y bleidlais ar y ddeddf, roedd 41 o 60 aelod o blaid y newid gyda Llafur a Phlaid Cymru o blaid a\u0027r Ceidwadwyr a Phlaid Brexit yn erbyn. Roedd y ddeddf hefyd yn rhoi enw newydd dwyieithog i\u0027r Cynulliad fel yr oedd, sef Senedd Cymru a Welsh Parliament, er gwaethaf ymgyrchu i gael enw uniaith Gymraeg ar y sefydliad. Yn ymarferol, er bod enw dwyieithog ar y sefydliad, tueddir i\u0027w alw\u0027n Senedd yn y ddwy iaith.\nYm Mai 2024, pleidleisiodd y Senedd dros gynyddu nifer yr aelidau o 60 i 96, gyda chefnogaeth Llafur a Phlaid Cymru. O 2026 ymlaen, fe fydd etholiadau Seneddol yn cael eu cynnal bob pedair blynedd yn hytrach na phob chwe blynedd.\r\n\r\n== Grymoedd ==\n\n\n=== Grymoedd deddfu ===\nGweler Pwerau Senedd Cymru am ragor o fanylion.\nCafodd grymoedd i basio mesurau deddfwriaethol o fewn meysydd penodol eu rhoi ar ddechrau\u0027r Trydydd Cynulliad ym Mai 2007 dan Ddeddf Llywodraeth Cymru 2006.\nAr 3 Mawrth 2011, cynhaliwyd refferendwm i benderfynu a ddylai\u0027r Cynulliad gael y pŵer i lunio ei ddeddfau ei hun. Pleidleisiodd pobl Cymru o blaid y cynnig. Ers 2017, defnyddir model cadw pwerau yn ôl, ac mae gan y Senedd yr hawl i ddeddfu mewn unrhyw faes sydd heb ei eithrio.\r\n\r\n== Aelodau\u0027r Senedd ==\n\n\n=== Mai 2021-Mai 2026 ===\n\n\n=== Mai 2016-Mai 2021 ===\n\n\n=== 2011-Mai 2016 ===",
  "location": {
    "lat": 51.46527778,
    "long": -3.16027778
  },
  "imageNames": [
    "Chamber_52354920165.jpg",
    "Mace_at_the_Senedd.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1999,
  "categoryId": "arweinwyr",
  "id": "senedd",
  "label": "Senedd Cymru"
}