{
  "wikiSummary": "Mae Tre\u0027r Ceiri yn fryngaer Geltaidd o\u0027r Oes Haearn a chyfnod y Rhufeiniaid ar y mwyaf dwyreiniol o dri chopa Yr Eifl, uwchben pentref Llanaelhaearn yn ardal penrhyn Llŷn, Gwynedd. Mae\u0027n un o\u0027r bryngeiri mwyaf trawiadol yng Nghymru a\u0027r fryngaer Oes Haearn mwyaf yng ngogledd-orllewin Ewrop. Mae arwynebedd y gaer oddeutu 2.5ha. Cyfeirnod OS: SH372446.",
  "wikiArticle": "Mae Tre\u0027r Ceiri yn fryngaer Geltaidd o\u0027r Oes Haearn a chyfnod y Rhufeiniaid ar y mwyaf dwyreiniol o dri chopa Yr Eifl, uwchben pentref Llanaelhaearn yn ardal penrhyn Llŷn, Gwynedd. Mae\u0027n un o\u0027r bryngeiri mwyaf trawiadol yng Nghymru a\u0027r fryngaer Oes Haearn mwyaf yng ngogledd-orllewin Ewrop. Mae arwynebedd y gaer oddeutu 2.5ha. Cyfeirnod OS: SH372446.\r\n\r\n== Disgrifiad ==\nMae\u0027r fryngaer yng ngofal Cadw, a gwnaed cryn dipyn o waith cynnal a chadw ar y muriau a\u0027r llwybrau o amgylch y gaer yn y blynyddoedd diwethaf. Gellir cyrraedd Tre\u0027r Ceiri trwy ddilyn y llwybr troed sy\u0027n cychwyn ychydig uwchben Llanaelhaearn ar ochr y ffordd i Nefyn.\nAmgylchynir y fryngaer gan furiau cerrig sydd yn dal o gryn uchder mewn mannau, hyd at 3 medr. Yn y rhannau lle mae\u0027r amddiffynfeydd naturiol gryfaf mae\u0027r mur yn un sengl, ond mewn rhannau eraill mae dau fur. Tu mewn i\u0027r muriau mae gweddillion tua 150 o dai crwn. Bu cloddio yma yn 1956, a gwnaed nifer o ddarganfyddiadau yn dyddio rhwng tua 150 O.C. a 400 O.C. Ymddengys felly fod y Rhufeiniaid wedi caniatau i\u0027r llwyth lleol, y Gangani, ddefnyddio\u0027r fryngaer.\nCofrestrwyd y fryngaer hon gan Cadw a chaiff ei hadnabod gyda\u0027r rhif SAM unigryw: CN028. Ceir tua 300 o fryngaerau ar restr CADW o henebion, er bod archaeolegwyr yn nodi bod oddeutu 570 ohonyn nhw i gyd yng Nghymru.",
  "location": {
    "lat": 52.9745,
    "long": -4.424
  },
  "imageNames": [
    "Inside_the_Celtic_Iron_Age_hillfort_of_Trer_Ceiri_Gwynedd_Wales_with_its_150_houses",
    "_finest_in_Europe_42.jpg",
    "Inside_the_Celtic_Iron_Age_hillfort_of_Trer_Ceiri_Gwynedd_Wales_with_its_150_houses",
    "_finest_in_Europe_61.jpg",
    "Inside_the_Celtic_Iron_Age_hillfort_of_Trer_Ceiri_Gwynedd_Wales_with_its_150_houses",
    "_finest_in_Europe_87.jpg",
    "L’entrée_d’une_maison_du_Hillfort_Trer_Ceiri_sur_les_pentes_du_Yr_Eifl.jpg",
    "Trer_Ceir_best_preserved_hillfort_in_Europe_built_200_BC_from_Garn_Ganol",
    "_April_2022_07.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": -200,
  "categoryId": "lleoedd",
  "id": "trer-ceiri",
  "label": "Tre\u0027r Ceiri"
}