{
  "wikiSummary": "Roedd Boddi Tryweryn yn 1965 yn ddigwyddiad hynod o ddadleuol. Boddwyd Cwm Tryweryn gan gynnwys Capel Celyn er mwyn creu cronfa ddŵr Llyn Celyn er mwyn darparu trigolion Lerpwl gyda dŵr. Digwyddodd hyn er gwaethaf gwrthwynebiad cyffredinol trigolion Capel Celyn a aeth i brotestio yn Lerpwl.\nGwrthwynebwyd boddi Tryweryn gan 125 o awdurdodau lleol a phleidleisiodd 27 o’r 36 MP\u0027s Cymreig yn erbyn ail ddarlleniad y mesur heb unrhyw un yn pleidleisio drosto. Ar y pryd, nid oedd gan Gymru unrhyw swyddfa Gymreig nac unrhyw ddatganoli.\nCyn boddi Capel Celyn, roedd yn gymdeithas ddiwylliedig Gymraeg, gan gynnwys capel, ysgol, swyddfa bost a deuddeg o ffermydd a thir a oedd yn perthyn i bedair fferm arall. Roedd 67 o bobl yn byw yno ac roedd yn un o’r cymunedau uniaith Gymraeg olaf yn yr ardal.\nCafodd protestiadau gan bobl leol a ffigurau cyhoeddus amlwg yng Nghymru eu hanwybyddu i raddau helaeth a daeth Capel Celyn yn symbol pwerus yn yr ymgyrch dros annibyniaeth Cymru.",
  "wikiArticle": "Roedd Boddi Tryweryn yn 1965 yn ddigwyddiad hynod o ddadleuol. Boddwyd Cwm Tryweryn gan gynnwys Capel Celyn er mwyn creu cronfa ddŵr Llyn Celyn er mwyn darparu trigolion Lerpwl gyda dŵr. Digwyddodd hyn er gwaethaf gwrthwynebiad cyffredinol trigolion Capel Celyn a aeth i brotestio yn Lerpwl.\nGwrthwynebwyd boddi Tryweryn gan 125 o awdurdodau lleol a phleidleisiodd 27 o’r 36 MP\u0027s Cymreig yn erbyn ail ddarlleniad y mesur heb unrhyw un yn pleidleisio drosto. Ar y pryd, nid oedd gan Gymru unrhyw swyddfa Gymreig nac unrhyw ddatganoli.\nCyn boddi Capel Celyn, roedd yn gymdeithas ddiwylliedig Gymraeg, gan gynnwys capel, ysgol, swyddfa bost a deuddeg o ffermydd a thir a oedd yn perthyn i bedair fferm arall. Roedd 67 o bobl yn byw yno ac roedd yn un o’r cymunedau uniaith Gymraeg olaf yn yr ardal.\nCafodd protestiadau gan bobl leol a ffigurau cyhoeddus amlwg yng Nghymru eu hanwybyddu i raddau helaeth a daeth Capel Celyn yn symbol pwerus yn yr ymgyrch dros annibyniaeth Cymru.\r\n\r\n== Hanes y boddi ==\n\nYn 1956 gofynnodd Cyngor Dinas Lerpwl i’r Senedd basio cyfraith a fyddai’n caniatáu iddynt adeiladu cronfa yn y dyffryn i ddarparu dŵr ar gyfer y ddinas. I wneud hyn byddai’n rhaid boddi Capel Celyn. Gan eu bod wedi gofyn i’r Senedd am ganiatâd golygai na fyddent yn gorfod gofyn i awdurdodau lleol yng Nghymru am eu caniatâd. Roedd hefyd yn golygu bod Lerpwl yn cymryd y dŵr o Gymru heb dalu amdano, a byddent yn gallu ei werthu ymlaen heb i Gymru dderbyn unrhyw arian amdano.Codwyd gwrthwynebiadau i\u0027r prosiect ledled Cymru ac roedd nifer o brotestiadau heddychlon a threisgar yn erbyn llifo\u0027r cwm, ond ym mis Gorffennaf 1957 pasiwyd y mesur yn y Senedd ac aeth y prosiect yn ei flaen fel y cynlluniwyd.\nPan agorwyd y gronfa ddŵr yn 1965 cafodd 800 erw o dir, a oedd yn cynnwys deuddeg o ffermydd yn ogystal â thiroedd pedair fferm arall, eu boddi o dan y dŵr. Collodd 48 o’r 67 o bobl a oedd yn byw yn y dyffryn eu cartrefi.\n\n\n=== Pasio’r mesur ===\nAr 20 Rhagfyr 1955, penderfynodd Corfforaeth Dinas Lerpwl greu argae dŵr yng Nghwm Tryweryn i gyflenwi dŵr i drigolion Lerpwl. Roedd y prosiect yn werth £20 miliwn. Roedd y gorfforaeth eisoes wedi gwneud hyn yn y 1880au yn nyffryn Efyrnwy.\nPasiwyd Mesur Boddi Cwm Tryweryn gan y Senedd ar 1 Awst 1957. Mesur preifat ydoedd a noddwyd gan gyngor Dinas Lerpwl ac a basiwyd gan lywodraeth Geidwadol Harold Macmillan a\u0027i Gweinidog dros Faterion Cymreig, Henry Brooke. Roedd y mesur yn caniátau pwrcasu\u0027r tir yn orfodol ar gyfer creu cronfa ddŵr. Cefnogwyd y mesur yn frwdfrydig gan Henry Brooke, y Gweinidog dros Addysg a Llywodraeth Leol a Gweinidog Materion Cymreig, Harold Wilson, Bessie Braddock a Barbara Castle.\n\n\n=== Gwrthwynebu ===\nGwrthwynebwyd y cynllun gan y rhan fwyaf o Aelodau Seneddol Cymru, ond nid oedd ganddynt rym i rwystro\u0027r datblygiad gan fod y llywodraeth am wthio\u0027r mesur drwy\u0027r Senedd. Nid oedd gan awdurdodau lleol chwaith lais yn y penderfyniad ac fe wnaeth hyn achosi anfodlonrwydd mawr. Roedd y pleidiau gwleidyddol yng Nghymru yn gytûn yn eu gwrthwynebiad i\u0027r cynllun, oherwydd fe\u0027i gwelwyd fel sarhad ar Gymru am fod ei hadnoddau gwerthfawr yn cael eu dwyn oddi arni.\nRoedd gwerth amaethyddol y tir yn uchel o\u0027i gymharu â darnau eraill o dir y gellid wedi eu hystyried, a theimlwyd nad oedd cynlluniau posibl eraill wedi cael eu trafod yn ddigonol.\nYn ogystal, roedd teimlad o dristwch am fod cymuned yn cael ei chwalu a theuluoedd a wreiddiwyd yn yr ardal ers cenedlaethau yn cael eu gorfodi i adael eu cartrefi.\n\n\n=== Protestio ===\n\nRoedd y trigolion lleol yn gadarn yn eu penderfyniad i wrthwynebu i\u0027r pen draw, a bu gwrthdystio a deisebu. Flwyddyn ynghynt ym Mawrth 1956 ffurfiwyd Pwyllgor Amddiffyn Capel Celyn. Roedd ei aelodau’n cynnwys gwleidyddion adnabyddus fel Megan Lloyd George, T.I Ellis, Ifan ab Owen Edwards, yr Aelod Seneddol lleol T. W. Jones a David Rees-Williams, Barwn 1af Ogwr. Roedd arweinydd Plaid Cymru Gwynfor Evans yn flaengar yng ngweithgareddau\u0027r Pwyllgor. Yn fuan anfonwyd llythyron a deisebau at Gorfforaeth Ddŵr Lerpwl. Ym mis Tachwedd 1956 gorymdeithiodd tua 70 o drigolion Capel Celyn a’u cefnogwyr drwy Lerpwl yn cario placardiau a baneri i neuadd y dref i ofyn i gyngor y ddinas ail ystyried. Ar eu baneri roedd sloganau fel “Your homes are safe – why destroy ours” a “Please Liverpool, be a great city not a big bully”.\nGwrthodwyd caniatáu i Gwynfor Evans siarad dros yr ymgyrch y tro cyntaf, ond er iddo gael ei wahodd, rai wythnosau’n ddiweddarch, i annerch cynghorwyr dinas Lerpwl, pleidleisiodd y cyngor o 95 i 1 o blaid y cynllun.\nPleidleisiodd 35 o 36 Aelod Seneddol Cymru yn erbyn mesur Tryweryn gyda’r Aelod Seneddol arall yn ymatal .  Yng Ngorffennaf 1957 pasiwyd y mesur yn y Senedd gyda 166 o blaid a 117 yn ei erbyn.\nEr yr arweiniodd Plaid Cymru y gwrthwynebiad I’r cynllun, gyda Gwynfor Evans yn arwain dirprwyaeth i gyfarfod Corfforaeth Lerpwl, teimlai nifer o\u0027r genhedlaeth ifanc yn siomedig nad oedd hynny yn weithredu digon uniongyrchol. Oherwydd hynny penderfynodd nifer o\u0027u haelodau ifanc adael Plaid Cymru gan sefydlu fudiad newydd, sef Cymdeithas yr Iaith Gymraeg.\nYn 2005, 50 mlynedd wedi i\u0027r argae gael ei gwblhau, cafwyd ymddiheuriad swyddogol gan Gyngor Lerpwl, i drigolion y pentref a\u0027r ardal, a Chymru gyfan, am foddi\u0027r pentref.\n\n\n=== Yr ymateb yng ngweddill Cymru ===\nNid oddi wrth bobl leol yn unig y daeth gwrthwynebiad. Bu achos Tryweryn yn ysgogiad o bwys i Blaid Cymru ac yn sbardun i ymgyrchu yng ngweddill Cymru. Ym mis Medi 1956 cynhaliwyd Rali \u0027Cadw Tryweryn\u0027 gan Blaid Cymru pan orymdeithiwyd i lawr stryd fawr y Bala.\nYm mis Hydref 1956 galwyd cyfarfod i achub Tryweryn yng Nghaerdydd gan Faer y ddinas, yr Henadur J H Morgan, lle\u0027r oedd dros 300 o gynrychiolwyr awdurdodau lleol, undebau llafur, a deg AS yn bresennol. Penodwyd yr Henadur Huw T Edwards yn gadeirydd a phenderfynwyd anfon dirprwyaeth o\u0027r gynhadledd i gwrdd ag aelodau Corfforaeth Lerpwl i apelio arnynt i newid eu meddyliau. Y rhai a anfonwyd oedd Mr D R Grenfell AS, Arglwydd Faer Caerdydd, Huw T Edwards, y Cynghorydd Emrys Owen a Dr R Robinson. Derbyniodd yr Adran Weinyddiaeth dros Faterion Cymreig 680 o lythyron yn cwyno am y cynlluniau.\nNid oedd yr un Aelod Seneddol a bleidleisiodd yn gefnogol, na’r un cyngor yng Nghymru yn cytuno, ond gweithredwyd y penderfyniad er gwaethaf hyn. I nifer ymddangosai fel pe bai Cymru’n hollol ddiymadferth i weithredu ynghylch ei dyfodol ei hun. Cynyddodd cefnogaeth Plaid Cymru ac fe gynyddon nhw’r nifer o seddau roedden nhw’n ymgeisio amdanynt yn etholiad 1959.\n\n\n=== Protestio terfysglyd ===\nCyflawnwyd difrod yng Nghwm Tryweryn ar dri achlysur rhwng 1962 a 1963.  Ar Fedi’r 22 1962, difrododd David Pritchard a David Walters offer ar y safle. Cawsant eu harestio a derbyn dirwy o £50 yr un. Ar Chwefror 10, 1963, gosododd Emyr Llywelyn Jones, myfyriwr yn Aberystwyth ac aelod o Fudiad Amddiffyn Cymru, fom 5 pwys wrth waelod trawsffurfiwr trydanol ar y safle adeiladu. Anfonwyd ef i’r carchar am 12 mis. Fel ymateb i’r ddedfryd ffrwydrodd Owain Williams a John Albert Jones beilon trydan yng Ngellilydan. Achosodd y ffrwydrad ddifrod difrifol. Gyrrwyd y ddau i garchar am 12 mis. Er gwaetha\u0027r gwrthwynebiad cyhoeddus aeth y cynllun yn ei flaen ac fe agorwyd Llyn Celyn fel cronfa ddŵr yn swyddogol ar Hydref 28, 1965. Roedd hanes boddi’r cwm wedi ymestyn dros gyfnod o ddeng mlynedd ac roedd cymuned gyfan uniaith Gymraeg wedi ei cholli yn y broses.\r\n\r\n== Agor y gronfa ==\n\nAmharwyd ar y seremoni agoriadol ar yr 28in o Hydref 1965 gan brotestiadau. Roedd 400 o wahoddedigion, yn eu plith, Arglwydd Faer Lerpwl, yn bresennol ynghyd â 500 o brotestwyr. Roedd llawer o fwian a gweiddi. Ceisiodd rywun losgi Baner yr Undeb. Taflwyd cerrig at y platfform. Bu\u0027n rhaid dod ag areithiau i ben wrth i wifren y meicroffon gael ei dorri. Dyma ymddangosiad cyhoeddus cyntaf parafilwyr Byddin Rhyddid Cymru gyda’u lifrau â baneri Cymru arnynt.\nRoedd Llyn Celyn yn dal 71,200 megalitr o ddŵr ac yn cynnwys yr argae mwyaf yng Nghymru. Bu’n rhaid hefyd adeiladu hewl newydd rhwng y Bala a Ffestiniog er mwyn mynd heibio\u0027r dyffryn. Mae gardd goffa, lle symudwyd hen gerrig beddi Capel Celyn, a chofeb wrth ymyl y llyn heddiw.\r\n\r\n== Gwaddol ==\n\nArweiniodd y digwyddiad at gynnydd yn y gefnogaeth i annibyniaeth i Gymru, gyda Phlaid Cymru yn gweld cynnydd mewn poblogrwydd. Yn y tymor byr, arweiniodd hefyd at gynnydd mewn gweithgarwch parafilwrol cenedlaetholgar yng Nghymru, a gyrhaeddodd ei uchafbwynt gyda\u0027r gwrthwynediad i arwisgiad y Tywysog Siarl yng Nghaernarfon ym 1969. I lawer o Gymry gwladgarol daeth boddi Capel Celyn a Chwm Tryweryn yn symbol o\u0027r bygythiad i barhad yr iaith Gymraeg ei hun fel iaith gymunedol fyw, yn enwedig yn y 1980au wrth i nifer y pentrefi Cymraeg eu hiaith ostwng yn sylweddol diolch i Gymry ifanc yn ymfudo i gael gwaith a mewnfudo gan bobl o\u0027r tu allan i Gymru, gan amlaf yn Saeson di-Gymraeg.\nRoedd boddi Capel Celyn wedi atgoffa Cymru ei bod wedi colli tir droeon o’r blaen er mwyn darparu dŵr dros y ffin i Loegr - er enghraifft, adeiladu Llyn Efyrnwy ym Mhowys yn yr 1880au ar gyfer Lerpwl a boddi Cwm Elan ar ddechrau’r 20g ar gyfer Birmingham.  Ond eto, bu tynged Cwm Tryweryn yn ysgogiad i gymunedau eraill wrthsefyll yr un canlyniad. Ar ddiwedd y 1960au, ceisiodd Awdurdod Afonydd Dyffryn Hafren adeiladu cronfa ddŵr yn Tylwch, i’r de o Lanidloes, Powys, er mwyn darparu cyflenwad dŵr i Ganolbarth Lloegr. Byddai’r cynllun wedi golygu boddi Cwm Dulaos gyda 600 hectar o dir a 15 o ffermydd. Wedi brwydr gan y trigolion lleol, Archwiliad Cyhoeddus yn 1970 a chefnogaeth yr Aelod Seneddol lleol, sef Emlyn Hooson, ac unigolion eraill, llwyddwyd i ddadlau yn erbyn y cynllun. Yn sgil hynny, ni adeiladwyd y gronfa.\nDaeth Tryweryn yn symbol o drobwynt yn hanes Cymru’r 20fed ganrif. Cofnodwyd y digwyddiad yn 1991 drwy baentio murlun gyda’r slogan ‘Cofiwch Dryweryn’ ar wal hen adfail ar ochr yr A487, ger Llanrhystud, Aberystwyth. Daeth y murlun graffiti gyda chefndir coch ac ysgrifen wen yn gofnod eiconig o’r hyn a ddigwyddodd i gymuned Capel Celyn ac am y bennod drist honno yn hanes Cymru. Un o\u0027r rhai a fu\u0027n gyfrifol am y slogan gwreiddiol, a beintiwyd am y tro cyntaf yn 1963, oedd y bardd a\u0027r newyddiadurwr Meic Stephens, tad y D.J. radio, Huw Stephens.\nCafodd y murlun ei ddifrodi ar sawl achlysur, ond bob tro mae hynny wedi digwydd, mae gwirfoddolwyr wedi adnewyddu’r wal ac ail-beintio’r geiriau gwreiddiol. Bu dyfalbarhad y gwirfoddolwyr yn symbol o\u0027r penderfyniad i gofio am y boddi. Ysgogodd hyn beintio cyfres o sloganau ‘Cofiwch Dryweryn’ mewn gwahanol leoliadau yng Nghymru. Yn ystod 2019 prynwyd y mur ger Llanrhystud ac mae bellach o dan ofal elusen, Tro’r Trai, er mwyn ei gadw ar gyfer y genedl.\nMae wedi dod yn eicon o hunaniaeth Gymraeg ac yn symbol sy\u0027n gysylltiedig ag annibyniaeth Cymru, gan cynnwys ymgyrch diweddar Yes Cymru.\r\n\r\n== Ymateb y beirdd ==\n\nCanodd y beirdd lawer am foddi Cwm Tryweryn ac yn eu plith, Dafydd Iwan:\n\nMae argae ar draws Cwm Tryweryn\nYn gofgolofn i\u0027n llyfdra ni\nI lawer o Gymry gwladgarol daeth boddi Capel Celyn a Chwm Tryweryn yn symbol o\u0027r bygythiad i barhad yr iaith Gymraeg ei hun fel iaith gymunedol fyw, yn enwedig yn y 1980au wrth i nifer y pentrefi Cymraeg eu hiaith ostwng yn sylweddol wrth i Gymry ifainc ymfudo i gael gwaith, ac i bobl o\u0027r tu allan i Gymru fewnfudo, gan amlaf yn Saeson di-Gymraeg. Mynegir hyn gan y prifardd Gerallt Lloyd Owen yn ei gerdd adnabyddus Tryweryn, a gyhoeddwyd yn y gyfrol Cilmeri a Cherddi Eraill yn 1991 ond a gyfansoddwyd yn y 1980au. Dyma\u0027r pennill agoriadol:\n\nNid oes inni le i ddianc,\nNid un Tryweryn ein tranc,\nNid un cwm ond ein cymoedd,\nO blwyf i blwyf heb na bloedd\nNa ffws y troir yn ffosil\nNid un lle ond ein holl hil.\nCyfarwydd hefyd yw\u0027r cwpled cofiadwy o\u0027r un gerdd,\n\nFesul tŷ nid fesul ton\nY daw\u0027r môr dros dir Meirion.\r\n\r\n== Heddiw ==\n\nMae\u0027r llyn uwchben Capel Celyn yn dal i gyflenwi dŵr i Lerpwl. Mae dyffryn Tryweryn bellach yn gartref i\u0027r Ganolfan Dŵr Gwyn Genedlaethol.",
  "imageNames": [
    "Cofiwch_Dryweryn_ac_Aberfan_Awst_2017.jpg",
    "Llyn_Celyn_Tryweryn_1492972.jpg",
    "Protest_in_Liverpool_attempting_to_stop_the_flooding_of_the_Tryweryn_Valley_10977794533.jpg",
    "Tryweryn_memorial_chapel_w.JPG"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1965,
  "categoryId": "cymdeithasol",
  "id": "tryweryn",
  "label": "Boddi Tryweryn"
}