{
  "wikiSummary": "\u0022Hen Wlad Fy Nhadau\u0022 is the unofficial national anthem of Wales. The title, taken from the first words of the song, means \u0022The Old Land of My Fathers\u0022 in Welsh, usually rendered in English as simply \u0022Land of My Fathers\u0022. The words were written by Evan James and the tune composed by his son, James James, both residents of Pontypridd, Glamorgan, in January 1856. The earliest written copy survives and is part of the collections of the National Library of Wales.",
  "wikiArticle": "\u0022Hen Wlad Fy Nhadau\u0022 is the unofficial national anthem of Wales. The title, taken from the first words of the song, means \u0022The Old Land of My Fathers\u0022 in Welsh, usually rendered in English as simply \u0022Land of My Fathers\u0022. The words were written by Evan James and the tune composed by his son, James James, both residents of Pontypridd, Glamorgan, in January 1856. The earliest written copy survives and is part of the collections of the National Library of Wales.\r\n\r\n== History ==\n\n\n=== Origins ===\n\n\u0022Glan Rhondda\u0022 , as it was known when it was composed, was first performed in the vestry of the original Capel Tabor, Maesteg , in either January or February 1856, by Elizabeth John from Pontypridd, and it soon became popular in the locality.\nJames James, the composer, was a harpist who played his instrument in the public house which he ran, for the purpose of dancing. The song was originally intended to be performed in 68 time but had to be slowed down to its present 34 tempo when it began to be sung by large crowds.\n\n\n=== Popularity ===\nThe popularity of the song increased after the Llangollen Eisteddfod of 1858. Thomas Llewelyn of Aberdare won a competition for an unpublished collection of Welsh airs with a collection that included \u0022Glan Rhondda\u0022. The adjudicator of the competition, \u0022Owain Alaw\u0022 asked for permission to include \u0022Glan Rhondda\u0022 in his publication, Gems of Welsh melody . This volume gave \u0022Glan Rhondda\u0022 its more famous title, \u0022Hen Wlad Fy Nhadau\u0022, and was sold in large quantities and ensured the popularity of the anthem across the whole of Wales.\nAt the Bangor Eisteddfod of 1874 \u0022Hen Wlad Fy Nhadau\u0022 gained further popularity when it was sung by Robert Rees , one of the leading Welsh soloists of his day. It was increasingly sung at patriotic gatherings and gradually it developed into a national anthem.\n\n\u0022Hen Wlad Fy Nhadau\u0022 was also one of the first Welsh-language songs recorded, when Madge Breese sang it on 11 March 1899, for the Gramophone Company, as part of the first recording in the Welsh language.\n\u0022Hen Wlad Fy Nhadau\u0022 was the first national anthem to be sung at the start of a sporting event. In 1905, the Welsh national rugby team hosted New Zealand\u0027s first touring team, who started every match performing a haka. As a response, Wales player Teddy Morgan led the crowd singing the anthem. Although crowds often sang anthems during games, there was no precedent for an anthem to be sung before a match.\nIn 1978 for their Hen Wlad Fy Nhadau album, Geraint Jarman a\u0027r Cynganeddwyr recorded a version of the anthem using electric guitars, inspired by Jimi Hendrix\u0027s rendition of \u0022The Star-Spangled Banner\u0022 . Jarman\u0027s version, played by Welsh guitarist Tich Gwilym, is one of the most famous modern versions of the song.\r\n\r\n== Usage ==\nTradition has established \u0022Hen Wlad Fy Nhadau\u0022 as a de facto Welsh national anthem since 1905, when it was first sung by fans at rugby games, although the official anthem at the time was \u0022God Save the King\u0022. \u0022Hen Wlad Fy Nhadau\u0022 slowly established itself as the more popular anthem over the next four decades and was sung along with \u0022God Bless the Prince of Wales\u0022 and \u0022God Save the Queen\u0022 before sporting events until 1975, when sports officials decided that \u0022Hen Wlad Fy Nhadau\u0022 should be sung alone. Like other British anthems, it has not been established as a national anthem by law, but it has been used as a national anthem at official governmental ceremonies, including the opening of the Welsh Parliament / Senedd Cymru, and at receptions of the British monarchy since the 1970s. Petitions to make the song an official national anthem for Wales are occasionally submitted to the Senedd, but the last time one raised sufficient signatures to be debated, in 2014, the conclusion was that this is \u0027not currently a possible development\u0027. It is recognised and used as an anthem at both national and local events in Wales.\n\nUsually, \u0022Hen Wlad Fy Nhadau\u0022 will be the only anthem sung: only the first stanza and chorus are usually sung . \u0022God Save the King\u0022, the national anthem of the United Kingdom, is sometimes played alongside \u0022Hen Wlad Fy Nhadau\u0022 during official events with a royal connection.\nThe existence of a separate national anthem for Wales has not always been apparent to those from outside the country. In 1993, the newly appointed Secretary of State for Wales, John Redwood, was embarrassingly videotaped opening and closing his mouth during a communal singing of the national anthem, clearly ignorant of the words but unable to mime convincingly; the pictures were frequently cited as evidence of his unsuitability for the post. According to John Major\u0027s autobiography, the first thing Redwood\u0027s successor William Hague said, on being appointed, was that he had better find someone to teach him the words. He found Ffion Jenkins, and later married her.\n\u0022Hen Wlad Fy Nhadau\u0022 has been adapted to the anthems of Cornwall , Brittany , and Y Wladfa . These adaptations share the same tune as \u0022Hen Wlad Fy Nhadau\u0022 and have similar lyrics.\r\n\r\n== Lyrics ==\r\n\r\n== Cultural influence ==\n\nThe Welsh poet Dylan Thomas is often quoted as saying \u0022The land of my fathers. My fathers can have it!\u0022 in reference to Wales. However, this is misleading, as it was a villainous character in one of Thomas\u0027 short stories that spoke this line.\nGwynfor Evans named his history of Wales Land of my fathers: 2,000 years of Welsh history. It was a translation of the Welsh original, Aros Mae.\nThe £1 coins minted in 1985, 1990, 1995 and 2000 with a Welsh emblem on the reverse, also bear the edge inscription PLEIDIOL WYF I\u0027M GWLAD , from the refrain of \u0022Hen Wlad Fy Nhadau\u0022. The new Royal Badge of Wales adopted in 2008 features this motto.\r\n\r\n== \u0022Gwlad Newydd y Cymry\u0022 ==\n\nA version of \u0022Hen Wlad Fy Nhadau\u0022 was written by Lewis Evans, a migrant from Wales to Y Wladfa, a Welsh-speaking settlement in Patagonia, South America. The version penned by Evans is called \u0022Gwlad Newydd y Cymry\u0022 . \u0022Gwlad Newydd y Cymry\u0022 is played to the same tune as \u0022Hen Wlad Fy Nhadau\u0022.\nThe lyrics to \u0022Gwlad Newydd y Cymry\u0022 are as follows :",
  "imageNames": [
    "Patagonia_Anthem.JPG",
    "Photo_of_Y_Ddraig_Goch.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1865,
  "categoryId": "diwylliant",
  "id": "anthem",
  "label": "Land of My Fathers"
}