{
  "wikiSummary": "The flag of Wales consists of a red dragon passant on a green and white field.  As with many heraldic charges, the exact representation of the dragon is not standardised in law.\nThe colours of green and white are the colours of the Tudor family; a standard featuring the red dragon was used by Henry VII at the Battle of Bosworth in 1485, after which it was carried in state to St Paul\u0027s Cathedral, and a dragon added as a supporter of the Tudor royal arms.\nIt was officially recognised as the Welsh national flag in 1959. Several cities include a dragon in their flag design, including Cardiff, the Welsh capital.",
  "wikiArticle": "The flag of Wales consists of a red dragon passant on a green and white field.  As with many heraldic charges, the exact representation of the dragon is not standardised in law.\nThe colours of green and white are the colours of the Tudor family; a standard featuring the red dragon was used by Henry VII at the Battle of Bosworth in 1485, after which it was carried in state to St Paul\u0027s Cathedral, and a dragon added as a supporter of the Tudor royal arms.\nIt was officially recognised as the Welsh national flag in 1959. Several cities include a dragon in their flag design, including Cardiff, the Welsh capital.\r\n\r\n== Symbolism ==\n\nIn the Historia Brittonum, there is a narrative in which Vortigern , King of the Celtic Britons from Powys is interrupted whilst attempting to build a fort at Dinas Emrys. He is told by Merlin/Ambrosius to dig up two dragons beneath the castle. He discovers a red dragon representing the Celtic Britons and a white dragon representing the Anglo-Saxons . Merlin/Ambrosius prophesies that the Celtic Britons will reclaim the island and push the Anglo-Saxons back to the sea.\nThe Historia Brittonum was written c. 828, and by this point, the dragon was associated with a coming deliverer from the Saxons and, for the first time, as a symbol of independence. It is also the first time that the colour of the dragon is verifiably given as red. There may well be an older attribution of red to the colour of the dragon in Y Gododdin. The story of Lludd a Llefelys in the Mabinogion wrote that the red dragon of the Celtic Britons was in opposition with the white dragon of the Saxons.\nThe dragon of Wales was used by numerous Welsh rulers as a propaganda tool; to portray their links to the Arthurian legend, the title given to such rulers is Y Mab Darogan . The Welsh term draig, \u0027dragon\u0027 was used to refer to Welsh leaders including Owain Gwynedd, Llywelyn ap Gruffudd and \u0022the dragon\u0022 Owain Glyndŵr. Cynddelw Brydydd Mawr, a court poet to Owain Gwynedd refers to him in one elegy, personifying him as \u0022The golden dragon of Snowdonia of eagles\u0022.\nHenry VII recognised the red dragon upon its blessing at Saint Paul\u0027s Cathedral following his victory at Bosworth Field under the realm of \u0027England and Wales\u0027 in 1485; the United Kingdom would not recognise the flag\u0027s official status again until 1959, despite the dragon being used by Romanised Celtic Britons since at least the fall of the Roman empire in the 6th century AD.\r\n\r\n== History ==\n\n\n=== Kingdom of Gwynedd ===\n\nThe Senior line of the House of Aberffraw descended from Prince Llywelyn the Great in patriline succession and became extinct on the death of Owain Lawgoch in 1378.\n\n\n=== Owain Glyndŵr ===\n\nIn 1400, Owain Glyndŵr raised the dragon standard during his revolts against the occupation of Wales by the English crown. Owain\u0027s banner known as Y Ddraig Aur was raised over Caernarfon during the Battle of Tuthill in 1401 against the English. Glyndŵr chose to fly the standard of a golden dragon on a white background, the traditional standard.\n\n\n=== Henry VII ===\n\nIn 1485, Henry Tudor flew the red dragon during his invasion of England. Henry was of Welsh descent and after leaving France with an army of 2,000, landed at Milford Haven on 7 August. He made capital of his Welsh ancestry by gathering support and gaining safe passage through Wales. Henry met and fought Richard III at the Battle of Bosworth Field, and took the English throne in victory. After the battle, Henry carried the red dragon standard in state to St Paul\u0027s Cathedral. The Tudor livery of green and white was added to the flag later.\n\n\n=== Modern flag ===\nIn 1807, the red dragon on a green mount was adopted as the Royal Badge of Wales. On 11 March 1953, the motto Y Ddraig goch ddyry cychwyn was added, a line from the poem by Deio ab Ieuan Du. The badge was the basis of a flag of Wales in which it was placed on a horizontal white and green bicolour. However, the flag was the subject of derision, both because the tail pointed downwards in some iterations and because the motto was a potential double entendre, used in the original poem to allude to the penis of a copulating bull. In 1959, government use of this flag was dropped in favour of the current flag at the urging of the Gorsedd of Bards. Today the flag can be seen flying from the Senedd in Cardiff and from Welsh Government buildings, as well as UK Government buildings in Wales.\nBetween 1910 and 1916, Caernarfon town council continuously appealed to have the Welsh flag hoisted on top of Caernarfon castle\u0027s Eagle tower to replace that of the Union Jack. In April 1916, the mayor at the time, Charles A. Jones said the reasoning behind rejecting the Welsh dragon was that \u0022the authorities were advised that there was no such thing as a Welsh flag.. it was only a badge\u0022.\nIn 1932, the \u0027Welsh Nationalist Party\u0027 appealed to the Office of Works to replace the Union flag with that of the Welsh flag on Caernarfon castle\u0027s Eagle tower on St David\u0027s Day. The office ignored them; as a consequence, on 1 March, a group of Welsh patriots climbed the towers and hauled the Union flag down from the Eagle tower and the eastern tower and replaced it with the Welsh flag. The castle\u0027s officials promptly took the Welsh flags down and restored the Union flags. Later in the afternoon, the Union flag was again hauled down from the Eagle tower and taken to the castle square where it was torn to pieces by some 30 or 40 students. The students passed through the turnstiles of the castle as ordinary visitors, climbed the stone steps to the Eagle Tower, and carried away the Union Jack, which had previously been removed during the morning. Several ex-servicemen looked on with evident displeasure at the treatment of the Union Flag and at one point it was likely that a conflict would ensue between the two sections.\r\n\r\n== Other flags ==\n\n\n=== Flag of Saint David ===\n\nThe flag of Saint David, a yellow cross on a black field, is used in the emblem of the Diocese of St Davids and is flown on St David\u0027s Day.\n\n\n=== Government ensign ===\n\nAn ensign for use aboard ships used by the Welsh Government, such as the patrol boats of the Marine and Fisheries Division, was granted in 2017. The flag is a British blue ensign defaced with a yellow dragon with red claws and tongue.\r\n\r\n== In popular culture ==\nThe flag of Wales has been used by those in the arts, sport and business to show a sense of patriotism or recognition with Wales. During the 1999 Rugby World Cup, which was hosted in Wales, the opening ceremony used the motif of the dragon several times; the flag was worn on a dress by Welsh singer Shirley Bassey.\nOther musicians to have used the flag, include Nicky Wire of Manic Street Preachers, who will often drape the Welsh flag over amps when playing live, and Cerys Matthews who has worn the image on her clothes, while classical singer Katherine Jenkins has taken the flag on stage during live performances.\nFormer Pink Floyd bassist Roger Waters\u0027s album Radio K.A.O.S. follows the story of a young disabled Welsh man, grounded in California, who regularly expresses nostalgia and a hope for return to his home country. The chorus of \u0022Sunset Strip\u0022 uses the imagery of the flag of Wales to further emphasise this:\n\nIn 2018, the flag made an unexpected appearance in Black Panther, during a scene set in the United Nations. The flag is displayed alongside those of independent sovereign nations, leading to speculation that Wales is an independent nation in the Marvel Cinematic Universe. The scene led to comments and discussions, including from the Welsh Government and Plaid Cymru.\n\nIn 2024, the flag appeared in Deadpool \u0026 Wolverine, where an alternative version of Deadpool, known as \u0022Welshpool,\u0022 was depicted wearing the flag as part of his costume.\r\n\r\n== In Unicode ==\n\nIn 2017, the Unicode Consortium approved emoji support for the flag of Wales, alongside the flags of England and Scotland, in Unicode version 10.0 and Emoji version 5.0. This was following a proposal from Jeremy Burge of Emojipedia and Owen Williams of BBC Wales in March 2016. The flag is implemented using the regional indicator symbol sequence GB-WLS. Prior to this update, The Daily Telegraph reported that users had \u0022been able to send emojis of the Union Flag, but not of the individual nations\u0022.",
  "imageNames": [
    "ArbfaisTuduriaid.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1959,
  "categoryId": "diwylliant",
  "id": "baner",
  "label": "Flag of Wales"
}