{
  "wikiSummary": "Bartholomew Roberts , born John Roberts, was a Welsh pirate who was, measured by vessels captured, the most successful pirate of the Golden Age of Piracy. During his piratical career, he took over 400 prize ships, although most were mere fishing boats. Roberts raided ships off the Americas and the West African coast between 1719 and 1722; he is also noted for creating his own pirate code, and adopting an early variant of the Skull and Crossbones flag.\nRoberts\u0027 infamy and success saw him become known as The Great Pyrate and eventually as Black Bart , and made him a popular subject for writers of both fiction and non-fiction. To this day, Roberts continues to feature in popular culture, and has inspired fictional characters .",
  "wikiArticle": "Bartholomew Roberts , born John Roberts, was a Welsh pirate who was, measured by vessels captured, the most successful pirate of the Golden Age of Piracy. During his piratical career, he took over 400 prize ships, although most were mere fishing boats. Roberts raided ships off the Americas and the West African coast between 1719 and 1722; he is also noted for creating his own pirate code, and adopting an early variant of the Skull and Crossbones flag.\nRoberts\u0027 infamy and success saw him become known as The Great Pyrate and eventually as Black Bart , and made him a popular subject for writers of both fiction and non-fiction. To this day, Roberts continues to feature in popular culture, and has inspired fictional characters .\r\n\r\n== Early life ==\n\nHe was born John Roberts in 1682 in Casnewydd Bach, between Fishguard and Haverfordwest in Pembrokeshire, Wales. His father was most likely George Roberts. It is unclear why Roberts changed his name from John to Bartholomew, but pirates often adopted aliases. He may have chosen his first name after the well-known buccaneer Bartholomew Sharp. He was thought to have gone to sea when he was 13 in 1695, but there is no further record of him until 1718, when he was mate of a Barbados sloop.\nIn 1719, Roberts was second mate on the slave ship Princess under Captain Abraham Plumb. In early June that year, the Princess was anchored at Anomabu when she was captured by pirates. The pirates were in two vessels, Royal Rover and Royal James, and were led by captain Howell Davis. Davis, like Roberts, was a Welshman, originally from Milford Haven in Pembrokeshire. Roberts and several other of the crew of the Princess were forced to join the pirates.\nDavis quickly discovered Roberts\u0027 abilities as a navigator and took to consulting him. He was also able to confide information to Roberts in the Welsh language, thereby keeping it hidden from the English and international crewmen. Roberts is said to have been reluctant to become a pirate at first, but quickly came to see the advantages of this new lifestyle and saw it as a great opportunity for him. Captain Charles Johnson reports him as saying:\n\nIn an honest service there is thin commons, low wages, and hard labour. In this, plenty and satiety, pleasure and ease, liberty and power; and who would not balance creditor on this side, when all the hazard that is run for it, at worst is only a sour look or two at choking? No, a merry life and a short one shall be my motto.\r\n\r\n== Life as a pirate ==\n\n\n=== Commander or commoner ===\n\nIn the merchant navy, Roberts\u0027 wage was less than £4 per month and he had no chance of promotion to captaincy.\nA few weeks after Roberts\u0027 capture, Royal James had to be abandoned because of worm damage. Royal Rover headed for the island of Príncipe. Davis hoisted the flags of a British man-of-war and was allowed to enter the harbor. After a few days, Davis invited the governor to lunch on board his ship, intending to hold him hostage for a ransom. Davis had to send boats to collect the governor, and he was invited to call at the fort for a glass of wine first. The Portuguese had discovered that their visitors were pirates. They ambushed Davis\u0027 party on its way to the fort, shooting Davis dead.\nA new captain had to be elected. Davis\u0027 crew was divided into \u0022Lords\u0022 and \u0022Commons\u0022, and it was the \u0022Lords\u0022 who had the right to propose a name to the remainder of the crew. Within six weeks of his capture, Roberts was elected captain. This was unusual, especially as he had objected to serving on the vessel. Historians believe he was elected for his navigational abilities and his personality, which history reflects was outspoken and opinionated.\n\nHe accepted of the Honour, saying, that since he had dipp\u0027d his Hands in Muddy Water, and must be a Pyrate, it was better being a Commander than a common Man.\nRoberts\u0027 first act as captain was to lead the crew back to Príncipe to avenge the death of Captain Davis. Roberts and his crew landed on the island in the darkness of night, killed a large portion of the male population, and stole all items of value that they could carry away. Soon afterwards, he captured a Dutch Guineaman, then two days later a British ship called Experiment. The pirate ship took on water and provisions at Anamboe, where a vote was taken on whether the next voyage should be to the East Indies or to Brazil. The vote was for Brazil.\nThe combination of bravery and success that marked this adventure cemented most of the crew\u0027s loyalty to Roberts. They concluded that he was \u0022pistol proof\u0022 and that they had much to gain by staying with him.\n\n\n=== Brazil and the Caribbean ===\nRoberts and his crew crossed the Atlantic and watered and boot-topped their ship on the uninhabited island of Ferdinando. They spent about nine weeks off the Brazilian coast but saw no ships. They were about to leave for the West Indies when they encountered a fleet of 42 Portuguese ships in the Todos os Santos\u0027 Bay, waiting for two men-of-war of 70 guns each to escort them to Lisbon. Roberts took one of the vessels and ordered her master to point out the richest ship in the fleet. He pointed out Sagrada Familia, a ship of 40 guns and a crew of 170, which Roberts and his men boarded and captured. Sagrada Familia contained 40,000 gold moidores and jewellery designed for the King of Portugal, including a cross set with diamonds.\nRover next headed for Devil\u0027s Island off the coast of Guiana to spend the booty. A few weeks later, they headed for the River Surinam where they captured a sloop. After they sighted a brigantine, Roberts took 40 men to pursue it in the sloop, leaving Walter Kennedy in command of Rover. The sloop became wind-bound for eight days, and when Roberts and his crew finally returned to their ship, they discovered that Kennedy had sailed off with Rover and what remained of the loot. Roberts and his crew renamed their sloop Fortune and agreed on new articles, now known as a pirate code, which they swore on a Bible to uphold.\nIn late February 1720, they were joined by French pirate Montigny la Palisse in another sloop, Sea King. The inhabitants of Barbados equipped two well-armed ships, Summerset and Philipa, to try to put an end to the pirate menace. On 26 February, they encountered the two pirate sloops. Sea King quickly fled, and Fortune broke off the engagement after sustaining considerable damage and was able to escape. Roberts headed for Dominica to repair the sloop, with twenty of his crew dying of their wounds on the voyage. There were also two sloops from Martinique out searching for the pirates, and Roberts swore vengeance against the inhabitants of Barbados and Martinique. He allegedly had a new flag made with a drawing of himself holding a flaming sword and standing upon 2 skulls, one labelled ABH and the other AMH , although this is not corroborated by period sources.\n\n\n=== Newfoundland and the Caribbean ===\nFortune next headed northwards towards Newfoundland, raiding Canso, Nova Scotia, and capturing a number of ships around Cape Breton and the Newfoundland banks. Roberts also had a hidden shipyard for careening his fleet in the Mira River. Roberts raided the harbour of Ferryland, capturing a dozen vessels. On 21 June, he attacked the larger harbour of Trepassey, sailing in with black flags flying. In the harbour he discovered 22 merchant ships and 150 fishing ships. All of these vessels were abandoned by their panic-stricken captains and crews, and the pirates were masters of Trepassey without any resistance being offered. Roberts had captured all 22 merchant ships, but was angered by the cowardice of the captains who had fled their ships. Every morning he had a gun fired and the captains were forced to attend Roberts on board his ship; they were told that anyone who was absent would have his ship burnt. One brig from Bristol was taken over by the pirates to replace the sloop Fortune and fitted out with 16 guns. When the pirates left in late June, all the other vessels in the harbour were set on fire. During July, Roberts captured nine or ten French ships and commandeered one of them, fitting her with 26 cannons and changing her name to Good Fortune. With this more powerful ship, the pirates captured many more vessels before heading south for the West Indies, accompanied by Montigny la Palisse\u0027s sloop, which had rejoined them.\nIn September 1720, Good Fortune was careened and repaired at the island of Carriacou before being renamed Royal Fortune, the first of several ships to be given this name by Roberts. In late September, Royal Fortune and Fortune headed for the island of St. Christopher\u0027s and entered Basse Terra Road, flying black flags and with their drummers and trumpeters playing. They sailed in among the ships in the Road, all of which promptly struck their flags. The next landfall was at the island of St. Bartholomew, where the French governor allowed the pirates to remain for several weeks to carouse. By 25 October, they were at sea again off St. Lucia, where they captured up to 15 French and English ships in the next three days. Among the captured ships was Greyhound, whose chief mate James Skyrme joined the pirates. He later became captain of Roberts\u0027 consort, Ranger.\nDuring this time, Roberts reportedly caught Florimond Hurault de Montigny, the Governor of Martinique, who was sailing aboard a 52-gun French warship. The Governor was caught and promptly hanged on the yardarm of his own ship, which the pirates converted into the new Royal Fortune. According to Sanders as well as Konstam and Rickman, this reported capture was an embellishment by Captain Charles Johnson in his A General History of the Pyrates. French sources confirm that while Roberts did capture and torture some French officials by pretending to hang them, he in fact released them, and Hurault was not among them.\n\nBy the spring of 1721, Roberts\u0027 depredations had almost brought seaborne trade to a standstill in the West Indies. Royal Fortune and Good Fortune therefore set sail for West Africa. On 18 April, Thomas Anstis, the commander of Good Fortune, left Roberts in the night and continued to raid shipping in the Caribbean, with future captains John Fenn and Brigstock Weaver aboard. Royal Fortune continued towards Africa.\n\n\n=== West Africa ===\nBy late April, Roberts was at the Cape Verde islands. Royal Fortune was found to be leaky and abandoned there. The pirates transferred to Sea King, which was renamed Royal Fortune. The new Royal Fortune made landfall off the Guinea coast in early June, near the mouth of the Senegal River. Two French ships, one of 10 guns and one of 16 guns, gave chase, but were captured by Roberts. Both ships were commandeered. One, Comte de Toulouse, was renamed Ranger, while the other was named Little Ranger and used as a storeship. Thomas Sutton was made captain of Ranger and James Skyrme captain of Little Ranger.\nRoberts next headed for Sierra Leone, arriving on 12 June. Here he was told by retired pirate John \u0022Old Crackers\u0022 Leadstone that two Royal Navy ships, HMS Swallow and HMS Weymouth, had left at the end of April, planning to return before Christmas. On 8 August, he captured two large ships at Point Cestos, now River Cess in Liberia. One of these was the frigate Onslow, transporting soldiers bound for Cape Coast Castle. A number of the soldiers wished to join the pirates, and they were eventually accepted, however they only received a quarter of a pirates pay because they were not sailors most of their lives. Onslow was converted to become the fourth Royal Fortune. In November and December, the pirates careened their ships and relaxed at Cape Lopez and the island of Annobón. Sutton was replaced by Skyrme as captain of Ranger.\nThey captured several vessels in January 1722, then sailed into Ouidah harbour with black flags flying. The eleven ships at anchor there immediately struck their colours, but were restored to their owners after a ransom of eight pounds of gold dust per ship was paid. When the master of one of the ships refused these terms, Roberts had his crew climb aboard the ship and set her on fire. The captured vessels were slave ships, and the one set on fire had around eighty enslaved Africans on board. They perished either as a result of the fire or by drowning or shark attack after jumping overboard.\n\n\n=== Death in battle ===\n\nOn 5 February 1722, Captain Chaloner Ogle of HMS Swallow came upon the pirate ships Royal Fortune, Ranger, and Little Ranger at Cape Lopez. Swallow veered away to avoid a shoal, making the pirates think that she was a fleeing merchant ship; some sources claim Ogle spotted Roberts\u0027 ships and turned Swallow as a ruse. Ranger departed in pursuit, commanded by James Skyrme. Once out of earshot of the other pirates, Swallow opened her gun ports and opened fire. Ten pirates were killed and Skyrme had his leg taken off by a cannonball, but he refused to leave the deck. Eventually, Ranger was forced to strike her colors, and the surviving crew were captured.\nOn 10 February, Swallow returned to Cape Lopez and found Royal Fortune still there. On the previous day, Roberts had captured Neptune, and many of his crew were drunk and unfit for duty just when he needed them most. At first, the pirates thought that the approaching ship was Ranger returning, but a deserter from Swallow recognized her and informed Roberts while he was breakfasting with Captain Hill, the master of Neptune. As he usually did before action, he dressed himself in his finest clothes:\n\nRoberts himself made a gallant figure, at the time of the engagement, being dressed in a rich crimson damask waistcoat and breeches, a red feather in his hat, a gold chain round his neck, with a diamond cross hanging to it, a sword in his hand, and two pairs of pistols slung over his shoulders ...\u0022\nThe pirates\u0027 plan was to sail past Swallow, which meant exposing themselves to one broadside. Once past, they would have a good chance of escaping. However, the helmsman failed to keep Royal Fortune on the right course, and Swallow was able to approach to deliver a second broadside. Captain Roberts was killed by grapeshot, which struck him in the throat while he stood on the deck. Before his body could be captured by Ogle, Roberts\u0027s wish to be buried at sea with all his arms and ornaments on was fulfilled by his crew, who weighed his body down and threw it overboard after wrapping it in his ship\u0027s sail. It was never found.\n\n\n=== Aftermath ===\n\nThe battle continued for another two hours until Royal Fortune\u0027s mainmast fell and the pirates signaled for quarter. One member of the crew, John Philips, tried to reach the magazine with a lighted match to blow up the ship, but was prevented by two men. Only three pirates had been killed in the battle, including Roberts. A total of 272 pirates serving under Roberts had been captured during the battle; of these, 65 were former African slaves that Roberts had emancipated, and they were sold back into slavery. The remainder were taken to Cape Coast Castle, apart from those who died on the voyage back. 54 were condemned to death, of whom 52 were hanged and two reprieved. Another twenty were allowed to sign indentures with the Royal African Company; Burl comments that they \u0022exchanged an immediate death for a lingering one\u0022. Seventeen men were sent to the Marshalsea prison in London for trial, where some were acquitted and released.\nOf the captured pirates who told their place of birth, 42% were from Cornwall, Devon, and Somerset, and another 19% from London. There were smaller numbers from northern England and from Wales, and another quarter from a variety of countries including Ireland, Scotland, the West Indies, the Netherlands, and Greece.\nCaptain Chaloner Ogle was rewarded with a knighthood, the only British naval officer to be honoured specifically for his actions against pirates. He also profited financially, taking gold dust from Roberts\u0027 cabin, and he eventually became an admiral.\nThis battle proved a turning point in the war against the pirates, and many consider the death of Roberts to mark the end of the Golden Age of Piracy.\n\nThe defeat of Roberts and the subsequent eradication of piracy off the coast of Africa represented a turning point in the slave trade and even in the larger history of capitalism.\r\n\r\n== Roberts\u0027 pirate code ==\n\nAs recorded by Captain Charles Johnson regarding the articles of Bartholomew Roberts:\n\nI. Every man has a vote in affairs of moment; has equal title to the fresh provisions, or strong liquors, at any time seized, and may use them at pleasure, unless a scarcity makes it necessary, for the good of all, to vote a retrenchment.\nII. Every man to be called fairly in turn, by list, on board of prizes because, they were on these occasions allowed a shift of clothes: but if they defrauded the company to the value of a dollar in plate, jewels, or money, marooning was their punishment. If the robbery was only betwixt one another, they contented themselves with slitting the ears and nose of him that was guilty, and set him on shore, not in an uninhabited place, but somewhere, where he was sure to encounter hardships.\nIII. No person to game at cards or dice for money.\nIV. The lights and candles to be put out at eight o\u0027clock at night: if any of the crew, after that hour still remained inclined for drinking, they were to do it on the open deck;\nV. To keep their piece, pistols, and cutlass clean and fit for service.\nVI. No boy or woman to be allowed amongst them. If any man were to be found seducing any of the latter sex, and carried her to sea, disguised, he was to suffer death;\nVII. To desert the ship or their quarters in battle, was punished with death or marooning.\nVIII. No striking one another on board, but every man\u0027s quarrels to be ended on shore, at sword and pistol.\nIX. No man to talk of breaking up their way of living, till each had shared one thousand pounds. If in order to this, any man should lose a limb, or become a cripple in their service, he was to have eight hundred dollars, out of the public stock, and for lesser hurts, proportionately.\nX. The Captain and Quartermaster to receive two shares of a prize: the master, boatswain, and gunner, one share and a half, and other officers one and quarter.\n\nXI. The musicians to have rest on the Sabbath Day, but the other six days and nights, none without special favour.\r\n\r\n== Roberts\u0027 black flags ==\nIn modern history, Roberts has been attributed a variety of black flags from description, however, only two are corroborated by period eyewitness reports, of which one might be two separate designs.\nOne period eyewitness report is found in the Boston Gazette, 22 August 1720. It describes Roberts\u0027 Jolly Roger as “a Black Flag with Death\u0027s head and a cutlass in it”. This design is corroborated by a separate period eyewitness report, given by a William Matthew, as used during the battle of Trepassy harbour, 1720. He describes the flag as featuring “a death\u0027s head and an arm with a cutlass”. These two accounts could describe the same flag or two similar but separate designs. The swordarm was a common motif on naval flags at the time, among others, found on some Dutch bloody flags.\nA second black flag design of Roberts is also known from period eyewitness reports. This design was used onboard one of his consort ships, captained by James Skyrme, in the Battle of Cape Lopez , and was described by British Royal Navy officer Chaloner Ogle, who defeated Roberts and Skyrme in the aforementioned battle, as “a black flag, having a white skeleton in it”.\r\n\r\n== Personal characteristics ==\nMost of the information on Roberts comes from the book A General History of the Pyrates, published a few years after Roberts\u0027 death. The original 1724 title page credits one Captain Charles Johnson as the author. Johnson devotes more space to Roberts than to any of the other pirates in his book, describing him as:\n\n... a tall black [i.e. dark complexioned] Man, near forty Years of Age ... of good natural Parts, and personal Bravery, tho\u0027 he apply\u0027d them to such wicked Purposes, as made them of no Commendation, frequently drinking \u0027Damn to him who ever lived to wear a Halter\u0027.\nRoberts is commonly described as wearing a red waistcoat with scarlet breeches and a scarlet flamingo plume. The red costume may have been to disguise any blood in battle or as a demonstration of his disregard for anonymity. Roberts also wore a large diamond cross which was reputedly the property of the King of Portugal.\nAfter his exploits in Newfoundland, a state Governor from New England commented that \u0022one cannot with-hold admiration for his bravery and courage\u0022. He hated cowardice, and when the crews of 22 ships in Trepassey harbour fled without firing a shot he was angry at their failure to defend their ships.\nRoberts was the archetypal pirate captain in his love of fine clothing and jewelry, but he had some traits unusual in a pirate, notably a preference for drinking tea rather than rum. He is often described as a teetotaler and a Sabbatarian, but there is no proof of this. He certainly disliked drunkenness while at sea, yet it appears that he drank beer. Ironically, Roberts\u0027 final defeat was facilitated by the drunkenness of his crew. The Sabbatarian claim arises from the fact that musicians were not obliged to play on the Sabbath – this may merely have been intended to ensure the musicians a day\u0027s rest, as they were otherwise obliged to play whenever the crew demanded. \nBlack Bart was not as cruel to prisoners as some pirates such as Edward Low and Francis Spriggs, but did not treat them as well as did Samuel Bellamy, Howell Davis, or Edward England. Roberts sometimes gave gifts to cooperative captains and crews of captured ships, such as pieces of jewelry or items of captured cargo. He would sometimes ill-use prisoners if he felt that the crew demanded it, but:\n\nWhen he found that rigour was not expected from his people , then he would give strangers to understand that it was pure inclination that induced him to a good treatment of them, and not any love or partiality to their persons; \u0022For\u0022, says he, \u0022there is none of you but will hang me, I know, whenever you can clinch me within your power.\u0022\r\n\r\n== Popular culture ==\n\n\n=== Modern flags ===\nIn modern history, Roberts has been attributed a variety of flags from description, however, only two are corroborated by period eyewitness sources. The following flags can not be corroborated by period eyewitness sources.",
  "imageNames": [
    "BartRobCrew.jpg",
    "Bart_Roberts_Trying_Deserters_from_the_Pirates_of_the_Spanish_Main_series_N19_for_Allen_and_Ginter_Cigarettes_MET_DP835008.jpg",
    "Bart_Roberts.jpg",
    "BartholomewRoberts.jpg",
    "General_History_of_the_Pyrates_-_Captain_Bartholomew_Roberts_with_two_Ships.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1682,
  "end": 1722,
  "categoryId": "milwrol",
  "id": "barti-ddu",
  "label": "Black Bart"
}