{
  "wikiSummary": "Y Beibl cyssegr-lan sef Yr Hen Destament, a\u0027r Newydd was the first complete translated version of the Bible to appear in Welsh, and the first in any modern Celtic language. It was published in 1588, and the translator was William Morgan.",
  "wikiArticle": "Y Beibl cyssegr-lan sef Yr Hen Destament, a\u0027r Newydd was the first complete translated version of the Bible to appear in Welsh, and the first in any modern Celtic language. It was published in 1588, and the translator was William Morgan.\r\n\r\n== Background ==\nAn Act of Parliament was passed in 1563, for the translation of the Bible into the Welsh language. However, it took some years for the translation to be completed in printed form, leading to its publication in 1588. Morgan was a Cambridge graduate and later became bishop of Llandaff and St Asaph. He based his translation on the Hebrew and Greek original Bibles, consulting also the English Bishops\u0027 and Geneva versions. Y Beibl cyssegr-lan included original translations as well as adaptations of Salesbury\u0027s New Testament. In addition to allowing the Welsh population to read the Bible in their own language, the translation established the literary form of the Welsh language and was highly influential on the development of Welsh literature.\r\n\r\n== 1620 version ==\nThe 1620 edition of Y Beibl Cyssegr-lan, sef yr Hen Destament a\u0027r Newydd was largely identical to previous printed editions, apart from its size. The 1620 version is known as the first family or everyday Bible in the Welsh language. Bishop Richard Parry of St Asaph was initially considered its main contributor, modifying William Morgan\u0027s 1588 translation of the Bible; he himself did not recognize any other contributing partners. However, evidence shows that his brother-in-law, scholar Dr John Davies, reformed and standardized most of Morgan\u0027s 1588 translation.",
  "imageNames": [
    "1588_First_Welsh_Bible.jpg",
    "Bible.malmesbury.arp.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": true,
  "date": 1588,
  "categoryId": "diwylliant",
  "id": "beibl",
  "label": "Welsh Bible"
}