{
  "wikiSummary": "The Cadfan Stone is a 7th-9th century stone that has the earliest known Welsh language inscription, specifically in Old Welsh. The stone is located inside St Cadfan\u0027s Church, Tywyn, Gwynedd.",
  "wikiArticle": "The Cadfan Stone is a 7th-9th century stone that has the earliest known Welsh language inscription, specifically in Old Welsh. The stone is located inside St Cadfan\u0027s Church, Tywyn, Gwynedd.\r\n\r\n== History ==\nThe stone was once thought to mark the grave of both Saint Cadfan and Cyngen Glodrydd, late king of Powys, roughly dating it to the first half of the sixth century. However more recent scholarship dates the inscriptions to far later: Ifor Williams dated them to the 8th century, and a late 7th century or early 8th century date was suggested by Kenneth H. Jackson. A date between the 7th century and the 9th century is suggested by Coflein, the website of the Royal Commission on the Ancient and Historical Monuments of Wales. Nancy Edwards assigned the stone firmly to the ninth century.\nDespite its undoubted significance, the Cadfan Stone has been given relatively little attention from Welsh authors and poets. Exceptions include the poems \u0027Cofebion Tywyn\u0027 by Owain Owain and \u0027Y boen\u0027 by Myrddin ap Dafydd.\nOriginally the stone stood over 2.3 metres tall, but it now measures  2.18m tall by 0.25m and 0.2m.\r\n\r\n== Interpretation ==\nBelow is the interpretation given in the most recent study of the stone by Nancy Edwards.\n\nA/D. Tengr ui cimalted gu / Adgan // anterunc du But Marciau\n\u0027Tengrumui wedded wife of Adgan fairly near to Bud Marciau .\u0027\n\nA. m c ar tr \u0027The mortal remains of the three\u0027\n\nB/C. Cun ben Celen // tricet nitanam\n\u0027Cun woman , a mortal wound remains.\u0027\n\nC. mort/cic pe/tuar\n\u0027The mortal remains of four\u0027",
  "imageNames": [
    "Carreg_Cadfan.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 810,
  "categoryId": "lleoedd",
  "id": "carreg-cadfan",
  "label": "Cadfan Stone"
}