{
  "wikiSummary": "Harlech Castle in Harlech, Gwynedd, Wales, is a Grade I listed medieval fortification built onto a rocky knoll close to the Irish Sea. It was built by Edward I during his invasion of Wales between 1282 and 1289 at the relatively modest cost of £8,190. Over the next few centuries, the castle played an important part in several wars, withstanding the siege of Madog ap Llywelyn between 1294 and 1295, but falling to Prince Owain Glyndŵr in 1404. It then became Glyndŵr\u0027s residence and military headquarters for the remainder of the uprising until being recaptured by English forces in 1409. During the 15th-century Wars of the Roses, Harlech was held by the Lancastrians for seven years, before Yorkist troops forced its surrender in 1468, a siege memorialised in the song \u0022Men of Harlech\u0022. Following the outbreak of the English Civil War in 1642, the castle was held by forces loyal to Charles I, holding out until 1647 when it became the last fortification to surrender to the Parliamentary armies. In the 21st century the ruined castle is managed by Cadw, the Welsh Government\u0027s historic environment service, as a tourist attraction.\nUNESCO considers Harlech, with three others at Beaumaris, Conwy and Caernarfon, to be one of \u0022the finest examples of late 13th century and early 14th century military architecture in Europe\u0022, and it is classed as a World Heritage Site. The fortification is built of local stone and concentric in design, featuring a massive  gatehouse that probably once provided high-status accommodation for the castle constable and visiting dignitaries. The sea originally came much closer to Harlech than in modern times, and a water-gate and a long flight of steps leads down from the castle to the former shore, which allowed the castle to be resupplied by sea during sieges. In keeping with Edward\u0027s other castles in the north of Wales, the architecture of Harlech has close links to that found in the County of Savoy during the same period, an influence probably derived from the Savoy origins of the main architect, James of Saint George.",
  "wikiArticle": "Harlech Castle in Harlech, Gwynedd, Wales, is a Grade I listed medieval fortification built onto a rocky knoll close to the Irish Sea. It was built by Edward I during his invasion of Wales between 1282 and 1289 at the relatively modest cost of £8,190. Over the next few centuries, the castle played an important part in several wars, withstanding the siege of Madog ap Llywelyn between 1294 and 1295, but falling to Prince Owain Glyndŵr in 1404. It then became Glyndŵr\u0027s residence and military headquarters for the remainder of the uprising until being recaptured by English forces in 1409. During the 15th-century Wars of the Roses, Harlech was held by the Lancastrians for seven years, before Yorkist troops forced its surrender in 1468, a siege memorialised in the song \u0022Men of Harlech\u0022. Following the outbreak of the English Civil War in 1642, the castle was held by forces loyal to Charles I, holding out until 1647 when it became the last fortification to surrender to the Parliamentary armies. In the 21st century the ruined castle is managed by Cadw, the Welsh Government\u0027s historic environment service, as a tourist attraction.\nUNESCO considers Harlech, with three others at Beaumaris, Conwy and Caernarfon, to be one of \u0022the finest examples of late 13th century and early 14th century military architecture in Europe\u0022, and it is classed as a World Heritage Site. The fortification is built of local stone and concentric in design, featuring a massive  gatehouse that probably once provided high-status accommodation for the castle constable and visiting dignitaries. The sea originally came much closer to Harlech than in modern times, and a water-gate and a long flight of steps leads down from the castle to the former shore, which allowed the castle to be resupplied by sea during sieges. In keeping with Edward\u0027s other castles in the north of Wales, the architecture of Harlech has close links to that found in the County of Savoy during the same period, an influence probably derived from the Savoy origins of the main architect, James of Saint George.\r\n\r\n== History ==\n\n\n=== 13th–14th centuries ===\nIn local mythology, the site of Harlech Castle in North Wales is associated with the legend of Branwen, a Welsh princess, but there is no evidence for a native Welsh fortification having been built there. The kings of England and the Welsh princes had vied for control of North Wales since the 1070s and the conflict was renewed during the 13th century, leading to Edward I intervening in North Wales for the second time during his reign in 1282. Edward invaded with a huge army, pushing north from Carmarthen and westwards from Montgomery and Chester. English forces advanced down the Conwy valley and through Dolwyddelan and Castell y Bere, onto Harlech, which Sir Otton de Grandson took with 560 infantry in May.\n\nEdward ordered the construction of a castle at Harlech, one of seven built across North Wales in the wake of the 1282 campaign. Money to pay for the initial phase arrived in mid-May and carpenters and 35 stonemasons were dispatched in June and July to commence work. By the winter of 1283, the first 15 feet of the inner walls had been constructed, allowing the castle to be defended in the event of an attack, and a small, planned town had been founded alongside the castle. John de Bonvillars was appointed the constable of the castle in 1285; after his death in 1287 his wife, Agnes, took up the role until 1290.\nConstruction continued under the overall direction of James of Saint George, a Savoy architect and military engineer. In 1286, at the height of the construction, the workforce comprised 546 general labourers, 115 quarriers, 30 blacksmiths, 22 carpenters and 227 stonemasons, and the project was costing nearly £240 a month. The castle was essentially complete by the end of 1289, having cost an estimated £8,190, around 10 percent of the £80,000 that Edward spent on castle-building in Wales between 1277 and 1304.\nHarlech was established with a garrison of 36 men: a constable, 30 men, including 10 crossbowmen, a chaplain, a smith, carpenter and stonemason, and Master James was rewarded by being made the constable of Harlech from 1290 to 1293. In 1294, Madog ap Llywelyn began an uprising against English rule that spread quickly through Wales. Several English-held towns were razed and Harlech, along with Criccieth Castle and Aberystwyth Castle, were besieged that winter. Fresh supplies were sent from Ireland by sea, arriving via Harlech\u0027s water gate, and the uprising was quashed. In the aftermath of the revolt, additional defences were built around the route down to the sea. Further work was undertaken between 1323 and 1324, following the Despenser War; Edward II was threatened in the region by the Mortimer Marcher Lord family, and ordered his sheriff, Sir Gruffudd Llwyd, to extend the defences leading up to the gatehouse with additional towers.\n\n\n=== 15th–17th centuries ===\n\nIn 1400 a revolt broke out in North Wales against English rule, led by Owain Glyndŵr. By 1403 only a handful of castles, including Harlech, still stood against the rebels, but the castle was under-equipped and under-staffed to withstand a siege, the garrison having just three shields, eight helmets, six lances, ten pairs of gloves, and four guns. At the end of 1404, the castle fell to Glyndŵr. Harlech became his residence, family home and military headquarters for four years; he held his second parliament in Harlech in August 1405. In 1408 English forces under the command of the future Henry V placed Harlech and its commander, Edmund Mortimer, under siege, conducting a bombardment with cannon, probably destroying the south and east parts of the outer walls. When this failed to take the castle, Henry left John Talbot in charge of the siege and moved on to deal with Aberystwyth Castle. Supplies finally ran short, Mortimer and many of his men died of exhaustion, and Harlech fell in February 1409.\nIn the 15th century, Harlech was involved in the series of civil wars now known as the Wars of the Roses that broke out between the rival factions of the House of Lancaster and House of York. In 1460, following the Battle of Northampton, Queen Margaret of Anjou fled to the castle and between 1461 and 1468 it was held by her Lancastrian supporters, under the command of Dafydd ap Ieuan, against the Yorkist Edward IV. Thanks to its natural defences and the supply route by sea, Harlech held out and as other fortresses fell, eventually became the last major stronghold still under Lancastrian control. The castle became a base for their operations across the region: there were planned operations in 1464, Sir Richard Tunstall mounted attacks from Harlech in 1466 and Jasper Tudor landed there with French reinforcements in 1468, before then raiding the town of Denbigh. Tudor\u0027s arrival caused Edward IV to order William Herbert to mobilise an army, possibly up to 10,000 strong, to finally seize the castle. After a month\u0027s siege, the small garrison surrendered on 14 August. This siege is credited with inspiring the song Men of Harlech.\nThe English Civil War broke out in 1642 between the Royalist supporters of Charles I and the supporters of Parliament. Harlech apparently had not been repaired following the 1468 siege, and had become completely dilapidated, with the exception of the gatehouse, which was used for the local assizes. In 1644 Prince Rupert appointed a local Royalist, Colonel William Owen, as the castle\u0027s constable, and Owen was entrusted with repairing the fortifications. A long siege ensued from June 1646 until 15 March 1647, when the garrison of 44 men surrendered to Major-General Thomas Mytton. The castle was the last mainland royal fortress to surrender in the war, and the date marked the end of the first phase of the war. The castle was no longer required for the security of North Wales and, to prevent any further use by the Royalists, Parliament ordered its slighting, or destruction. The orders were only partially carried out, however, and the gatehouse staircases were destroyed and the castle rendered generally unusable, but it was not totally demolished. Stone from the castle was reused to build houses in the local town.\n\n\n=== 18th–21st centuries ===\n\nIn the late-18th and 19th centuries, the picturesque ruins of Harlech  began to attract visits from prominent artists, including John Cotman, Henry Gastineau, Paul Sandby, J. M. W. Turner and John Varley. In 1914 it was transferred from the Merioneth Crown Estate to the control of the Office of Works, who commenced a major restoration project after the end of World War I. In 1969 the castle was transferred to the Welsh Office and then to Cadw, who manage the property in the 21st century as a tourist attraction. Harlech was declared part of the Castles and Town Walls of King Edward in Gwynedd World Heritage Site in 1986, UNESCO considering Harlech one of \u0022the finest examples of late 13th century and early 14th century military architecture in Europe\u0022.\r\n\r\n== Architecture ==\n\nHarlech Castle rests upon part of the Harlech Dome, a spur of rock almost 200 feet high; the land falls away sharply on the north and west, and a ditch cut into the rock protects the remaining approaches to the castle. The castle has a concentric design, with one line of defences enclosed by another, forming an inner and outer ward; the outer wall was originally somewhat taller than today. Harlech is built from local grey-green sandstone, with large, regular blocks used for the towers and irregular material, possibly taken from the ditch, used for the walls. A softer yellow sandstone is used for the decorative work in the castle, possibly quarried from around Egryn Abbey near Barmouth.\nThe main entrance to the castle would have involved crossing a stone bridge between the two easterly ditch bridge towers and the main gatehouse; little remains of the bridge towers today and a timber entrance way to the gatehouse replaces the bridge. A water gate overlooks a protected stairway of 127 steps that runs down to the foot of the cliffs. In the 13th century, the sea came up close to the stairway, allowing resupply by sea, but today the sea has retreated significantly, making it more difficult to envisage the concept in its original setting.\n\nThe gatehouse follows the design, sometimes termed the Tonbridge-style, that became popular during the 13th century, with two massive \u0022D-shaped\u0022 defensive towers flanking the entrance. The passage into the castle was guarded by three portcullises and at least two heavy doors. The gatehouse has two upper floors, broken up into various rooms. Each floor has three large windows overlooking the inner ward; the second floor has two additional grand windows on the sides of the gatehouse; the gatehouse was fitted with fireplaces and would originally have had prominent chimneys. The use of these rooms has been the subject of academic debate: historian Arnold Taylor argued that the first floor of the gatehouse was used by the constable as living accommodation, with the second floor used by senior visitors; Jeremy Ashbee has since challenged this interpretation, suggesting the high status accommodation may instead have been in the inner ward, and the gatehouse used for other purposes.\nThe inner ward is guarded by four large circular towers. Over time these acquired various names: in 1343, clockwise from the north-east, they were called Le Prisontour, Turris Ultra Gardinium, Le Wedercoktour and Le Chapeltour, but by 1564 they had been renamed the Debtors\u0027, Mortimer, Bronwen and Armourer\u0027s Towers respectively. Le Prisontour incorporated a dungeon and the Le Chapeltour may have contained an artillery workshop in the 16th century. Several ranges of buildings were built around the inner ward, including a chapel, kitchen, service buildings, a granary and a great hall. The battlements may originally have been built with triple finials in a similar fashion to Conwy, although little remains of these in the modern era.\nThe architecture of Harlech has close links to that found in the Savoy in the same period. These include semi-circular door arches, window styles, corbelled towers and positioning of putlog holes, and are usually ascribed to the influence of the Savoy architect Master James. The links between the Harlech and Savoy are not straightforward, however, as in some cases the relevant Savoy structures were built after James had left the region. The similarity in architectural details may, therefore, be the result of the wider role played by Savoy craftsmen and engineers on the Harlech project.\r\n\r\n== Gallery ==",
  "location": {
    "lat": 52.86,
    "long": -4.11
  },
  "imageNames": [
    "The_castle_Harlech_Castle_Wales_LOC_3751638943.jpg",
    "Castell_Harlech_-_geograph.org.uk_-_3102163.jpg",
    "Castell_a_Morfa_Harlech_Gwynedd_Mai_2024_-_Parc_Cenedlaethol_Eryri_National_Park_03.jpg",
    "Francis_Frith_Harlech_Castle_ca._1855–80.jpg",
    "Harlech_the_castle_from_the_northwest_-_geograph.org.uk_-_3926150.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1282,
  "categoryId": "lleoedd",
  "id": "castell-harlech",
  "label": "Harlech Castle"
}