{
  "wikiSummary": "Conwy Castle is a fortification in Conwy, located in North Wales. It was built by Edward I, during his conquest of Wales, between 1283 and 1287. Constructed as part of a wider project to create the walled town of Conwy, the combined defences cost around £15,000, a massive sum for the period. Over the next few centuries, the castle played an important part in several wars. It withstood the siege of Madog ap Llywelyn in the winter of 1294–95, acted as a temporary haven for Richard II in 1399 and was held for several months by forces loyal to Owain Glyndŵr in 1401.\nFollowing the outbreak of the English Civil War in 1642, the castle was held by forces loyal to Charles I, holding out until 1646 when it surrendered to the Parliamentary armies. In the aftermath, the castle was partially slighted by Parliament to prevent it being used in any further revolt, and was finally completely ruined in 1665 when its remaining iron and lead was stripped and sold off. Conwy Castle became an attractive destination for painters in the late 18th and early 19th centuries. Visitor numbers grew and initial restoration work was carried out in the second half of the 19th century. In the 21st century, the ruined castle is managed by Cadw as a tourist attraction.\nUNESCO considers Conwy to be one of \u0022the finest examples of late 13th century and early 14th century military architecture in Europe\u0022, and it is classed as a World Heritage Site. The rectangular castle is built from local and imported stone and occupies a coastal ridge, originally overlooking an important crossing point over the River Conwy. Divided into an Inner and an Outer Ward, it is defended by eight large towers and two barbicans, with a postern gate leading down to the river, allowing the castle to be resupplied from the sea. It retains the earliest surviving stone machicolations in Britain and what historian Jeremy Ashbee has described as the \u0022best preserved suite of medieval private royal chambers in England and Wales\u0022. In keeping with other Edwardian castles in North Wales, the architecture of Conwy has close links to that found in the Savoy during the same period, an influence probably derived from the Savoy origins of the main architect, James of Saint George.",
  "wikiArticle": "Conwy Castle is a fortification in Conwy, located in North Wales. It was built by Edward I, during his conquest of Wales, between 1283 and 1287. Constructed as part of a wider project to create the walled town of Conwy, the combined defences cost around £15,000, a massive sum for the period. Over the next few centuries, the castle played an important part in several wars. It withstood the siege of Madog ap Llywelyn in the winter of 1294–95, acted as a temporary haven for Richard II in 1399 and was held for several months by forces loyal to Owain Glyndŵr in 1401.\nFollowing the outbreak of the English Civil War in 1642, the castle was held by forces loyal to Charles I, holding out until 1646 when it surrendered to the Parliamentary armies. In the aftermath, the castle was partially slighted by Parliament to prevent it being used in any further revolt, and was finally completely ruined in 1665 when its remaining iron and lead was stripped and sold off. Conwy Castle became an attractive destination for painters in the late 18th and early 19th centuries. Visitor numbers grew and initial restoration work was carried out in the second half of the 19th century. In the 21st century, the ruined castle is managed by Cadw as a tourist attraction.\nUNESCO considers Conwy to be one of \u0022the finest examples of late 13th century and early 14th century military architecture in Europe\u0022, and it is classed as a World Heritage Site. The rectangular castle is built from local and imported stone and occupies a coastal ridge, originally overlooking an important crossing point over the River Conwy. Divided into an Inner and an Outer Ward, it is defended by eight large towers and two barbicans, with a postern gate leading down to the river, allowing the castle to be resupplied from the sea. It retains the earliest surviving stone machicolations in Britain and what historian Jeremy Ashbee has described as the \u0022best preserved suite of medieval private royal chambers in England and Wales\u0022. In keeping with other Edwardian castles in North Wales, the architecture of Conwy has close links to that found in the Savoy during the same period, an influence probably derived from the Savoy origins of the main architect, James of Saint George.\r\n\r\n== History ==\n\n\n=== 13th century ===\nBefore the English built the town of Conwy, Aberconwy Abbey, the site was occupied by a Cistercian monastery favoured by the Welsh princes, as well as the location of one of the palaces of the Welsh princes. From Conwy: \u0022the oldest structure is part of the town walls, at the southern end of the east side. Here one wall and the tower of a llys [palace/court house] belonging to Llywelyn the Great and his grandson Llywelyn ap Gruffydd have been incorporated into the wall. Built on a rocky outcrop, with an apsidal tower, it is a classic, native, Welsh build and stands out from the rest of the town walls, due to the presence of four window openings. It dates from the early 13th century and is the most complete remnant of any of his Llys.\u0022\nThe location also controlled an important crossing point over the River Conwy between the coastal and inland areas of North Wales, that Deganwy Castle for many years had defended. The kings of England and the Welsh princes had vied for control of the region since the 1070s and the conflict had resumed during the 13th century, leading to Edward I intervening in North Wales for the second time during his reign in 1282.\n\nEdward invaded with a huge army, pushing north from Carmarthen and westwards from Montgomery and Chester. Edward captured Aberconwy in March 1283 and decided that the location would form the centre of a new county: he would relocate the abbey eight miles up the Conwy valley to a new site at Maenan, establishing Maenan Abbey, and build a new English castle and walled town on the monastery\u0027s former site. The ruined castle of Deganwy was abandoned and never rebuilt. Edward\u0027s plan was a colonial enterprise and placing the new town and walls on top of such a high-status native Welsh site was in part a symbolic act to demonstrate English power.\nWork began on cutting the ditch around Conwy Castle within days of Edward\u0027s decision. The work was controlled by Sir John Bonvillars and overseen by master mason James of St. George, and the first phase of work between 1283 and 1284 focused on creating the exterior curtain walls and towers. In the second phase, from 1284 and 1286, the interior buildings were erected, while work began on the walls for the neighbouring town. By 1287, the castle was complete. The builders recruited huge numbers of labourers from across England for the task. At each summer building season, the labourers massed at Chester and then walked into Wales. Edward\u0027s accountants did not separate the costs of the town walls from that of the castle, but the total cost of the two projects came to around £15,000, a huge sum for the period.\nThe castle\u0027s constable was, by a royal charter of 1284, also the mayor of the new town of Conwy , and oversaw a castle garrison of 30 soldiers, including 15 crossbowmen, supported by a carpenter, chaplain, blacksmith, engineer and a stonemason. The first constable of the castle was Sir William de Cicon who had previously been the first constable of Rhuddlan Castle. In 1294 Madog ap Llywelyn rebelled against English rule. Edward was besieged at Conwy by the Welsh between December and January 1295, supplied only by sea, before forces arrived to relieve him in February. Chronicler Walter of Guisborough suggested that given the austere conditions Edward refused to drink his own private supply of wine, and instead had it shared out amongst the garrison. For some years afterwards, the castle formed the main residence for visiting senior figures, and hosted Edward\u0027s son, the future Edward II in 1301 when he visited the region to receive homage from the Welsh leaders.\n\n\n=== 14th–15th centuries ===\n\nConwy Castle was not well maintained during the early 14th century and by 1321 a survey reported it was poorly equipped, with limited stores and suffering from leaking roofs and rotten timbers. These problems persisted until Edward, the Black Prince, took over control of the castle in 1343. Sir John Weston, his chamberlain, conducted repairs, building new stone support arches for the great hall and other parts of the castle. After the death of the Black Prince, however, Conwy fell into neglect again.\nAt the end of the 14th century, the castle was used as a refuge by Richard II from the forces of his rival, Henry Bolingbroke. On 12 August 1399, after returning from Ireland, Richard made his way to the castle where he met Bolingbroke\u0027s emissary, Henry Percy, for negotiations. Percy swore in the chapel he would not harm the king. On 19 August, Richard surrendered to Percy at Flint Castle, promising to abdicate if his life were spared. The king was then taken to London and died later in captivity at Pontefract Castle.\nHenry Bolingbroke took the English throne to rule as Henry IV in 1399, but rebellion broke out in North Wales shortly afterwards under the leadership of Owain Glyndŵr. In April 1401, on Good Friday, Rhys ap Tudur and his brother Gwilym, cousins of Owain Glyndŵr, undertook a surprise attack on Conwy Castle. Pretending to be carpenters repairing the castle, the two gained entry, killed the two watchmen on duty and took control of the fortress. Welsh rebels then attacked and captured the rest of the walled town. The brothers held out for around three months, before negotiating a surrender; as part of this agreement the pair were given a royal pardon by Henry.\nDuring the War of the Roses between 1455 and 1485, fought by the rival factions of the Lancastrians and the Yorkists, Conwy was reinforced but played little part in the fighting. Henry VIII conducted restoration work in the 1520s and 1530s, during which time the castle was being used as a prison, a depot and as a potential residence for visitors.\n\n\n=== 17th–21st centuries ===\n\nConwy Castle fell into disrepair again by the early 17th century. Charles I sold it to Edward Conway in 1627 for £100, and Edward\u0027s son, also called Edward, inherited the ruin in 1631. In 1642 the English Civil War broke out between the Charles\u0027 royalist supporters and Parliament. John Williams, the Archbishop of York, took charge of the castle on behalf of the king, and set about repairing and garrisoning it at his own expense. In 1645, Sir John Owen was appointed governor of the castle instead, however, leading to a bitter dispute between the two men. The Archbishop defected to Parliament, the town of Conwy fell in August 1646 and in November General Thomas Mytton finally took the castle itself after a substantial siege. The Trevor family petitioned Mytton for the return of property in the castle that they had lent to the Archbishop.\nIn the aftermath of the siege, Colonel John Carter was appointed governor of the castle and fresh repairs were carried out. In 1655 the Council of State appointed by Parliament ordered the castle to be slighted, or put beyond military use: the Bakehouse tower was probably deliberately partially pulled down at this time as part of the slighting. With the restoration of Charles II in 1660, Conwy was returned to Edward Conway, the Earl of Conway, but five years later Edward decided to strip the remaining iron and lead from the castle and sell it off. The work was completed under the supervision of Edward Conway\u0027s overseer William Milward, despite opposition from the leading citizens of Conwy, and turned the castle into a total ruin.\nBy the end of the 18th century, the ruins were considered picturesque and sublime, attracting visitors and artists, and paintings of the castle were made by Thomas Girtin, Moses Griffith, Julius Caesar Ibbetson, Paul Sandby and J. M. W. Turner. Several bridges were built across the River Conwy linking the town and Llandudno during the 19th century, including a road bridge in 1826 and a rail bridge in 1848. These improved communication links with the castle and further increased tourist numbers. In 1865 Conwy Castle passed from the Holland family, who had leased it from the descendants of the Conways to the civic leadership of Conwy town. Restoration work on the ruins then began, including the reconstruction of the damaged Bakehouse tower. In 1953 the castle was leased to the Ministry of Works and Arnold Taylor undertook a wide range of repairs and extensive research into the castle\u0027s history. An additional road bridge was built to the castle in 1958. Already protected as a scheduled monument, in 1986 it was also declared part of the World Heritage Site of the \u0022Castles and Town Walls of King Edward in Gwynedd\u0022.\nIn the 21st century the castle is managed by Cadw as a tourist attraction and 186,897 tourists visited the castle in 2010; a new visitor centre was opened in 2012. The castle requires ongoing maintenance and repairs cost £30,000 over the 2002–03 financial year.\nConwy Castle was twinned with Himeji Castle, Hyōgo Prefecture, Japan at a formal ceremony in Himeji on 29 October 2019.\nIn December 2023, Condé Nast voted the castle as the most stunning in Europe, beating the likes of Eilean Donan in Scotland, and Kylemore Abbey in Ireland.\r\n\r\n== Architecture ==\n\nThe castle hugs a rocky coastal ridge of grey sandstone and limestone, and much of the stone from the castle is largely taken from the ridge itself, probably when the site was first cleared. The local stone was not of sufficient quality to be used for carving details such as windows, however, and accordingly sandstone was brought in from the Creuddyn peninsula, Chester and the Wirral. This sandstone was more colourful than the local grey stone, and was probably deliberately chosen for its appearance.\nThe castle has a rectangular plan and is divided into an Inner and Outer Ward, separated by a cross-wall, with four large, 70-foot tall towers on each side; originally the castle would have been white-washed using a lime render. The outside of the towers still have the putlog holes from their original construction, where timbers were inserted to create a spiralling ramp for the builders. Although now somewhat decayed, the battlements originally sported triple finial designs and featured a sequence of square holes running along the outside of the walls. It is uncertain what these holes were used for – they may have been drainage holes, supports for defensive hoarding or for displaying ornamental shields.\nThe main entrance to the castle is through the western barbican, an exterior defence in front of the main gate. When first built, the barbican was reached over a drawbridge and a masonry ramp that came up sharply from the town below; the modern path cuts east along the outside of the walls. The barbican features the earliest surviving stone machicolations in Britain, and the gate would originally have been protected by a portcullis.\n\nThe gate leads through to the Outer Ward which, when first built, would have been full of various administrative and service buildings. The north-west tower was reached through the porter\u0027s lodge and contained limited accommodation and space for stores. The south-west tower may have been used either by the castle\u0027s constable, or by the castle\u0027s garrison, and also contained a bakehouse. On the south side of the ward is a range of buildings that included the great hall and chapel, sitting on top of the cellars, which are now exposed. The stubs and one surviving stone arches from the 1340s can still be seen. Behind the great hall was the tower used by the constable for detaining prisoners; this included a special room for holding prisoners, called the \u0022dettors chambre\u0022 in the 16th century, and an underground dungeon. On the north side of the ward was a range of service buildings, including a kitchen, brewhouse and bakehouse, backed onto by the kitchen tower, containing accommodation and storerooms.\nThe Inner Ward was originally separated from the Outer Ward by an internal wall, a drawbridge and a gate, protected by a ditch cut into the rock. The ditch was filled in during the 16th century and the drawbridge removed. The spring-fed castle well built alongside the gate survives, and today is 91-foot deep. Inside, the ward contained the chambers for the royal household, their immediate staff and service facilities; today, historian Jeremy Ashbee considers them to be the \u0022best-preserved suite of medieval private royal chambers in England and Wales\u0022. They were designed to form a royal palace in miniature, that could, if necessary, be sealed off from the rest of the castle and supplied from the eastern gate by sea almost indefinitely, although in practice they were rarely used by the royal family.\n\nThe royal rooms were positioned on the first floor of a range of buildings that ran around the outside of the ward, facing onto a courtyard. The four towers that protected the Inner Ward contained service facilities, with the Chapel Tower containing the private royal chapel. Each tower has an additional watchtower turret, probably intended both for security and to allow the prominent display of the royal flag. The arrangement was originally similar to that of the 13th century Gloriette at Corfe Castle, and provided a combination of privacy for the king while providing extensive personal security. The two sets of apartments were later unified into a single set of rooms, including a great chamber, outer chamber and inner chamber.\nOn the east side of the Inner Ward is another barbican, enclosing the castle garden. This was overlooked by the royal apartments, and changed in style over the years: in the early 14th century there was a lawn, in the late 14th century vines, in the 16th century crab-apple trees and a lawn and in the 17th century formal ornamental flowers. A postern gate originally led down to the river where a small dock was built, allowing key visitors to enter the castle in private and for the fortress to be resupplied by boat, although this gate is now concealed by the later bridges built on the site.\n\nThe architecture of Conwy has close to links to that found in the County of Savoy in the same period. These include window styles, the type of crenellation used on the towers and positioning of putlog holes, and are usually ascribed to the influence of the Savoy architect Master James. Notably the three pinnacled merlons are a feature seen at the Savoyard Castello San Giorio di Susa which had been visited by Edward on his way back from crusade in 1273.\r\n\r\n== Constable of the Castle ==\nThe official roles of the Constable were:\n\nGovernor of the castle\nGovernor of the fortified borough\nKeeper of the castle jail\nMayor\nas well as extraordinary duties.\nDuring 1283 the castle was recorded to have a garrison of:\n\n30 men 15 crossbowmen 1 superintendent at arms 1 chaplain 1 stonemason 1 carpenter 1 artisan and 10 others .\nWilliam De Sikun was the constable, with a yearly fee of £190 .\n\n\n=== List of Constables of Conwy Castle ===\nThis is the list of the constables of Conwy castle and their reigning Monarchs from the Principality of Wales, the Kingdom of England and then the Commonwealth of England without hiatus until today\u0027s monarchy of Great Britain.\r\n\r\n== Gallery ==",
  "location": {
    "lat": 53.28,
    "long": -3.825556
  },
  "imageNames": [
    "Conway_Castle_watercolour_1.jpg",
    "Conwy-Castle-0006.jpg",
    "Conwy_-_Conwy_Castle_-_20190720135715.jpg",
    "Conwy_Castle_Conwy_-_geograph.org.uk_-_2485295.jpg",
    "Conwy_Castle_Conwy_-_geograph.org.uk_-_3833058.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1287,
  "categoryId": "lleoedd",
  "id": "castell-conwy",
  "label": "Conwy Castle"
}