{
  "wikiSummary": "The Welsh Language Society is a direct action pressure group in Wales campaigning for the right of Welsh people to use the Welsh language in every aspect of their lives. The chair of the Welsh Language Society since October 2023 is Joseff Gnagbo.",
  "wikiArticle": "The Welsh Language Society is a direct action pressure group in Wales campaigning for the right of Welsh people to use the Welsh language in every aspect of their lives. The chair of the Welsh Language Society since October 2023 is Joseff Gnagbo.\r\n\r\n== History ==\n\n\n=== 1960s ===\n\nThe Society was established in name on 4 August 1962 at Pontarddulais in South Wales, but did not have a constitution until 18 May 1963. The formation was at least partly inspired by the annual BBC Wales Radio Lecture given on 13 February 1962 by Saunders Lewis and entitled Tynged yr iaith . Historian John Davies has said that the lecture was \u0022the catalyst\u0022 for the formation of the Welsh Language Society,  and the start of a period of direct-action agitation to enhance the status of the Welsh language. Its direct effect on the formation of the Society is described in a history of that society.\nThe Society\u0027s first public protest took place in February 1963 in Aberystwyth town centre, where members pasted posters on the post office in an attempt to be arrested and go to trial. When it became apparent that they would not be arrested for the posters, they then moved to Pont Trefechan in Aberystwyth, where around seventy members and supporters held a sit-in blocking road traffic for half an hour.\nThe first campaigns were for official status for the language, with a call for Welsh-language tax returns, schools, electoral forms, post office signs, birth certificates and so on. This was done through the formation of \u0027cells\u0027, the first operating in Bangor in April 1963 by Owain Owain who also founded and edited the Society\u0027s only publication, Tafod y Ddraig and designed the logo.\nIn 1968 a sit-in was held at the news and television studio and the newsroom department of the BBC at Broadway, Cardiff, by members of the Society. The sit-in was calling for the BBC to use more Welsh.\n\n\n=== 1970s and 1980s ===\n\nThe society believes in direct action, and in the course of its campaigns over a thousand people have appeared before the courts for their part in various campaigns, many receiving prison sentences, making it Britain\u0027s largest protest group since the suffragettes – in terms of fines and the numbers sent to prison.  Typical actions include painting slogans on buildings owned by businesses, and other minor criminal damage.\nAt the beginning of the 1970s, the society began to campaign for a Welsh-language radio and television service. Radio Cymru was established in 1977, but in 1979 the Conservative government under Margaret Thatcher announced that it would not keep its election promise to establish a separate Welsh-language television channel. Some protesters refused to buy television licences and others climbed up television masts and invaded television studios.\nThere was much damage to radio and television transmitters:\n\nBlaenplwyf transmitter was damaged on Monday 7 February 1977, costing £25,000, Dyfed–Powys Police arrested the leader at his home at Cenarth; there was another break-in on Monday 19 November 1979, which included John Rowlands and Geraint H. Jenkins\nWaltham was turned off from 10 pm on Thursday 2 November 1978; the group had broken into The Wrekin on the same night, but had turned off the wrong switch.\nMidhurst was damaged on Thursday 8 February 1979; BBC1 transmissions were restored by Friday but BBC2 took three more days; it caused £15,700 of damage; 23 year old Hywel Pennar, a student at St David\u0027s Lampeter, was jailed for 9 months; he was the son of Pennar Davies, the Principal from 1959 to 1979 of Swansea Theological College\nSudbury in Suffolk was damaged on Thursday 15 March 1979 with £20,000 of damage.\nThe government reversed its position and a Welsh-language TV channel, S4C, was launched in 1982.\n\n\n=== 2000s ===\n\nOn 24 July 2004 , Radio Carmarthenshire\u0027s studios in Narberth were invaded by eleven activists from the Welsh Language Society. They were protesting against Radio Carmarthenshire\u0027s decision to limit the amount of its Welsh-language programming. The offices and studios were stormed during a live broadcast, taking Radio Carmarthenshire and Pembrokeshire off-air for fifteen minutes. According to Keri Jones , his head of sales was injured, and needed hospital treatment for a fractured wrist sustained during the scuffles which ensued. Police arrested eleven activists, and subsequently released them pending further enquiries. The chair of the movement Steffan Cravos was later found not guilty of causing grievous bodily harm.\nThe society claimed that 50% of the population in Carmarthenshire speak Welsh as a first language, but less than 5% of Radio Carmarthenshire\u0027s output was in Welsh. As a result of complaints and pressure from the society and individuals, the United Kingdom\u0027s broadcasting watchdog Ofcom issued Radio Carmarthenshire with a \u0027yellow card\u0027 warning in late 2004; any further claims of the station not conforming to its licence agreement would result in the station being severely reprimanded by Ofcom.\n\n\n=== Response to the 2011 Census results ===\nFollowing the 2011 Census results, the group held a series of rallies across Wales. In the first rally in Caernarfon in December 2012, the group published its Maniffesto Byw which outlined tens of policies designed to strengthen the language. The society launched the \u0022Dwi eisiau byw yn Gymraeg\u0022 slogan at the same rally.\nOn 6 February 2013 and 4 July 2013, deputations of the society met First Minister Carwyn Jones to press for urgent policy changes in light of the Census results.\nA revised version of the Maniffesto Byw was published in July 2013, following a public consultation and an extraordinary general meeting when a number of amendments to the manifesto were adopted.\nIn August 2013, the group wrote to the First Minister Carwyn Jones, giving him six months to state his intention to deliver six policy changes for the benefit of the language:\n\nAddysg Gymraeg i Bawb Tegwch Ariannol i\u0027r Gymraeg Gweinyddu\u0027n fewnol yn Gymraeg Safonau Iaith i Greu Hawliau Clir Trefn Cynllunio er budd ein Cymunedau Y Gymraeg yn greiddiol i Ddatblygu Cynaliadwy Carwyn Jones had made no such statement of intent by 1 February 2014, and the group started a direct action campaign and held a series of protests across the country.\n\n\n=== Ongoing campaigns ===\nIn 2015, the society began calling for Welsh medium education to be extended to every school pupil in Wales, to \u0027give them the ability to communicate and work\u0027 in the language. This call was supported by the linguist David Crystal and academic Christine James. These calls include a call for an Education Act for Welsh language education for all.\nSustainable communities; a property act to help tackle the housing crisis and second home issue.\nThe devolution of broadcasting to Wales.\r\n\r\n== Successful campaigns ==\nAccording to the language group\u0027s website, its campaigns have contributed to securing the following policy changes for the language:\n\n1960s – Bilingual road signs\n1970s – Welsh-language television channel campaign and establishment of S4C, the world\u0027s only Welsh-language television channel, in 1982.\n1993 – Welsh Language Act 1993 enacted, requiring public bodies to offer limited Welsh-language services\n2000s – Campaign for new Welsh Language Act and official status for the language under the Welsh Language Measure 2011\n2011 – Welsh-medium higher education college, Coleg Cymraeg Cenedlaethol, established\r\n\r\n== Campaign areas ==\n\nThe principal campaigns can be divided into four major areas:\n\n\n=== Hawliau i\u0027r Gymraeg ===\nAt the beginning of the 21st century, the society started a campaign for a new Welsh Language Act. The Welsh Language Act 1993 declared that Welsh should be treated on an equal basis with English, but the society argued that this fell short of what is needed.\nIn 2007, the society published its own Welsh Language Measure, draft legislation which would amongst other things establish official status for the Welsh language and rights to use it, and establish the office of the Welsh Language Commissioner.\nIn 2011, based in large part on the society\u0027s proposals, the National Assembly for Wales passed the Welsh Language Measure 2011, which established the Welsh language as an official language of Wales, and introduced the Welsh Language Commissioner.\n\n\n=== Cymunedau Cynaliadwy ===\nThis group leads on a number of matters, including housing and planning policy. Since the 1980s the group has called for a Property Act to increase the number of communities where Welsh is the main language of the area as well as tackling income inequality and environmental problems.\nOn 11 March 2014, the group published its own draft \u0022Property and Planning Bill for the benefit of our communities 2014\u0022 which would enshrine the six main principles of its proposal for a Property Act as well as establishing the Welsh language as a statutory material consideration in the planning system.\n\n\n=== Dyfodol Digidol ===\nThis group campaigns for rights to see and hear the language. This includes campaigns for investment in Radio Cymru and S4C, as well as the presence of the Welsh language online.\n\n\n=== Grŵp Addysg ===\nWelsh medium education is available in most areas of Wales in the primary and secondary stages of school education. Welsh second-language GCSEs are compulsory in English medium education. This group demands improvements and also massive expansion in further and higher education. This mainly includes a Welsh language federal college, which would be a multi-sited college that provides courses and resources in the medium of Welsh.\r\n\r\n== Current volunteers and staff ==\n\nCurrent board of movement\n\nChair-  Robat Idris\nVice-chairperson of campaigns- Ifan Jones\nVice-chairperson of communication-  Osian Rhys\nVice-chairperson of administrative duties-   Mai Roberts\nTreasurer-   Danny Grehan\nOfficer of raising money and Membership-   Bethan Ruth\nOfficer of commercial and goods-   Mirain Owen\nOfficer of Digital-   Llinos Anwyl\nOfficer of design-   Carwyn Hedd\nEditor of Y Tafod-   Mared Llywelyn Williams\nOfficer of learners – Heledd Owen\nInternational deputy-   Joseff Gnagbo\nChair of education-  Mabli Siriol\nVice-chairperson of education-\nChair of the Sustainable Communities Group-   Jeff Smith\nVice-chairperson of the Sustainable Communities Group-\nChair of the Digital Futures Group-   Carl Morris\nVice-chairperson of the Digital Futures Group-   Mirain Owen\nChair of Right to the Welsh Language – Aled Powell\nVice-chairperson of Right to the Welsh Language\nChair of Health and Well Being Group-   Gwerfyl Roberts\nThe society is a largely voluntary movement, which also employs five full-time members of staff, one at its head office in Aberystwyth, one in its Caernarfon office, two in its Cardiff office and one in the Llanfihangel-ar-Arth office.\r\n\r\n== List of chairpersons ==\r\n\r\n== Notable members, former members and supporters ==",
  "imageNames": [
    "Y_Gymraeg_Cymdeithas_yr_iaith_Gymraeg_-_Welsh_political_poster.jpg",
    "Baner_Balchder_o_Gymdeithas.jpg",
    "Nid_yw_Cymru_ar_Werth_protest_Aberystwyth_2022.jpg",
    "Protest_Cymdeithas_yr_Iaith_1972.jpg",
    "Protest_gyntaf_Cymdeithas_yr_Iaith_Gymraeg_ar_Bont_Trefechan_Aberystwyth_24825457959.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1962,
  "categoryId": "cymdeithasol",
  "id": "cymdeithas-yr-iaith",
  "label": "Welsh Language Society"
}