{
  "wikiSummary": "Dafydd ap Gwilym is regarded as one of the leading Welsh poets and among the great poets of Europe in the Middle Ages. Dafydd\u0027s poetry also offers a unique window into the transcultural movement of cultural practices and preservation of culture in the face of occupation. Dafydd also helps answer questions that linger over the spread of culture. Even though it has been given less attention, cultural development in Wales differed slightly than in other parts of Europe during the same time.",
  "wikiArticle": "Dafydd ap Gwilym is regarded as one of the leading Welsh poets and among the great poets of Europe in the Middle Ages. Dafydd\u0027s poetry also offers a unique window into the transcultural movement of cultural practices and preservation of culture in the face of occupation. Dafydd also helps answer questions that linger over the spread of culture. Even though it has been given less attention, cultural development in Wales differed slightly than in other parts of Europe during the same time.\r\n\r\n== Life ==\nR. Geraint Gruffydd suggests c. 1315-c. 1350 as the poet\u0027s dates; others place him a little later from c. 1320–40c. 1370–80.\nLater tradition has it that Dafydd was born at Brogynin, Penrhyn-coch , Ceredigion. His father, Gwilym Gam, and mother, Ardudfyl, were both from noble families. As one of noble birth it seems Dafydd did not belong to the guild of professional poets in medieval Wales, and yet the poetic tradition had been strong in his family for generations.\nAccording to R. Geraint Gruffydd he died in 1350, a possible victim of the Black Death. Tradition says that he was buried within the precinct of the Cistercian Strata Florida Abbey, Ceredigion. This burial location is disputed by supporters of the Talley Abbey theory who contend that burial took place in the Talley Abbey Churchyard:\n\nOn Saturday 15 September 1984 a memorial stone was unveiled by a Prifardd to mark the site in the churchyard at Talley where a deeply-rooted tradition asserts that the poet Dafydd ap Gwilym lies buried. For many centuries the rival claims of Talley and Ystrad Fflur have been debated as the burialplace of Wales’ foremost poet.While it may be difficult to trace the exact years Dafydd was active, it is clear he wrote after the Edwardian conquests of Wales. Despite living under English authority, Dafydd\u0027s poetry presents ways in which Welsh culture continued to distinguish itself and prevail. Some of Dafydd\u0027s poetry outright reflects rejection of the standards of English authority, like in one poem where he draws attention to the state of housing after English subjugation of Wales.\nThe first recorded observation that Dafydd ap Gwilym was buried in Talley was made in the sixteenth century. Talley is located about 30 miles from Strata Florida .\r\n\r\n== Welsh literature after the Norman invasion ==\nWhile Dafydd\u0027s work displays the role literature played in forming Welsh culture in the early 14th century, artistic expression of culture was not as prevalent in the centuries prior. A large majority of cultural expression was demonstrated militarily, as the Welsh suffered many incursions by Norman and English invaders.\nAs the English kingdom fell to William I’s Norman conquest, Welsh holdings that were already contested by the English fell to Norman power. Immediately, William I placed William fitz Osbern in charge of managing the defence of the holdings. Quickly, Norman and trusted Anglo-Saxon nobility were put into centers of control within Welsh lands. The Norman Invasions began a long period where the preservation of Welsh culture coincided with the need for military defence.\nIn the following decades, the Norman advance grew slow, as the Welsh had time to plan defences unlike their English counterparts. As the campaigns drew on, marcher lordships were established on the border of Wales to help facilitate a defence against any counter-incursions. Due to the relative freedom granted to marcher lords, local marcher lords would often compete over territory. The lack of pressure exercised on Welsh authorities during the period of marcher lordships allowed Welsh cultural authority to strengthen in regions not controlled by the Normans or English.\nIn 1277, after multiple attempts to gain more local authority by the Welsh, Edward I began his conquests of the Welsh territories to plant control firmly in English hands. Within 5 years of the conquest\u0027s start, most of Wales was under English control. Under English control, the newly acquired Welsh territories saw a large expansion of English influence. The English made large investments into Welsh infrastructure and instituted new laws that would align more similarly to English law. This period of Welsh history saw Welsh culture physically dominated by English occupation; however, the peace brought under English rule allowed for Welsh culture to manifest in more artistic means. Poetry, like Dafydd\u0027s, became a more popular expression of Welsh culture because there was less of a united interest on warfare and defence.\r\n\r\n== Themes in Dafydd\u0027s poetry ==\nIt is believed that about one hundred and seventy of his poems have survived, though many others have been attributed to him over the centuries. His main themes were love and nature. The influence of wider European ideas of courtly love, as exemplified in the troubadour poetry of Provençal, is seen as a significant influence on Dafydd\u0027s poetry. Courtly love was not a unique theme of Dafydd\u0027s poetry. While courtly love is primarily associated with the literature of mainland Europe, its elements can be found in works across the British Isles. Elements of courtly love have been noted in Welsh literature well before the Dafydd\u0027s active days, suggesting that courtly love grew as a culturally connected phenomenon across European literature.\nDafydd\u0027s poetry reflected the individuality of his own personal as well as Welsh cultural expression through his unique expression of common literary practices, as well as his individual voice in his poetry. One aspect that differed from conventional poetry in Dafydd\u0027s works was the use of himself as the subject. Traditional contemporary poetry traditionally kept the poet far removed from the scene. Dafydd\u0027s work, in contrast, is full of his own feelings and experiences, and he is a key figure in this transition from a primarily social poetic tradition into one in which the poet\u0027s own vision and art is given precedence. Dafydd\u0027s poetry was also unique in its expressions of religion and nature. In “Praise of Summer,” Dafydd praises both the divine and the changing of summer as connected and benevolent. Reference to the divine in prior and contemporary literature usually depicted strong themes of judgement and virtue. With Dafydd\u0027s poetry, we see these forces as a gift worth celebrating.\nDafydd\u0027s poetry also differs from the conventions of other love poetry in its use of sexual metaphor. Some of Dafydd\u0027s poetry, such as “A Poem in Praise of the Penis” display explicit connection to sexual desire. Yet, Dafydd was also well adept at keeping his metaphors subtle. In “The Lady Goldsmith,” Dafydd praises his devotion to a woman who creates attire out of her hair and nature\u0027s bristle. In the poem, the woman crafts a belt for Dafydd. In this poem, the metaphor of sexual desire is drawn from the proximity of the woman\u0027s hair to Dafydd\u0027s waist. The belt itself stands as the sexual connection between this woman and Dafydd. In contrast, traditional courtly love literature tended to shy away from praising sexual desire in favour of patience and virtuous romance.\nHe was an innovative poet who was responsible for popularising the metre known as the \u0022cywydd\u0022 and first to use it for praise. Dafydd also has been credited for popularising the meter form known as “cynghanedd.” The continued use of cynghanedd and cywydd by Welsh poets after Dafydd\u0027s active years is a testament to the effect Dafydd had on shaping Welsh literary culture. Dafydd\u0027s poetry provided a framework for which Welsh literary culture could grow its own unique traditions.\nAlthough Dafydd wrote comparatively conventional praise poetry, he also wrote love poetry and poetry expressing a personal wonderment at nature; Dafydd\u0027s poetry on the latter subject in particular is largely without precedent in Welsh or European literature in terms of its depth and complexity. His popularity during his own historic period is testified by the fact that so many of his poems were selected for preservation in texts, despite a relatively short career compared to some of his contemporaries.\nMany of his poems are addressed to women, but particularly to two of them, Morfudd and Dyddgu. His best-known works include the following poems:\n\nMorfudd fel yr haul , a poem to the wife of an Aberystwyth merchant who seems to have had a long affair with Dafydd, and whom he addressed in many poems;\nMerched Llanbadarn , in which he speaks of going to church on Sunday in order to ogle the local women;\nTrafferth mewn tafarn , in which he comically recounts the injuries and difficulties he faces trying to meet his lover in a tavern;\nYr wylan , a poem in which Dafydd asks a seagull to carry a message to his love;\nY Rhugl Groen , in which Dafydd\u0027s intercourse with a young girl is cruelly interrupted; and\nCywydd y gal , a risqué piece of pure medieval erotica. Until recently not included in editions of Dafydd\u0027s works.\nThe lyrics to the Lied \u0027Der Traum\u0027 in Ludwig van Beethoven\u0027s 1810 collection 26 Welsh Songs are a German translation and adaption of a dream-vision poem supposedly by Dafydd, though not to be found among his works or in his apocrypha.\r\n\r\n== Dafydd\u0027s window into Welsh culture ==\nThe development of culture has been a topic of discussion for many years. As Robert Bartlett argues, European cultures formed in a homogeneous nature, primarily through conquest and settlement. This view has a favourable outlook if you take Wales in the time of Dafydd. The Welsh had become predominantly subservient to the English after the Edwardian conquests. Bartlett might argue that the cultural developments that came in the period of peace after the conquests is evidence for this principle of assimilation.\nSome contend still that cultures developed as a product of their internal audiences. In the case of Dafydd, Helen Fulton argues that his poetry reflected the values admired by Welsh audiences and reflected values of the culture\u0027s uniqueness. In this context, Welsh culture is formed outside of outside influences of other cultures.\nOthers place their arguments somewhere on a spectrum of these two extremes. Andrew Breeze has noted that from even the earliest evidence of Welsh literature, there are many similarities between works of cultures from close and far proximity to the Welsh. While some of these similarities are directly attributed to warfare, there is also an apparent spread of cultural traditions peacefully. The argument is taken further by Carol Lloyd Wood, who demonstrates how intermarriage and architectural similarity among various regions also support an idea of passive cultural diffusion. Although, when looking at architecture from after the Edwardian conquests, the narratives of the polarised views tend to be amplified. Architecture tended to reflect the cultures of either the Welsh or English based on the level of authority of either group in the region.\nDafydd\u0027s poetry reflects the multiple avenues in which cultural exchange manifested in medieval Europe. Dafydd had clear influences by traditions of foreign origin that became used often in his poetry. Some of Dafydd\u0027s poetry also reflects the assimilation and domination present by the Edwardian conquests. Yet, Dafydd also displays poetic structure that would become part of the Welsh literary identity. Scratching the surface of Dafydd\u0027s poetry reveals that culture was defined and controlled by many aspects, and not just one major force.\nWhen looking at a successor of Dafydd, Guto\u0027r Glyn, one is able see to how these forces that control culture interact in a different context. Like Dafydd, Glyn used cywydd meter and referenced himself in his poetry; however, in Glyn\u0027s “Moliant i Syr Rhisiart Gethin ap Rhys Gethin o Fuellt, capten Mantes yn Ffrainc,” one can see other influences in Welsh literary culture. The poem praises an English lord in the same manner of classic heroes such as Arthur. God is also mentioned as an omnipotent protector. Glyn\u0027s poem demonstrates a much more traditional approach of gallantry and chivalry popular in continental European literature. Glyn also demonstrates the principle of assimilation in the sense that the English are viewed as equals or interchangeable with the Welsh. Despite taking influence from a previous Welsh figure in Dafydd, Glyn also demonstrates the effect outside influences had in shaping Welsh literary culture.\nIt is fair to say Dafydd was important in establishing certain customs that would become popular among Welsh literary culture. Although literary culture was very prevalent in the identities of medieval cultures, it often gets overlooked in larger debates about the spread of culture. By looking at Dafydd ap Gwilym, literary culture appears as just as an important part of Welsh cultural identity as resistance to occupation was.",
  "imageNames": [
    "Dafydd_ap_Gwilym_at_Cardiff_City_Hall.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1320,
  "end": 1370,
  "categoryId": "unigolion-nodedig",
  "id": "dafydd-ap-gwilym",
  "label": "Dafydd ap Gwilym"
}