{
  "wikiSummary": "The Laws in Wales Acts 1535 and 1542 or the Acts of Union , were acts of the Parliament of England under King Henry VIII of England, causing Wales to be incorporated into the realm of the Kingdom of England. \nThe legal system of England and the norms of English administration, including the use of the English language only, were applied to a mainly Welsh-speaking Wales. This created a single state and legal jurisdiction, which is now called England and Wales.\nBefore these acts, Wales had already been annexed by England in 1284 and was excluded from parliamentary representation. Wales was divided between the Principality of Wales and many feudal statelets called the marcher Lordships which were effectively unified under the laws. The English county system was also extended across all of Wales.",
  "wikiArticle": "The Laws in Wales Acts 1535 and 1542 or the Acts of Union , were acts of the Parliament of England under King Henry VIII of England, causing Wales to be incorporated into the realm of the Kingdom of England. \nThe legal system of England and the norms of English administration, including the use of the English language only, were applied to a mainly Welsh-speaking Wales. This created a single state and legal jurisdiction, which is now called England and Wales.\nBefore these acts, Wales had already been annexed by England in 1284 and was excluded from parliamentary representation. Wales was divided between the Principality of Wales and many feudal statelets called the marcher Lordships which were effectively unified under the laws. The English county system was also extended across all of Wales.\r\n\r\n== Background ==\nAfter Henry VIII made himself the head of the Church of England in 1534, Wales was seen as a potential problem which included some ambitious men unhappy with ethnic disadvantage in Wales and frustrated with legal complexities. Wales had also been the landing ground for Henry VII and was close to Catholic Ireland.\nChief administrator to the English crown Thomas Cromwell, brought forward Acts to unify Wales with England. The first of the Acts came in 1536 and was later strengthened by the Act of 1542/43. The Acts aimed to integrate the legal, political and administrative systems of Wales with England and make English the language of the courts in Wales, which was a mainly Welsh speaking country at the time. The preamble of the Acts suggests that legal differences in Wales led to discontent, which the English establishment wished to end.\nThe Acts were the result of a long process of assimilation. Wales had been annexed by England, following the conquest by Edward I, under the Statute of Rhuddlan of 1284.\r\n\r\n== Acts ==\nThe two acts have the long titles An Act for Laws and Justice to be ministered in Wales in like Form as it is in this Realm and An Act for Certain Ordinances in the King\u0027s Majesty\u0027s Dominion and Principality of Wales. Together they are known as the Acts of Union. The aim of the acts were to incorporate Wales into what Henry VIII of England saw as part of his Tudor Empire, with himself as sovereign ruler.\nThe acts were not popularly referred to as the \u0022Acts of Union\u0022 until 1901, when historian Owen M. Edwards assigned them that name. This name is misleading and the legal short title of each act has since 1948 been \u0022The Laws in Wales Act\u0022. They are also often seen cited by the years they received royal assent, 1536 and 1543 respectively, although the official citation uses the preceding years, as each of these acts was passed between 1 January and 25 March, at a time when New Year\u0027s Day fell on 25 March.\n\nThe 1535 act was passed in 1536 in the 8th session of Henry VIII\u0027s 5th parliament, which began on 4 February 1535/36, and repealed with effect from 21 December 1993. Meanwhile the act of 1542 was passed in 1543 in the second session of Henry VIII\u0027s 8th parliament, which began on 22 January 1542/43.\n\n\n=== Provisions ===\nThe act declared King Henry\u0027s intentions, that because of differences in law and language:\n\n– and therefore:\n\nThat his said Country or Dominion of Wales shall be, stand and continue for ever from henceforth incorporated, united and annexed to and with this his Realm of England;\nThe 1535 act imposed English law and the English language upon the Welsh people and allowed Welsh representation in the English parliament. These Acts also had many effects on the administration of Wales. The marcher lordships were abolished as political units, and five new counties were established on Welsh lands , thus creating a Wales of 13 counties; Other areas of the lordships were annexed to Shropshire, Herefordshire, Gloucestershire, Glamorgan, Carmarthenshire, Pembrokeshire, Cardiganshire and Merionethshire; The borders of Wales for administrative/government purposes were established and have remained the same since; this was unintentional as Wales was to be incorporated fully into England, but the status of Monmouthshire was still ambiguous in the view of some people until confirmed by the Local Government Act 1972. Each county or shire consisted of fewer than a dozen hundreds corresponding with varying degrees of accuracy to the former commotes.\nWales elected members to the English Parliament, and the Council of Wales and the Marches was established on a legal basis. The Court of Great Sessions was established, a system peculiar to Wales, with a Sheriff appointed in every county, and other county officers as in England. The courts of the marcher lordships lost the power to try serious criminal cases, all courts in Wales were to be conducted in the English language, not Welsh, and the office of justice of the peace was introduced, nine to every county.\r\n\r\n== Effects ==\nIn the Welsh Principality, assimilation had already been greatly implemented and so the 1536 and 1542/43 acts in reality brought some legal consistency across Wales, effectively extending the Principality to the Welsh Marches and ending use of Welsh law. \nThe legal simplicity made it easier for the English crown to collect tax in Wales. After the conquest of Wales by Edward I, the counties of Anglesey, Caernarfonshire, Cardiganshire, Carmarthenshire, Flintshire and Merionethshire were added to by the formerly Marcher counties of Brecknockshire, Denbighshire, Glamorgan, Montgomeryshire, Pembrokeshire and Radnorshire. This also formed a legal border with England.\nAlthough the poor people of Wales may not have been aware of the laws, the measures were popular with the Welsh gentry who saw the acts as bringing legal equality with English citizens. The acts were also seen by the gentry as reducing the influence of the marcher lords.\nEnglish was made the legal language in Wales to bring it in line with Westminster, despite the monoglot population\u0027s retention of Welsh as the majority language.",
  "imageNames": [
    "Atlas_Van_der_Hagen-KW1049B11_031-WALLIA_PRINCIPATUS_Vulgo_WALES..jpeg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1535,
  "categoryId": "arweinwyr",
  "id": "deddfau-uno",
  "label": "Acts of Union"
}