{
  "wikiSummary": "The Welsh Language Act 1993  is an Act of the Parliament of the United Kingdom, which put the Welsh language on an equal footing with the English language in Wales.",
  "wikiArticle": "The Welsh Language Act 1993  is an Act of the Parliament of the United Kingdom, which put the Welsh language on an equal footing with the English language in Wales.\r\n\r\n== Act ==\n\n\n=== Background ===\nAfter the Welsh language channel was founded in 1982 and the recognition of Welsh as a core and compulsory subject in the National curriculum, the Welsh Language Act was brought about in 1993 which aimed to treat Welsh and English equally in public business and justice.\n\n\n=== Provision ===\nThe Welsh Language Act 1993 in summary brought about principle of equality of Welsh and English in public services and justice in Wales.\nThe Welsh Language Act 1993 formed the Welsh Language Board and brought some public bodies to use the principle of treating English and Welsh equally where practical and reasonable.The act made it mandatory for public service bodies in Wales to use a Welsh language scheme for use of Welsh in service, after notification to do so  from the Welsh Language Board. The Welsh Language Board would then be able to approve schemes, give guidance and monitor compliance with schemes.\nDevolution has been described as providing impetus for having legal bilingualism with the then National Assembly for Wales itself required by the Act to provide bilingual legislation.  The 1993 Act reiterates section one of the Welsh Language Act 1967 on a right to speak Welsh in legal proceedings in Wales. The Act also allowed Welsh Ministers to provide a Welsh name to a body, office or place named in legislation. Welsh Ministers would also be able to prescribe Welsh versions of certain documents.\n\n\n=== Today ===\nA significant amount of the Act remains active and the Welsh Language Commissioner has now replaced the Welsh Language Board.\r\n\r\n== Impact ==\nSince the 1993 Act, all new and replaced road signs in Wales as well as public information signs on and in buildings owned by local government bodies are legally required to be bilingual. Bilingual signs have been described as a material symbol of Welshness.\nThe Act has had some success, but there were certain areas within the legal provision that need to be strengthened according to Aberystwyth University lecturer, Catrin Huws.\nCardiff University identified five key areas that were lacking in the provisions brought about by the 1993 Act by 2008. These were;\n\nLack of capacity and resources of organisations to provide Welsh services\nLack of support from managers\nInconsistent meeting of deadlines for remedial action\nLack of organisation discussion on objectives\nInadequate monitoring and updating of using schemes\nThe Irish Official Languages Act 2003 and the Gaelic Language Act 2005 have been closely based on the Welsh Language Act 1993.",
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1993,
  "categoryId": "arweinwyr",
  "id": "deddf-iaith-93",
  "label": "Welsh Language Act"
}