{
  "wikiSummary": "The Red \u0022Lady\u0022 of Paviland is an Upper Paleolithic partial male skeleton dyed in red ochre and buried in Wales 33,000 BP . The bones were discovered in 1823 by William Buckland in an archaeological dig at Goat\u0027s Hole Cave which is a limestone cave between Port Eynon and Rhossili on the Gower Peninsula, near Swansea in south Wales. Buckland believed the skeleton was a Roman-era female. Later, William Solace examined Goat\u0027s Cave Paviland in 1912. There, Solace found flint arrow heads and tools and correctly concluded that the skeleton was in fact a male hunter-gatherer or warrior during the last Ice Age.\nGoat\u0027s Hole was occupied throughout prehistory. Artefacts are predominantly Aurignacian, but also include examples from the earlier Mousterian, and later Gravettian and Creswellian periods. The site is the oldest known ceremonial burial in Western Europe.\nThere have been calls to return the red skeleton of Paviland to Wales where it was discovered, and also specifically to Swansea.",
  "wikiArticle": "The Red \u0022Lady\u0022 of Paviland is an Upper Paleolithic partial male skeleton dyed in red ochre and buried in Wales 33,000 BP . The bones were discovered in 1823 by William Buckland in an archaeological dig at Goat\u0027s Hole Cave which is a limestone cave between Port Eynon and Rhossili on the Gower Peninsula, near Swansea in south Wales. Buckland believed the skeleton was a Roman-era female. Later, William Solace examined Goat\u0027s Cave Paviland in 1912. There, Solace found flint arrow heads and tools and correctly concluded that the skeleton was in fact a male hunter-gatherer or warrior during the last Ice Age.\nGoat\u0027s Hole was occupied throughout prehistory. Artefacts are predominantly Aurignacian, but also include examples from the earlier Mousterian, and later Gravettian and Creswellian periods. The site is the oldest known ceremonial burial in Western Europe.\nThere have been calls to return the red skeleton of Paviland to Wales where it was discovered, and also specifically to Swansea.\r\n\r\n== History ==\n\n\n=== Discovery ===\nIn 1822, Daniel Davies and the Rev John Davies found animal bones, including the tusk of a mammoth. The Talbot family of Penrice Castle was informed and found \u0022bones of elephants\u0022 on 27 December 1822. William Buckland, Professor of Geology at Oxford University arrived on 18 January 1823 and spent a week at the location site, Goat\u0027s Hole. Later that year, writing about his find in his book Reliquiae Diluvianae , Buckland stated: I found the skeleton enveloped by a coating of a kind of ruddle [ ochre ] ... which stained the earth, and in some parts extended itself to the distance of about half an inch [12 mm] around the surface of the bones ... Close to that part of the thigh bone where the pocket is usually worn surrounded also by ruddle [were] about two handfuls of the Nerita littoralis [periwinkle shells]. At another part of the skeleton, viz in contact with the ribs [were] forty or fifty fragments of ivory rods [also] some small fragments of rings made of the same ivory and found with the rods ... Both rods and rings, as well as the Nerite shells, were stained superficially with red and lay in the same red substance that enveloped the bones\nBuckland\u0027s treatise misjudged both its age and sex. He believed that human remains could not be older than the Biblical Great Flood, and thus wildly underestimated its true age, believing the remains to date to the Roman era. Buckland believed the skeleton was female largely because it was discovered with decorative items, including perforated seashell necklaces and jewellery thought to be of elephant ivory but now known to be carved from the tusk of a mammoth.\n\n\n=== Later findings ===\n\nWilliam Solace made an expedition to Goat\u0027s Cave Paviland in 1912. There, Solace found flint arrow heads and tools and correctly concluded that the skeleton was, in fact, a male hunter-gatherer or warrior during the last Ice Age. Over the last 100 years the date estimated by Solace has been shifted from the Mesolithic period to the Palaeolithic era of the last Ice Age. However, before radiocarbon dating was invented in the 1950s, there was no existing scientific method for the determination of the age of any prehistoric remains. \nIn the 1960s, Kenneth Oakley published a radiocarbon determination of 18,460 ± 340 BP.  Results published in 1989 and 1995 suggest that the individual from the cave lived about 26,000 years ago , during the later periods of the Upper Paleolithic. A 2007 examination by Thomas Higham of Oxford University and Roger Jacobi of the British Museum suggested a dating of 29,000 years ago. A recalibration of the results in 2009 suggest an age of 33,000 years.\nAlthough now on the coast, at the time of the burial, the cave would have been located approximately 110 km inland, overlooking a plain. When the remains were dated to some 26,000 years ago, it was thought the \u0022Red Lady\u0022 lived at a time when an ice sheet of the most recent glacial period in the British Isles, called the Devensian Glaciation, would have been advancing towards the site, and that consequently the weather would have been more like that of present-day Siberia, with maximum temperatures of perhaps 10°C in summer, −20° in winter, and a tundra vegetation. The new dating, however, indicates he lived during a warmer period.\nBone protein analysis indicates that he lived on a diet of between 15% and 20% fish, which, together with the distance from the sea, suggests that the people may have been semi-nomadic, or that the tribe transported the body from a coastal region for burial.\nWhen the skeleton was discovered, Wales lacked a museum to house it, so it was moved to Oxford University, where Buckland was a professor.  The bones are currently on display at the Oxford University Museum of Natural History. In December 2007, it was loaned for a year to the National Museum Cardiff. Subsequent excavations yielded more than 4,000 flints, teeth and bones, needles and bracelets, which are on exhibit at Swansea Museum and the National Museum in Cardiff.\r\n\r\n== Evidence of earliest modern humans ==\nAnalysis of the evidence from the two excavations at Long Hole Cave on the Gower Peninsula, including sediment and pollen as well as the lithic evidence, has identified Long Hole as an Aurignacian site contemporary with and related to the site at Paviland, evidence of the first modern humans in Britain.\r\n\r\n== Proposed return to Wales ==\n\nThe Red Lady of Paviland was discovered in 1823 by William Buckland a geology professor at Oxford University, and it was quickly transported to Oxford thereafter . This prompted a two-century campaign for it to be repatriated.\nIn January 2023, the artefact was nicknamed the Welsh Elgin Marbles, after another artefact with calls for repatriation from the British Museum to Greece. The Red Lady is currently on display in the University of Oxford’s Museum of Natural History, and is described to be \u0022well cared for\u0022. It has been stated by academics at Cardiff University, that if it were to return, it would enhance Wales\u0027s national collection and draw attention to its archaeology and caves.\nUniversity of Liverpool and Coimbra University in Portugal Prof George Nash says, \u0022Some have attempted to portray the remains as some sort of ancient Welsh ancestor, which is palpable nonsense. Whoever he was, he was almost certainly of African or Arabian distinction, fleeing conflict or over-crowding in his more hospitable homeland. What\u0027s more, after the brief thaw of the Palaeolithic era, Wales was cut off again for several thousand years, so there\u0027s absolutely no chance of these remains having any genetic or cultural relationship to any modern Welsh person\u0022. However, he also acknowledged that the Red Lady \u0022is a significant part of Welsh history\u0022, and stated that if the remains could be safely returned to Wales then that \u0022would definitely be the right thing to do\u0022.",
  "location": {
    "lat": 51.55008611,
    "long": -4.25518611
  },
  "imageNames": [
    "Red_Lady_of_Paviland_from_feet.jpg",
    "Red_Lady_of_Paviland_from_head.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": -31000,
  "id": "dynes-goch-pafiland",
  "label": "Red \u0022Lady\u0022 of Paviland"
}