{
  "wikiSummary": "Gwenllian ferch Gruffydd  was a 12th-century Welsh rebel and Princess  of Deheubarth. The daughter of Prince of Gwynedd Gruffudd ap Cynan and member of the House of Aberffraw, she married Gruffydd ap Rhys, the Prince of Deheubarth, and lead a \u0022patriotic revolt\u0022 with him during the Great Revolt of 1136 until her death at the battle at Kidwelly Castle.\nHer death would serve as a rallying cry for Welsh rebels, and she became a symbol of Welsh independence. There are several notable artistic depictions of Gwenllian, often depicting her with a sword in hand, or riding a chariot into battle in the style of Boudicca. She is sometimes confused with Gwenllian ferch Llywelyn, who lived two centuries later.",
  "wikiArticle": "Gwenllian ferch Gruffydd  was a 12th-century Welsh rebel and Princess  of Deheubarth. The daughter of Prince of Gwynedd Gruffudd ap Cynan and member of the House of Aberffraw, she married Gruffydd ap Rhys, the Prince of Deheubarth, and lead a \u0022patriotic revolt\u0022 with him during the Great Revolt of 1136 until her death at the battle at Kidwelly Castle.\nHer death would serve as a rallying cry for Welsh rebels, and she became a symbol of Welsh independence. There are several notable artistic depictions of Gwenllian, often depicting her with a sword in hand, or riding a chariot into battle in the style of Boudicca. She is sometimes confused with Gwenllian ferch Llywelyn, who lived two centuries later.\r\n\r\n== Early life ==\nGwenllian was the youngest daughter of Gruffudd ap Cynan, Prince of Gwynedd, and his wife, Angharad. She was born on Ynys Môn at the family seat at Aberffraw, and was the youngest of eight children; four older sisters: Mared, Rhiannell, Susanna, and Annest, and three older brothers: Cadwallon, Owain and Cadwaladr. She was the great-great-great-granddaughter of Brian Bóruma mac Cennétig, High King of Ireland.\nGwenllian grew to be strikingly beautiful. After Gruffydd ap Rhys, the Prince of Deheubarth, ventured to Gwynedd around 1113 to meet her father, Gwenllian and Deheubarth\u0027s prince became romantically involved and eloped. She married Gruffydd ap Rhys shortly after 1116.\nGwenllian and Gruffydd had the following children:\n\nMorgan ap Gruffydd Maelgwyn ap Gruffydd Gwladus ferch Gruffydd Nest ferch Gruffydd Owain ap Gruffydd Maredudd ap Gruffydd Rhys \u0022Fychan\u0022 ap Gruffydd Sion ap Gruffydd Gwenllian joined her husband at his family seat of Dinefwr in Deheubarth. Deheubarth was struggling against the Norman invasion in South Wales, with Norman, English, and Flemish colonists in footholds throughout the country. While the conflict between the Normans and the Welsh continued, the princely family were often displaced, with Gwenllian joining her husband in mountainous and forested strongholds. From here, she and Gruffydd ap Rhys led retaliatory strikes, aka \u0022lightning raids\u0022 against Norman-held positions in Deheubarth.\r\n\r\n== Great Revolt 1136 ==\n\nBy 1136 an opportunity arose for the Welsh to recover lands lost to the Marcher Lords when Stephen de Blois displaced his cousin, Empress Matilda, from succeeding her father to the English throne the year prior, sparking the Anarchy in England. The usurpation and conflict it caused eroded central authority in England. The revolt began in South Wales, as Hywel ap Maredudd, Lord of Brycheiniog, gathered his men and marched to Gower, defeating a smaller Norman force there at the Battle of Llwchwr, killing 500 Normans. Inspired by Hywel of Brycheiniog\u0027s success, Gruffydd ap Rhys hastened to meet with Gruffudd ap Cynan of Gwynedd, his father-in-law, to enlist his aid in the revolt.\nWhile her husband was in Gwynedd seeking an alliance with her father against the Normans, Maurice de Londres and other Normans led raids against Deheubarth\u0027s Welsh and Gwenllian was compelled to raise an army for their defence. In a battle fought near Kidwelly Castle, Gwenllian\u0027s army was routed, she was captured in battle and beheaded by the Normans. In the battle her son Morgan was also slain and another son, Maelgwyn, captured and executed.\r\n\r\n== Aftermath ==\nThough defeated, her patriotic revolt inspired others in South Wales to rise. The Welsh of Gwent, led by Iorwerth ab Owain , ambushed and slew Richard Fitz Gilbert de Clare, the Norman lord who controlled Ceredigion.\nWhen word reached Gwynedd of Gwenllian\u0027s death and the revolt in Gwent, Gwenllian\u0027s brothers Owain and Cadwaladr invaded Norman-controlled Ceredigion, taking Llanfihangel, Aberystwyth, and Llanbadarn.\nGwenllian\u0027s youngest son went on to become a notable leader of Deheubarth, The Lord Rhys.\r\n\r\n== Legacy ==\n\nGwenllian\u0027s actions have been compared with those of another Celtic leader: Boadicea . Gwenllian is also the only woman of the medieval period who is known to have led a Welsh army into battle. For centuries after her death, Welshmen cried-out \u0027Dial Achos Gwenllian\u0027 when engaging in battle. Gwenllian and her husband also attacked Norman, English, and Flemish colonists in Deheubarth, looting goods and money and redistributing them among the Deheubarth Welsh. These actions led historian and author Philip Warner to described Gwenlliann and her husband as a pair of \u0022Robin Hoods of Wales\u0022.\nThe field where the battle is believed to have taken place, close to Kidwelly Castle and north of the town, is known as Maes Gwenllian . A spring in the field is also named after her, supposedly welling up on the spot where she died. The field is said to be haunted by her headless ghost.\nDr Andrew Breeze has argued that Gwenllian could have been the author of the Four Branches of the Mabinogi.",
  "imageNames": [
    "Memorial_to_Gwenllian_outside_Kidwelly_Castle.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1097,
  "end": 1136,
  "categoryId": "milwrol",
  "id": "gwenllian-ferch-gruffydd",
  "label": "Gwenllian\\nferch Gruffudd"
}