{
  "wikiSummary": "The Merthyr Rising, also referred to as the Merthyr Riots, of 1831 was the violent climax to many years of simmering unrest among the large working class population of Merthyr Tydfil in Wales and the surrounding area. The Rising marked the first time the red flag was used a symbol of working class rebellion in the United Kingdom.",
  "wikiArticle": "The Merthyr Rising, also referred to as the Merthyr Riots, of 1831 was the violent climax to many years of simmering unrest among the large working class population of Merthyr Tydfil in Wales and the surrounding area. The Rising marked the first time the red flag was used a symbol of working class rebellion in the United Kingdom.\r\n\r\n== Beginnings ==\nThroughout May 1831 the coal miners and others who worked for William Crawshay, took to the streets of Merthyr Tydfil, calling for reform, protesting against the lowering of their wages and general unemployment. Gradually the protest spread to nearby industrial towns and villages and by the end of May the whole area was in rebellion, and it is believed that for the first time the red flag of revolution was flown as a symbol of workers\u0027 revolt.\r\n\r\n== Events ==\nAfter storming Merthyr town, the rebels sacked the local debtors\u0027 court and the goods that had been collected. Account books containing debtors\u0027 details were also destroyed. Among the shouts were cries of caws a bara and i lawr â\u0027r Brenin .\nOn Tuesday 1 June 1831, the protesters marched to local mines and persuaded the men on shift there to stop working and join their protest. In the meantime, the Grey ministry had ordered in the army, with contingents of the 93rd Regiment of Foot dispatched to Merthyr Tydfil to restore control. Since the crowd was now too large to be dispersed, the soldiers were ordered to protect essential buildings and people.\nOn 2 June, while local employers and magistrates were holding a meeting with the High Sheriff of Glamorgan at the Castle Inn, a group led by Lewis Lewis marched there to demand a reduction in the price of bread and an increase in their wages. The demands were rejected, and after being advised to return to their homes, the crowd attacked the inn. Engaged by the Sutherland Highlanders, after the rioters seized some of their weapons, the troops were commanded to open fire. After a protracted struggle in which hundreds sustained injury, some fatal, the Highlanders were compelled to withdraw to Penydarren House, and abandon the town to the protesters.\nSome 7,000 to 10,000 workers marched under a red flag, which was later adopted internationally as the symbol of communists and socialists. For four days, magistrates and ironmasters were under siege in the Castle Hotel, and the protesters effectively controlled Merthyr.\nFor eight days, Penydarren House was the sole refuge of authority. With armed insurrection fully in place in the town by 4 June, the protesters had commandeered arms and explosives, set up road-blocks, formed guerrilla detachments, and had banners capped with a symbolic loaf and dyed in blood. Those who had military experience had taken the lead in drilling the armed para-military formation, and created an effective central command and communication system.\nThis allowed them to control the town and engage the formal military system, including:\n\nAmbushing the 93rd\u0027s baggage-train on the Brecon Road, under escort of 40 of the Glamorgan Yeomanry, driving them into the Brecon hills.\nBeating off a relief force of 100 cavalry sent from Penydarren House.\nAmbushing and disarming the Swansea Yeomanry on the Swansea Road, and throwing them back in disorder to Neath.\nOrganising a mass demonstration against Penydarren House.\nHaving sent messengers, who had started strikes in Northern Monmouthshire, Neath and Swansea Valleys, the political insurrection reached its peak. However, a number of those uninvolved had now started to flee the town under protestor control. With the protestors arranging a mass meeting for Sunday 6th, the government representatives in Penydarren House managed to split the protestors\u0027 council. When 450 troops marched to the mass meeting at Waun above Dowlais with levelled weapons, the meeting dispersed and the political protests were effectively over.\r\n\r\n== Outcome ==\n\nBy 7 June the government authorities had regained control of the town through force, with up to 24 of the protesters killed. Twenty-six people were arrested and put on trial for taking part in the political revolt. Several were sentenced to terms of imprisonment, others sentenced to penal transportation to Australia, and two were sentenced to death by hanging – Lewis Lewis for Robbery and Richard Lewis for stabbing a soldier in the leg with a seized bayonet.\nLewsyn yr Heliwr\u0027s sentence was downgraded to a life sentence and penal transportation to Australia after one of the police officers who had tried to disperse the crowd testified that he had tried to shield him from the attack. He was transported aboard the vessel John in 1832 and died 6 September 1847 in Port Macquarie, New South Wales.\nFollowing this reprieve, the Grey ministry was determined that at least one civil rights protestor should die as an example of what had happened. However, the people of Merthyr Tydfil were convinced that Richard Lewis was not responsible for the stabbing, and 11,000 signed a petition demanding his release. Nevertheless, the government refused, and Richard Lewis was hanged at Cardiff Market on August 13, 1831.\nIn 1874, a Congregational minister, the Rev. Evan Evans, said that a man called Ianto Parker had given him a death-bed confession, saying that he had stabbed Donald Black and then fled to America fearing capture by the authorities. James Abbott, a hairdresser from Merthyr Tydfil who had testified at Penderyn\u0027s trial, later said that he had lied under oath, claiming that he had been instructed to do so by Lord Melbourne.\r\n\r\n== Legacy ==\nIn 2015, Welsh Labour MP Ann Clwyd presented a petition to the House of Commons calling for Dic Penderyn to be posthumously pardoned, stating that there was \u0022strong feeling in Wales that Richard Lewis - Dic Penderyn - was wrongly executed.\u0022\n\n\n=== In creative works ===\nIn 1922, Lewis Davies wrote a novel, Lewsyn yr Heliwr, inspired by the events of the Merthyr Riot of 1831. The novel won the National Eisteddfod, Caernarfon, 1921. The novel was published by Hughes and Son, Wrexham in 1922.\nMeic Stevens\u0027 song \u0022Dic Penderyn\u0022 on his 1972 album Gwymon celebrates Richard Lewis.\nThe Men They Couldn\u0027t Hang recorded \u0022Ironmasters\u0022 in 1985, which refers to the rising and its aftermath.\nSince 2013, a music festival named after the rising has been held annually in Merthyr to promote working class culture and social justice in arts. \nIn 2015, stylist Charlotte James and photographer Tom Johnson published a series titled Merthyr Rising, showcasing residents of the town.\nRadical singer-songwriter David Rovics included a song about the Merthyr Rising, entitled \u0022Cheese and Bread\u0022, in the 2018 album Ballad of a Wobbly. \nThe musical \u0022My Land\u0027s Shore\u0022 by Robert Gould and Christopher J Orton centres on the riots. It was performed at the Bloomsbury Theatre by the University College London Musical Theatre society in February 2022. \nThe 2022 poetry anthology Gwrthryfel / Uprising contained two poems about Dic Penderyn and the Merthyr Rising.\nIn 2024, Ferocious Dog released a song titled \u0022Merthyr Rising\u0022 in their album Kleptocracy.",
  "imageNames": [
    "Dic_Penderyn_Plaque_8053781082.jpg",
    "Merthyr_Rising.jpg",
    "Merthyr_Tydfil_Red_Flag_Graffiti.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1831,
  "categoryId": "cymdeithasol",
  "id": "gwrthryfel-merthyr-tudful",
  "label": "Merthyr Rising"
}