{
  "wikiSummary": "Hedd Wyn was a Welsh-language poet who was killed on the first day of the Battle of Passchendaele during World War I. He was posthumously awarded the bard\u0027s chair at the 1917 National Eisteddfod. Evans, who had been awarded several chairs for his poetry, was inspired to take the Bardic name Hedd Wyn from the way sunlight penetrated the mist in the Meirionnydd valleys.\nBorn in the village of Trawsfynydd, Wales, Evans wrote much of his poetry while working as a shepherd on his family\u0027s hill farm. His style, which was influenced by romantic poetry, was dominated by themes of nature and religion. He also wrote several war poems following the outbreak of war on the Western Front in 1914.",
  "wikiArticle": "Hedd Wyn was a Welsh-language poet who was killed on the first day of the Battle of Passchendaele during World War I. He was posthumously awarded the bard\u0027s chair at the 1917 National Eisteddfod. Evans, who had been awarded several chairs for his poetry, was inspired to take the Bardic name Hedd Wyn from the way sunlight penetrated the mist in the Meirionnydd valleys.\nBorn in the village of Trawsfynydd, Wales, Evans wrote much of his poetry while working as a shepherd on his family\u0027s hill farm. His style, which was influenced by romantic poetry, was dominated by themes of nature and religion. He also wrote several war poems following the outbreak of war on the Western Front in 1914.\r\n\r\n== Early life ==\nEllis Humphrey Evans was born on 13 January 1887 at Penlan, a house in the centre of Trawsfynydd, Meirionydd, Wales. He was the eldest of eleven children born to Evan and Mary Evans. In the spring of 1887, the family moved to his father\u0027s family 168-acre hill-farm of Yr Ysgwrn, in Cwm Prysor, a few miles from Trawsfynydd. He spent his life there, apart from a short stint in South Wales.\nEllis Evans received a basic education from the age of six at the local primary school and Sunday school. He left school around 14 years of age and worked as a shepherd on his father\u0027s farm. Despite his brief attendance in formal schooling he had a talent for poetry and had already composed his first poem by the age of 11, \u0022Y Das Fawn\u0022 . Ellis\u0027s interests included both Welsh and English poetry. His main influence was the Romantic poetry of Percy Bysshe Shelley, and themes of nature and religion dominated his work.\r\n\r\n== Eisteddfodau ==\nHis talent for poetry was well known in the village of Trawsfynydd, and he took part in numerous competitions and local eisteddfodau, winning his first chair at Bala in 1907, aged 20. In 1910, he was given the bardic name Hedd Wyn by the bard Bryfdir at a poets\u0027 meeting in Blaenau Ffestiniog. Hedd is Welsh for peace and Wyn can mean white or pure; this \u0027blessed peace\u0027 also alluded to the way rays of sunlight penetrated the mists in the Meirionydd valleys.\nBryfdir was the bardic name of Evans\u0027s older friend Humphrey Jones , a quarryman from Blaenau Ffestiniog; in his lifetime, Jones published two volumes of poetry, won more than 60 bardic chairs and was an eisteddfod compère. Jones said he bestowed Hedd Wyn on Evans because he had the manner of a dreamer who moved slowly and calmly. Another close friend of Hedd Wyn was the clergyman and writer R. Silyn Roberts, who was known as Rhosyr.\nIn 1913, 26-year-old Hedd Wyn began to find fame for his poetry when he won chairs at the local eisteddfodau at Pwllheli and Llanuwchllyn. In 1915 he was successful at local eisteddfodau in Pontardawe and Llanuwchllyn. That same year he entered his first poem Eryri in the National Eisteddfod of Wales which was held in Bangor, Gwynedd. The following year he took second place at the National Eisteddfod in Aberystwyth with Ystrad Fflur, an awdl written in honour of Strata Florida, the medieval Cistercian abbey ruins in Ceredigion.\r\n\r\n== First World War ==\nHedd Wyn was a Christian pacifist and did not enlist for the war initially, feeling he could never kill anyone. The war left Welsh non-conformists deeply divided. Traditionally, the Nonconformists had not been comfortable at all with the idea of warfare. The war saw a major clash within Welsh Nonconformism between those who backed military action and those who adopted a pacifist stance on religious grounds.\nThe war inspired Hedd Wyn\u0027s work and produced some of his most noted poetry, including Plant Trawsfynydd , Y Blotyn Du , and Nid â’n Ango . His poem, Rhyfel , remains one of his most frequently quoted works.\n\n\n=== Conscription ===\n\nAlthough farm work was classed as a reserved occupation due its national importance, in 1916, the Evans family were required to send one of their sons to join the British Army. The 29-year-old Ellis enlisted rather than his younger brother Robert. In February 1917, he received his training at Litherland Camp, Liverpool, but in March 1917 the government called for farm workers to help with ploughing and many soldiers were temporarily released. Hedd Wyn was given seven weeks\u0027 leave. He spent most of this leave working on the awdl Yr Arwr , his submission for the National Eisteddfod. According to his nephew, Gerald Williams, \u0022It was a wet year in 1917. He came back for 14 days\u0027 leave and wrote the poem, Yr Arwr, on the table by the fire. As it was such a wet year, he stayed for another seven days. This extra seven days made him a deserter. So the military police came to fetch him from the hayfield and took him to the jail at Blaenau. From there he travelled to... the war in Belgium. Because he left in such a hurry he forgot the poem on the table, so he wrote it again on the journey. So there are two copies: one in Aberystwyth and one in Bangor.\u0022\nIn June 1917, Hedd Wyn joined the 15th Battalion, Royal Welsh Fusiliers  Division) at Fléchin, France. His arrival depressed him, as exemplified in his quote, \u0022Heavy weather, heavy soul, heavy heart. That is an uncomfortable trinity, isn’t it?\u0022 Nevertheless, at Fléchin he finished his National Eisteddfod entry and signed it “Fleur de Lis”. It is believed it was sent via the Royal Mail around the end of June. On 31 July 15 Battalion marched towards the major offensive which would become known as the Battle of Passchendaele.\n\n\n=== Third Battle of Ypres and death ===\n\nHedd Wyn was fatally wounded within the first few hours of the start of the Third Battle of Ypres on 31 July, 1917. He fell during the Battle of Pilckem Ridge which had begun at 3:50 a.m. with a heavy bombardment of the German lines . However, the troops\u0027 advance was hampered by incoming artillery and machine gun fire, and by heavy rain turning the battlefield to swamp.\n\nPrivate Evans, as part of the 15th Battalion , was advancing towards a German strongpoint – created within the ruins of the Belgian hamlet of Hagebos – when he was hit. In an interview conducted in 1975 by St Fagans National History Museum, Simon Jones, a veteran of the Royal Welsh Fusiliers, recalled, \u0022We started over Canal Bank at Ypres, and he was killed half way across Pilckem. I\u0027ve heard many say that they were with Hedd Wyn and this and that, well I was with him... I saw him fall and I can say that it was a nosecap shell in his stomach that killed him. You could tell that... He was going in front of me, and I saw him fall on his knees and grab two fistfuls of dirt... He was dying, of course... There were stretcher bearers coming up behind us, you see. There was nothing – well, you\u0027d be breaking the rules if you went to help someone who was injured when you were in an attack.\u0022\nSoon after being wounded, Hedd Wyn was carried to a first-aid post. Still conscious, he asked the doctor \u0022Do you think I will live?\u0022 though it was clear that he had little chance of surviving; he died at about 11:00 a.m. Among the fatalities that day was the Irish war poet, Francis Ledwidge, who was \u0022blown to bits\u0022 while drinking tea in a shell hole.\nEllis H. Evans was buried in Section II, Row F, Grave 11 at Artillery Wood Cemetery, near Boezinge. After a petition was submitted to the Imperial War Graves Commission after the war, his headstone was given the additional words Y Prifardd Hedd Wyn .\r\n\r\n== Legacy ==\n\n\n=== National Eisteddfod ===\nOn 6 September 1917, the ceremony of Chairing of the Bard took place at the National Eisteddfod in Birkenhead Park, England; in attendance was the Welsh-speaking British Prime Minister, David Lloyd George. After the adjudicators announced that the entry submitted under the pseudonym Fleur de Lys was the winner, the trumpets were sounded for the author to identify themselves. After three such summons, Archdruid Dyfed solemnly announced that the winner had been killed in action six weeks earlier. The empty chair was then draped in a black sheet. It was delivered to Evans\u0027s parents in the same condition, \u0022the festival in tears and the poet in his grave\u0022, as Archdruid Dyfed said. The festival is now referred to as \u0022Eisteddfod y Gadair Ddu\u0022 .\n\nThe chair was hand-crafted by Flemish craftsman, Eugeen Vanfleteren , a carpenter born in Mechelen, Belgium, who had fled to England on the outbreak of war and had settled in Birkenhead.\n\n\n=== Manuscripts and publications ===\nImmediately after the Eisteddfod, a committee was formed in Trawsfynydd to look after the poet\u0027s legacy. Under the leadership of J. R. Jones, the head teacher of the village school, all manuscripts in the poet\u0027s hand were collected and carefully preserved. Due to the committee\u0027s efforts, the first anthology of the bard\u0027s work, titled Cerddi\u0027r Bugail , was published in 1918. The manuscripts were donated to the National Library of Wales in 1934.\nHedd Wyn, Ei Farddoniaeth, a complete Welsh language anthology of his works, was published by Trawsfynydd\u0027s Merilang Press in 2012.\nThe poem Yr Arwr , for which Hedd Wyn won the National Eisteddfod, is still considered his greatest work. The ode is structured in four parts and presents two principal characters, Merch y Drycinoedd and the Arwr. There has been much disagreement in the past regarding the meaning of the ode. It can be said with certainty that Hedd Wyn, like his favourite poet Shelley, longed for a perfect humanity and a perfect world during the chaos of war.\nMerch y Drycinoedd has been perceived as a symbol of love, the beauty of nature, and creativity; and Yr Arwr as a symbol of goodness, fairness, freedom, and justice. It is wished that through his sacrifice, and his union with Merch y Drycinoedd at the end of the ode, a better age will come.\n\n\n=== Trawsfynydd and Yr Ysgwrn ===\n\nA bronze statue of Hedd Wyn, dressed as a shepherd, was unveiled by his mother in the centre of the village in 1923. It bears an englyn which Hedd Wyn had written in memory of a slain friend, Tommy Morris.\n\nEvans\u0027s bardic chair is on permanent display at his family\u0027s hill farm, Yr Ysgwrn. The property was preserved just as it was in 1917 by the poet\u0027s family and his nephew Gerald Williams , who was the last of his relatives to live on the farm. For years, Gerald and his brother Ellis continued to farm the land surrounding the farmhouse as custodians of both Yr Ysgwrn and Hedd Wyn’s legacy, welcoming visitors and working to ensure Hedd Wyn’s story lived on. In 2012, fourteen years after Ellis\u0027s death, Gerald decided it was time to pass on the custodianship of Yr Ysgwrn to the Snowdonia National Park Authority.\nThe Park Authority, with support from the Welsh Government and the National Lottery, announced on St David\u0027s Day 2012 that it had acquired the Grade II*-listed farmstead and its surrounding lands for the Welsh nation. The Authority\u0027s objectives are to protect and preserve the site while enhancing the visitor experience in order to share the story of Hedd Wyn. In the same year, Gerald Williams was awarded an MBE for his \u0022exceptional contribution\u0022 to conserving the heritage of his bardic uncle.\n\n\n=== Centennial commemorations ===\nIn August 2014, the Welsh Memorial Park, Ypres was unveiled at Pilckem Ridge near Ypres. The war memorial stands close to the spot where Hedd Wyn was mortally wounded in July 1917 during the Battle of Passchendaele.\nTo mark the 100th anniversary of his death, a Bardic chair was made to celebrate the life of Hedd Wyn. It was presented to the Welsh Government at a special service of remembrance at Birkenhead Park in September 2017. A memorial to the poet was also unveiled in the park, the site of the 1917 National Eisteddfod.\nIn November 2017, as part of the annual British Armistice commemorations, a video installation commemorating the life of Hedd Wyn was beamed onto the exterior walls of the National Library of Wales, Aberystwyth. The work was the culmination of a project involving more than 800 schoolchildren and adults at primary and secondary schools across Wales which looked at the life and legacy of the poet.\r\n\r\n== In popular culture ==\n\n\n=== Film ===\nThe anti-war biopic Hedd Wyn was released in 1992. The film, which starred Huw Garmon as the poet, is based on a screenplay by Alan Llwyd. It depicts Hedd Wyn as a tragic hero who has an intense dislike of the wartime ultranationalism which surrounds him and his doomed struggle to avoid conscription.\nIn 1993, Hedd Wyn won the Royal Television Society\u0027s Television Award for Best Single Drama. It became the first British motion picture to be nominated for Best Foreign Language Film at the 66th Academy Awards in 1993. In 1994, at the newly inaugurated BAFTA Cymru Awards, it won in six categories: Best Director , Best Design , Best Drama – Welsh , Best Editor , Best Original Music and Best Screenwriter – Welsh .\n\n\n=== Literature ===\nThe Black Chair, a 2009 novel for young people by Phil Carradice, is based on the life of Hedd Wyn. In July 2017, Y Lolfa published An Empty Chair, a novel for young people telling the story of Hedd Wyn as seen from the point of view of his teenage sister, Anni . It is an adaptation by Haf Llewelyn of her prize-winning Welsh-language novel, Diffodd Y Sêr.\n\n\n=== Music ===\nThe track \u0022Halflife\u0022 on the 2015 album Everyone Was a Bird by avant garde electronica group Grasscut references Hedd Wyn as a figure in the history of Trawsfynydd, merging his presence with that of the reactors of the Trawsfynydd nuclear power station.\n\n\n=== Opera ===\nThe 2017 opera 2117/Hedd Wyn, with music by Stephen McNeff and libretto by Gruff Rhys, was inspired by the life of Hedd Wyn; set in the year 2117, it imagines a group of schoolchildren in a post-apocalyptic Trawsfynydd learning about the life and work of the poet. It was recorded by Tŷ Cerdd Records and released in 2022.",
  "imageNames": [
    "30a_Sammlung_Eybl_Großbritannien._Alfred_Leete_1882–1933_Britons_Kitchener_wants_you_Briten_Kitchener_braucht_Euch._1914_Nachdruck_74_x_50_cm._Slg.Nr._552.jpg",
    "Hedd_Wyn_01a-dg.JPG",
    "Hedd_Wyn_Grave_at_Artillery_Wood_Cemetery_7.jpg",
    "Hedd_Wyn_statue.jpg",
    "Y_Gadair_Ddu_manylyn.JPG"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1887,
  "end": 1917,
  "categoryId": "unigolion-nodedig",
  "id": "hedd-wyn",
  "label": "Hedd Wyn"
}