{
  "wikiSummary": "Sir Hugh Owen was a pioneer of higher education in Wales. He was the main founder of the University College of Wales at Aberystwyth.",
  "wikiArticle": "Sir Hugh Owen was a pioneer of higher education in Wales. He was the main founder of the University College of Wales at Aberystwyth.\r\n\r\n== Life ==\nHe was born in Llangeinwen, on Anglesey,  and moved to London at the age of 21 to work as a solicitor\u0027s clerk. He went to work for the Poor Law Commission in 1836, eventually becoming its Chief Clerk in 1853.\nOwen became involved in the British and Foreign School Society in London and in 1843 published an open letter to the people of Wales, advocating the need to establish British and Foreign schools in Wales. As a non-conformist he supported the idea of non-denominational day schools. In 1843 he was instrumental in the appointing of an agent for the British and Foreign schools Society in North Wales, and then in South Wales at a later date.\nIn 1846 Owen became honorary secretary of the Cambrian Educational Society and published another letter advocating the establishment of schools in Wales. His campaign led to the establishment of a number of schools, but highlighted another problem: a shortage of trained teachers. In 1856 he was one of the founder member of a movement to establish the Normal College at Bangor for teacher training. His vision included another teacher training college in South Wales, one specifically for women in Swansea and a university for Wales. In 1863 a committee was formed to raise the funds to establish a University for Wales in Aberystwyth. In 1867 the Committee were able to buy the old Castle Hotel cheaply and by 1872 the University opened. It was not financially stable and Hugh Owen retired in order to raise funds, to clear the debt, and secure the future of the University.\nOwen was briefly a member of the London School Board, elected to fill a casual vacancy in April 1872, he stood down at the November 1873 school board elections.\nOwen saw the need to improve the education in intermediate schools, so that there were suitably qualified entrants for the new University. At the National Eisteddfod in Caernarfon in 1880, he read a paper to members of the Society of Cymmrodorion on Intermediate Education in Ireland and Secondary Education in Wales. This eventually led to the passing of the Welsh Intermediate Education Act of 1889.\nOwen was knighted in August 1881 but died 3 months later.\r\n\r\n== Legacy ==\n\nThe main library at Aberystwyth University is named after Hugh Owen, as is Ysgol Syr Hugh Owen, a secondary school in Caernarfon .\nThe Learned Society of Wales awards the Hugh Owen Medal annually to celebrate outstanding educational research in Wales. The medal is supported by Welsh Government and is awarded in recognition of significant contributions to educational research, or the application of research to produce significant innovations in education policy or professional educational practice in Wales.",
  "imageNames": [
    "Portrait_of_Sir_Hugh_Owen_4671720_Exposure.jpg",
    "Ysgol_Syr_Hugh_Owen_School_-_geograph.org.uk_-_262295.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1804,
  "end": 1881,
  "categoryId": "unigolion-nodedig",
  "id": "hugh-owen",
  "label": "Sir Hugh Owen"
}