{
  "wikiSummary": "David Lloyd George, 1st Earl Lloyd-George of Dwyfor was Prime Minister of the United Kingdom from 1916 to 1922. A Liberal Party politician from Wales, he was known for leading the United Kingdom during the First World War, for social-reform policies, for his role in the Paris Peace Conference, and for negotiating the establishment of the Irish Free State.\nBorn in Chorlton-on-Medlock, Manchester, and raised in Llanystumdwy, Lloyd George gained a reputation as an orator and proponent of a Welsh blend of radical Liberal ideas that included support for Welsh devolution, the disestablishment of the Church of England in Wales, equality for labourers and tenant farmers, and reform of land ownership. He won an 1890 by-election to become the Member of Parliament for Caernarvon Boroughs, and was continuously re-elected to the role for 55 years. He served in Henry Campbell-Bannerman\u0027s cabinet from 1905. After H. H. Asquith succeeded to the premiership in 1908, Lloyd George replaced him as Chancellor of the Exchequer. To fund extensive welfare reforms, he proposed taxes on land ownership and high incomes in the 1909 People\u0027s Budget, which the Conservative-dominated House of Lords rejected. The resulting constitutional crisis was only resolved after elections in 1910 and passage of the Parliament Act 1911. His budget was enacted in 1910, with the National Insurance Act 1911 and other measures helping to establish the modern welfare state. He was embroiled in the 1913 Marconi scandal but remained in office and secured the disestablishment of the Church of England in Wales.\nIn 1915, Lloyd George became Minister of Munitions and expanded artillery shell production for the war. In 1916, he was appointed Secretary of State for War but was frustrated by his limited power and clashes with Army commanders over strategy. Asquith proved ineffective as prime minister and was replaced by Lloyd George in December 1916.  He centralised authority by creating a smaller war cabinet. To combat food shortages caused by u-boats, he implemented the convoy system, established rationing, and stimulated farming. After supporting the disastrous French Nivelle offensive in 1917, he had to reluctantly approve Field Marshal Douglas Haig\u0027s plans for the Battle of Passchendaele, which resulted in huge casualties with little strategic benefit. Against British military commanders, he was finally able to see the Allies brought under one command in March 1918. The war effort turned in the Allies\u0027 favour and was won in November. Following the December 1918 \u0022Coupon\u0022 election, he and the Conservatives maintained their coalition with popular support.\nLloyd George was a leading proponent at the Paris Peace Conference of 1919, but the situation in Ireland worsened, erupting into the Irish War of Independence, which lasted until Lloyd George negotiated independence for the Irish Free State in 1921. At home, he initiated education and housing reforms, but trade-union militancy rose to record levels, the economy became depressed in 1920 and unemployment rose; spending cuts followed in 1921–22, and in 1922 he became embroiled in a scandal over the sale of honours and the Chanak Crisis. The Carlton Club meeting decided the Conservatives should end the coalition and contest the next election alone. Lloyd George resigned as prime minister, but continued as the leader of a Liberal faction. After an awkward reunion with Asquith\u0027s faction in 1923, Lloyd George led the weak Liberal Party from 1926 to 1931. He proposed innovative schemes for public works and other reforms, but made only modest gains in the 1929 election. After 1931, he was a mistrusted figure heading a small rump of breakaway Liberals opposed to the National Government. In 1940, he refused to serve in Churchill\u0027s War Cabinet. He was elevated to the peerage in 1945 but died before he could take his seat in the House of Lords.",
  "wikiArticle": "David Lloyd George, 1st Earl Lloyd-George of Dwyfor was Prime Minister of the United Kingdom from 1916 to 1922. A Liberal Party politician from Wales, he was known for leading the United Kingdom during the First World War, for social-reform policies, for his role in the Paris Peace Conference, and for negotiating the establishment of the Irish Free State.\nBorn in Chorlton-on-Medlock, Manchester, and raised in Llanystumdwy, Lloyd George gained a reputation as an orator and proponent of a Welsh blend of radical Liberal ideas that included support for Welsh devolution, the disestablishment of the Church of England in Wales, equality for labourers and tenant farmers, and reform of land ownership. He won an 1890 by-election to become the Member of Parliament for Caernarvon Boroughs, and was continuously re-elected to the role for 55 years. He served in Henry Campbell-Bannerman\u0027s cabinet from 1905. After H. H. Asquith succeeded to the premiership in 1908, Lloyd George replaced him as Chancellor of the Exchequer. To fund extensive welfare reforms, he proposed taxes on land ownership and high incomes in the 1909 People\u0027s Budget, which the Conservative-dominated House of Lords rejected. The resulting constitutional crisis was only resolved after elections in 1910 and passage of the Parliament Act 1911. His budget was enacted in 1910, with the National Insurance Act 1911 and other measures helping to establish the modern welfare state. He was embroiled in the 1913 Marconi scandal but remained in office and secured the disestablishment of the Church of England in Wales.\nIn 1915, Lloyd George became Minister of Munitions and expanded artillery shell production for the war. In 1916, he was appointed Secretary of State for War but was frustrated by his limited power and clashes with Army commanders over strategy. Asquith proved ineffective as prime minister and was replaced by Lloyd George in December 1916.  He centralised authority by creating a smaller war cabinet. To combat food shortages caused by u-boats, he implemented the convoy system, established rationing, and stimulated farming. After supporting the disastrous French Nivelle offensive in 1917, he had to reluctantly approve Field Marshal Douglas Haig\u0027s plans for the Battle of Passchendaele, which resulted in huge casualties with little strategic benefit. Against British military commanders, he was finally able to see the Allies brought under one command in March 1918. The war effort turned in the Allies\u0027 favour and was won in November. Following the December 1918 \u0022Coupon\u0022 election, he and the Conservatives maintained their coalition with popular support.\nLloyd George was a leading proponent at the Paris Peace Conference of 1919, but the situation in Ireland worsened, erupting into the Irish War of Independence, which lasted until Lloyd George negotiated independence for the Irish Free State in 1921. At home, he initiated education and housing reforms, but trade-union militancy rose to record levels, the economy became depressed in 1920 and unemployment rose; spending cuts followed in 1921–22, and in 1922 he became embroiled in a scandal over the sale of honours and the Chanak Crisis. The Carlton Club meeting decided the Conservatives should end the coalition and contest the next election alone. Lloyd George resigned as prime minister, but continued as the leader of a Liberal faction. After an awkward reunion with Asquith\u0027s faction in 1923, Lloyd George led the weak Liberal Party from 1926 to 1931. He proposed innovative schemes for public works and other reforms, but made only modest gains in the 1929 election. After 1931, he was a mistrusted figure heading a small rump of breakaway Liberals opposed to the National Government. In 1940, he refused to serve in Churchill\u0027s War Cabinet. He was elevated to the peerage in 1945 but died before he could take his seat in the House of Lords.\r\n\r\n== Early life ==\nDavid George was born on 17 January 1863 in Chorlton-on-Medlock, Manchester, to Welsh parents William George and Elizabeth Lloyd George. William died in June 1864 of pneumonia, aged 44. David was just over one year old. Elizabeth George moved with her children to her native Llanystumdwy in Caernarfonshire, where she lived in a cottage known as Highgate with her brother Richard, a shoemaker, lay minister and a strong Liberal. Richard Lloyd was a towering influence on his nephew and David adopted his uncle\u0027s surname to become \u0022Lloyd George\u0022. Lloyd George was educated at the local Anglican school, Llanystumdwy National School, and later under tutors.\nHe was brought up with Welsh as his first language; Roy Jenkins, another Welsh politician, notes that, \u0022Lloyd George was Welsh, that his whole culture, his whole outlook, his language was Welsh.\u0022\nThough brought up a devout evangelical, Lloyd George privately lost his religious faith as a young man. Biographer Don Cregier says he became \u0022a Deist and perhaps an agnostic, though he remained a chapel-goer and connoisseur of good preaching all his life.\u0022 He was nevertheless, according to Frank Owen, \u0022one of the foremost fighting leaders of a fanatical Welsh Nonconformity\u0022 for a quarter of a century.\n\n\n=== Legal practice and early politics ===\n\nLloyd George qualified as a solicitor in 1884 after being articled to a firm in Porthmadog and taking Honours in his final law examination. He set up his own practice in the back parlour of his uncle\u0027s house in 1885. Although many prime ministers have been barristers, Lloyd George is, as of 2025, the only solicitor to have held that office.\nAs a solicitor, Lloyd George was politically active from the start, campaigning for his uncle\u0027s Liberal Party in the 1885 election. He was attracted by Joseph Chamberlain\u0027s \u0022unauthorised programme\u0022 of Radical reform. After the election, Chamberlain split with William Ewart Gladstone in opposition to Irish Home Rule, and Lloyd George moved to join the Liberal Unionists. Uncertain of which wing to follow, he moved a resolution in support of Chamberlain at a local Liberal club and travelled to Birmingham to attend the first meeting of Chamberlain\u0027s new National Radical Union, but arrived a week too early. In 1907 Lloyd George would tell Herbert Lewis that he had thought Chamberlain\u0027s plan for a federal solution to the Home Rule Question correct in 1886 and still thought so, and that \u0022If Henry Richmond, Osborne Morgan and the Welsh members had stood by Chamberlain on an agreement as regards the [Welsh] disestablishment, they would have carried Wales with them\u0022\nHis legal practice quickly flourished; he established branch offices in surrounding towns and took his brother William into partnership in 1887. Lloyd George\u0027s legal and political triumph came in the Llanfrothen burial case, which established the right of Nonconformists to be buried according to denominational rites in parish burial grounds, as given by the Burial Laws Amendment Act 1880 but theretofore ignored by the Anglican clergy. On Lloyd George\u0027s advice, a Baptist burial party broke open a gate to a cemetery that had been locked against them by the vicar. The vicar sued them for trespass and although the jury returned a verdict for the party, the local judge misrecorded the jury\u0027s verdict and found in the vicar\u0027s favour. Suspecting bias, Lloyd George\u0027s clients won on appeal to the Divisional Court of Queen\u0027s Bench in London, where Lord Chief Justice Coleridge found in their favour. The case was hailed as a great victory throughout Wales and led to Lloyd George\u0027s adoption as the Liberal candidate for Carnarvon Boroughs on 27 December 1888. The same year, he and other young Welsh Liberals founded a monthly paper, Udgorn Rhyddid .\nIn 1889, Lloyd George became an alderman on Carnarvonshire County Council and would remain so for the rest of his life. Lloyd George would also serve the county as a Justice of the Peace , chairman of Quarter Sessions , and Deputy Lieutenant in 1921.\n\n\n=== Marriage ===\nLloyd George married Margaret Owen, the daughter of a well-to-do local farming family, on 24 January 1888.  They had five children, see later.\r\n\r\n== Early years as a member of Parliament ==\nLloyd George\u0027s career as a member of parliament began when he was returned as a Liberal MP for Caernarfon Boroughs , narrowly winning the by-election on 10 April 1890, following the death of the Conservative member Edmund Swetenham. He would remain an MP for the same constituency until 1945, 55 years later. Lloyd George\u0027s early beginnings in Westminster may have proven difficult for him as a radical liberal and \u0022a great outsider\u0022. Backbench members of the House of Commons were not paid at that time, so Lloyd George supported himself and his growing family by continuing to practise as a solicitor. He opened an office in London under the name of \u0022Lloyd George and Co.\u0022 and continued in partnership with William George in Criccieth. In 1897, he merged his growing London practice with that of Arthur Rhys Roberts under the name of \u0022Lloyd George, Roberts and Co.\u0022\n\n\n=== Welsh affairs ===\nKenneth O. Morgan describes Lloyd George as a \u0022lifelong Welsh nationalist\u0022 and suggests that between 1880 and 1914 he was \u0022the symbol and tribune of the national reawakening of Wales\u0022, although he is also clear that from the early 1900s his main focus gradually shifted to UK-wide issues. He also became an associate of Tom Ellis, MP for Merioneth, having previously told a Caernarfon friend in 1888 that he was a \u0022Welsh Nationalist of the Ellis type\u0022.\n\n\n==== Decentralisation and Welsh disestablishment ====\nOne of Lloyd George\u0027s first acts as an MP was to organise an informal grouping of Welsh Liberal members with a programme that included; disestablishing and disendowing the Church of England in Wales, temperance reform, and establishing Welsh home rule. He was keen on decentralisation and thus Welsh devolution, starting with the devolution of the Church in Wales saying in 1890: \u0022I am deeply impressed with the fact that Wales has wants and inspirations of her own which have too long been ignored, but which must no longer be neglected. First and foremost amongst these stands the cause of Religious Liberty and Equality in Wales. If returned to Parliament by you, it shall be my earnest endeavour to labour for the triumph of this great cause. I believe in a liberal extension of the principle of Decentralization.\u0022\nDuring the next decade, Lloyd George campaigned in Parliament largely on Welsh issues, in particular for disestablishment and disendowment of the Church of England. When Gladstone retired in 1894 after the defeat of the second Home Rule Bill, the Welsh Liberal members chose him to serve on a deputation to William Harcourt to press for specific assurances on Welsh issues. When those assurances were not provided, they resolved to take independent action if the government did not bring a bill for disestablishment. When a bill was not forthcoming, he and three other Welsh Liberals refused the whip on 14 April 1894, but accepted Lord Rosebery\u0027s assurance and rejoined the official Liberals on 29 May.\n\n\n==== Cymru Fydd and Welsh devolution ====\nHistorian Emyr Price referred to Lloyd George as \u0022the first architect of Welsh devolution and its most famous advocate\u0022 as well as \u0022the pioneering advocate of a powerful parliament for the Welsh people\u0022. Lloyd George himself stated in 1890, \u0022the Imperial Parliament is so overweighted with the concerns of a large empire that it cannot possibly devote the time and trouble necessary to legislate for the peculiar and domestic requirements of each and every separate province\u0022. These statements would later be used to advocate for a Welsh assembly in the 1979 Welsh devolution referendum. Lloyd George felt that disestablishment, land reform and other forms of Welsh devolution could only be achieved if Wales formed its own government within a federal imperial system. In 1895, in a failed Church in Wales Bill, Lloyd George added an amendment in a discreet attempt at forming a sort of Welsh home rule, a national council for appointment of the Welsh Church commissioners. Although not condemned by Tom Ellis MP, this was to the annoyance of J. Bryn Roberts MP and the Home Secretary H. H. Asquith MP.\nHe was also a co-leader of Cymru Fydd, a national Welsh party with liberal values with the goals of promoting a \u0022stronger Welsh identity\u0022 and establishing a Welsh government. He hoped that Cymru Fydd would become a force like the Irish National Party. He abandoned this idea after being criticised in Welsh newspapers for bringing about the defeat of the Liberal Party in the 1895 election. In an AGM meeting in Newport on 16 January 1896 of the South Wales Liberal Federation, led by D. A. Thomas, a proposal was made to unite the North and South Liberal Federations with Cymru Fydd to form The Welsh National Federation. This was a proposal which the North Wales Liberal Federation had already agreed to. However, the South Wales Liberal Federation rejected this. According to Lloyd George, he was shouted down by \u0022Newport Englishmen\u0022 in the meeting, although the South Wales Argus suggested the poor crowd behaviour came from Lloyd George\u0027s supporters. Following difficulty in uniting the Liberal federations along with Cymru Fydd in the South East and thus, difficulty in gaining support for Home Rule for Wales, Lloyd George shifted his focus to improving the socio-economic environment of Wales as part of the United Kingdom and the British Empire. Although Lloyd George considered himself a \u0022Welshman first\u0022, he saw the opportunities for Wales within the UK.\n\n\n==== Uniting Welsh Liberals ====\nIn 1898, Lloyd George created the Welsh National Liberal Council, a loose umbrella organisation covering the two federations, but with very little power. In time, it became known as the Liberal Party of Wales.\n\n\n==== Support of Welsh institutions ====\nLloyd George had a connection to or promoted the establishment of the National Library of Wales, the National Museum of Wales and the Welsh Department of the Board of Education. He also showed considerable support for the University of Wales, that its establishment raised the status of Welsh people and that the university deserved greater funding by the UK government.\n\n\n=== Opposition to the Boer War ===\nLloyd George had been impressed by his journey to Canada in 1899. Although sometimes wrongly supposed—both at the time and subsequently—to be a Little Englander, he was not an opponent of the British Empire per se, but in a speech at Birkenhead he stressed that it needed to be based on freedom, including for India, not \u0022racial arrogance\u0022. Consequently, he gained national fame by displaying vehement opposition to the Second Boer War.\nFollowing Rosebery\u0027s lead, he based his attack firstly on what were supposed to be Britain\u0027s war aims—remedying the grievances of the Uitlanders and in particular the claim that they were wrongly denied the right to vote, saying \u0022I do not believe the war has any connection with the franchise. It is a question of 45% dividends\u0022 and that England was more in need of franchise reform than the Boer republics. A second attack came on the cost of the war, which, he argued, prevented overdue social reform in England, such as old-age pensions and workmen\u0027s cottages. As the fighting continued his attacks moved to its conduct by the generals, who, he said , were not providing for the sick or wounded soldiers and were starving Boer women and children in concentration camps. But his major thrusts were reserved for the Chamberlains, accusing them of war profiteering through the family company Kynoch Ltd, of which Joseph Chamberlain\u0027s brother was chairman. The firm had won tenders to the War Office, though its prices were higher than some of its competitors. After speaking at a meeting in Birmingham Lloyd George had to be smuggled out disguised as a policeman, as his life was in danger from the mob. At this time the Liberal Party was badly split as H. H. Asquith, R. B. Haldane and others were supporters of the war and formed the Liberal Imperial League.\n\n\n=== Opposition to the Education Act 1902 ===\n\nOn 24 March Arthur Balfour, just about to take office as prime minister, introduced a bill which was to become the Education Act 1902. Lloyd George supported the bill\u0027s proposals to bring voluntary schools in England and Wales under the control of local school boards, who would conduct inspections and appoint two out of each school\u0027s six managers. However, other measures were more contentious: the majority-religious school managers would retain the power to employ or sack teachers on religious grounds and would receive money from the rates . This offended nonconformist opinion, then in a period of revival, as it seemed like a return to the hated church rates , and inspired a large grassroots campaign against the bill.\nWithin days of the bill\u0027s unveiling , Lloyd George denounced \u0022priestcraft\u0022 in a speech to his constituents, and he began an active campaign of speaking against the bill, both in public in Wales and in the House of Commons. On 12 November, Balfour accepted an amendment , ostensibly from Alfred Thomas, chairman of the Welsh Parliamentary Liberal Party, but in reality instigated by Lloyd George, transferring control of Welsh schools from appointed boards to the elected county councils. The Education Act became law on 20 December 1902.\nLloyd George now announced the real purpose of the amendment, described as a \u0022booby trap\u0022 by his biographer John Grigg. The Welsh National Liberal Council soon adopted his proposal that county councils should refuse funding unless repairs were carried out to schools , and should also demand control of school governing bodies and a ban on religious tests for teachers; \u0022no control, no cash\u0022 was Lloyd George\u0027s slogan. Lloyd George negotiated with A. G. Edwards, Anglican Bishop of St Asaph, and was prepared to settle on an \u0022agreed religious syllabus\u0022 or even to allow Anglican teaching in schools, provided the county councils retained control of teacher appointments, but this compromise failed after opposition from other Anglican Welsh bishops. A well-attended meeting at Park Hall Cardiff passed a number of resolutions by acclamation: county council control of schools, withholding money from schools or even withholding rates from unsupportive county councils. The Liberals soon gained control of all thirteen Welsh County Councils. Lloyd George continued to speak in England against the bill, but the campaign there was less aggressively led, taking the form of passive resistance to rate paying.\nIn August 1904 the government brought in the Education Act giving the Board of Education power to take charge of schools, which Lloyd George immediately nicknamed the \u0022Coercion of Wales Act\u0022. He addressed another convention in Cardiff on 6 October 1904, during which he proclaimed that the Welsh flag was \u0022a dragon rampant, not a sheep recumbent\u0022. Under his leadership, the convention pledged not to maintain elementary schools, or to withdraw children from elementary schools altogether so that they could be taught privately by the nonconformist churches. In Travis Crosbie\u0027s words, public resistance to the Education Act had caused a \u0022perfect impasse\u0022. There was no progress between Welsh counties and Westminster until 1905.\nHaving already gained national recognition for his anti-Boer War campaigns, Lloyd George\u0027s leadership of the attacks on the Education Act gave him a strong parliamentary reputation and marked him as a likely future cabinet member. The Act served to reunify the Liberals after their divisions over the Boer War and to increase Nonconformist influence in the party, which then included educational reform as policy in the 1906 election, which resulted in a Liberal landslide. All 34 Welsh seats returned a Liberal, except for one Labour seat in Merthyr Tydfil.\n\n\n=== Other stances ===\nLloyd George also supported the romantic nationalist idea of Pan-Celtic unity and gave a speech at the 1904 Pan-Celtic Congress in Caernarfon.\nDuring his second-ever speech in the House of Commons, Lloyd George criticised the grandeur of the monarchy.\nLloyd George wrote extensively for Liberal-supporting papers such as the Manchester Guardian and spoke on Liberal issues throughout England and Wales.\nHe served as the legal adviser of Theodor Herzl in his negotiations with the British government regarding the Uganda Scheme, proposed as an alternative homeland for the Jews due to Turkish refusal to grant a charter for Jewish settlement in Palestine.\r\n\r\n== President of the Board of Trade ==\n\nIn 1905, Lloyd George entered the new Liberal Cabinet of Sir Henry Campbell-Bannerman as President of the Board of Trade.\nThe first priority on taking office was the repeal of the Education Act 1902. Lloyd George took the lead along with Augustine Birrell, President of the Board of Education. Lloyd George appears to have been the dominant figure on the committee drawing up the bill in its later stages and insisted that the bill create a separate education committee for Wales. Birrell complained privately that the bill, introduced in the Commons on 9 April 1906, owed more to Lloyd George and that he himself had had little say in its contents. The bill passed the House of Commons greatly amended but was completely mangled by the House of Lords. For the rest of the year Lloyd George made numerous public speeches attacking the House of Lords for mutilating the bill with wrecking amendments, in defiance of the Liberals\u0027 electoral mandate to reform the 1902 Act. Lloyd George was rebuked by King Edward VII for these speeches: the Prime Minister defended him to the King\u0027s secretary Francis Knollys, stating that his behaviour in Parliament was more constructive but that in speeches to the public \u0022the combative spirit seems to get the better of him\u0022. No compromise was possible and the bill was abandoned, allowing the 1902 Act to continue in effect. As a result of Lloyd George\u0027s lobbying, a separate department for Wales was created within the Board of Education.\nNonconformists were bitterly upset by the failure of the Liberal Party to reform the 1902 Education Act, its most important promise to them, and over time their support for the Liberal Party slowly fell away.\nAt the Board of Trade Lloyd George introduced legislation on many topics, from merchant shipping and the Port of London to companies and railway regulation. His main achievement was in stopping a proposed national strike of the railway unions by brokering an agreement between the unions and the railway companies. While almost all the companies refused to recognise the unions, Lloyd George persuaded the companies to recognise elected representatives of the workers who sat with the company representatives on conciliation boards—one for each company. If those boards failed to agree then an arbitrator would be called upon.\r\n\r\n== Chancellor of the Exchequer ==\n\nOn Campbell-Bannerman\u0027s death, he succeeded Asquith, who had become prime minister, as Chancellor of the Exchequer from 1908 to 1915. While he continued some work from the Board of Trade—for example, legislation to establish the Port of London Authority and to pursue traditional Liberal programmes such as licensing law reforms—his first major trial in this role was over the 1909–1910 Naval Estimates. The Liberal manifesto at the 1906 general election included a commitment to reduce military expenditure. Lloyd George strongly supported this, writing to Reginald McKenna, First Lord of the Admiralty, of \u0022the emphatic pledges given by all of us at the last general election to reduce the gigantic expenditure on armaments built up by the recklessness of our predecessors.\u0022 He then proposed the programme be reduced from six to four dreadnoughts. This was adopted by the government, but there was a public storm when the Conservatives, with covert support from the First Sea Lord, Admiral Jackie Fisher, campaigned for more with the slogan \u0022We want eight and we won\u0027t wait\u0022. This resulted in Lloyd George\u0027s defeat in Cabinet and the adoption of estimates including provision for eight dreadnoughts. During this period he was also a target of protest by the women\u0027s suffrage movement, for he professed personal support for extension of the suffrage but did not move for changes within the Parliament process.\n\n\n=== People\u0027s Budget, 1909 ===\n\nIn 1909, Lloyd George introduced his People\u0027s Budget, imposing a 20% tax on the unearned increase in the value of land, payable at the death of the owner or sale of the land, and 1⁄2 d. on undeveloped land and minerals, increased death duties, a rise in income tax, and the introduction of Supertax on income over £3,000. There were taxes also on luxuries, alcohol and tobacco, so that money could be made available for the new welfare programmes as well as new battleships. The nation\u0027s landowners were intensely angry at the new taxes, mostly at the proposed very high tax on land values, but also because the instrumental redistribution of wealth could be used to detract from an argument for protective tariffs.\nThe immediate consequences included the end of the Liberal League, and Rosebery breaking friendship with the Liberal Party, which in itself was for Lloyd George a triumph. He had won the case of social reform without losing the debate on Free Trade. Arthur Balfour denounced the budget as \u0022vindictive, inequitable, based on no principles, and injurious to the productive capacity of the country.\u0022 Roy Jenkins described it as the most reverberating since Gladstone\u0027s in 1860.\nIn the House of Commons, Lloyd George gave a brilliant account of the budget, which was attacked by the Conservatives. On the stump, notably at his Limehouse speech in 1909, he denounced the Conservatives and the wealthy classes with all his very considerable oratorical power. Excoriating the House of Lords in another speech, Lloyd George said, \u0022should 500 men, ordinary men, chosen accidentally from among the unemployed, override the judgement—the deliberate judgement—of millions of people who are engaged in the industry which makes the wealth of the country?\u0022. In a break with convention, the budget was defeated by the Conservative majority in the House of Lords. The January and December elections of 1910 narrowly upheld the Liberal government. The 1909 budget was passed on 28 April 1910 by the Lords and received the Royal Assent on the 29th. Subsequently, the Parliament Act 1911 removed the House of Lords\u0027 power to block money bills, and with a few exceptions replaced their veto power over most bills with a power to delay them for up to two years.\nAlthough old-age pensions had already been introduced by Asquith as Chancellor, Lloyd George was largely responsible for the introduction of state financial support for the sick and infirm —legislation referred to as the Liberal Reforms. Lloyd George also succeeded in putting through Parliament his National Insurance Act 1911, making provision for sickness and invalidism, and a system of unemployment insurance. He was helped in his endeavours by forty or so backbenchers who regularly pushed for new social measures, often voted with Labour MPs. These social reforms in Britain were the beginnings of a welfare state and fulfilled the aim of dampening down the demands of the growing working class for rather more radical solutions to their impoverishment.\nUnder his leadership, after 1909 the Liberals extended minimum wages to farmworkers.\n\n\n=== Mansion House Speech, 1911 ===\nLloyd George was an opponent of warfare but he paid little attention to foreign affairs until the Agadir Crisis of 1911. After consulting Edward Grey and H. H. Asquith he gave a stirring and patriotic speech at Mansion House on 21 July 1911, during that year\u0027s annual white tie dinner at the official residence of the Lord Mayor of London, where the Chancellor of the Exchequer delivers a speech known as the \u0022Mansion House Speech\u0022. He stated: But if a situation were to be forced upon us in which peace could only be preserved by the surrender of the great and beneficent position Britain has won by centuries of heroism and achievement, by allowing Britain to be treated where her interests were vitally affected as if she were of no account in the Cabinet of nations, then I say emphatically that peace at that price would be a humiliation intolerable for a great country like ours to endure. National honour is no party question. The security of our great international trade is no party question. \nHe was warning both France and Germany, but the public response cheered solidarity with France and hostility toward Germany. Berlin was outraged, blaming Lloyd George for doing \u0022untold harm both with regard to German public opinion and the negotiations.\u0022 Count Metternich, Germany\u0027s ambassador in London, said, \u0022Mr Lloyd George\u0027s speech came upon us like a thunderbolt\u0022.\n\n\n=== Marconi scandal 1913 ===\nIn 1913, Lloyd George, along with Rufus Isaacs, the Attorney General, was involved in the Marconi scandal. Accused of speculating in Marconi shares on the inside information that they were about to be awarded a key government contract , he told the House of Commons that he had not speculated in the shares of \u0022that company\u0022. He had in fact bought shares in the American Marconi Company.\n\n\n=== Welsh disestablishment ===\nLloyd George was instrumental in fulfilling a long-standing aspiration to disestablish the Anglican Church of Wales. As with Irish Home Rule, previous attempts to enact this had failed in the 1892–1895 Governments, and were now made possible by the removal of the Lords\u0027 veto in 1911, and as with Home Rule the initial bill was delayed for two years by the Lords, becoming law in 1914, only to be suspended for the duration of the war. After the Welsh Church Act 1919 was passed, Welsh Disestablishment finally came into force in 1920. This Act also removed the right of the six Welsh Bishops in the new Church in Wales to sit in the House of Lords and removed certain pre-1662 property rights.\r\n\r\n== First World War ==\nLloyd George was as surprised as almost everyone else by the outbreak of the First World War. On 23 July 1914, almost a month after the assassination of Archduke Franz Ferdinand and on the eve of the Austro-Hungarian ultimatum to Serbia, he made a speech advocating \u0022economy\u0022 in the House of Commons, saying that Britain\u0027s relations with Germany were better than for many years. On 27 July he told C. P. Scott of the Manchester Guardian that Britain would keep out of the impending war. With the Cabinet divided, and most ministers reluctant for Britain to get involved, he struck Asquith as \u0022statesmanlike\u0022 at the Cabinet meeting on 1 August, favouring keeping Britain\u0027s options open. The next day he seemed likely to resign if Britain intervened, but he held back at Cabinet on Monday 3 August, moved by the news that Belgium would resist Germany\u0027s demand of passage for her army across her soil. He was seen as a key figure whose stance helped to persuade almost the entire Cabinet to support British intervention. He was able to give the more pacifist members of the cabinet and the Liberal Party a principle—the rights of small nations—which meant they could support the war and maintain united political and popular support.\nLloyd George remained in office as Chancellor of the Exchequer for the first year of the Great War. The budget of 17 November 1914 had to allow for lower taxation receipts because of the reduction in world trade. The Crimean and Boer Wars had largely been paid for out of taxation, but Lloyd George raised debt financing of £321 million. Large increases in Supertax and income tax rates were accompanied by increases in excise duties, and the budget produced a tax increase of £63 million in a full year. His last budget, on 4 May 1915, showed a growing concern for the effects of alcohol on the war effort, with large increases in duties, and a scheme of state control of alcohol sales in specified areas. The excise proposals were opposed by the Irish Parliamentary Party and the Conservatives, and were abandoned.\n\n\n=== Minister of Munitions ===\n\nLloyd George gained a heroic reputation with his energetic work as Minister of Munitions in 1915 and 1916, setting the stage for his move up to the height of power. After a long struggle with the War Office, he wrested responsibility for arms production away from the generals, making it a purely industrial department, with considerable expert assistance from Walter Runciman. The two men gained the respect of Liberal cabinet colleagues for improving administrative capabilities, and increasing outputs.\nWhen the Shell Crisis of 1915 dismayed public opinion with the news that the Army was running short of artillery shells, demands rose for a strong leader to take charge of munitions. In the first coalition ministry, formed in May 1915, Lloyd George was made Minister of Munitions, heading a new department. In this position, he won great acclaim, which formed the basis for his political ascent. All historians agree that he boosted national morale and focussed attention on the urgent need for greater output, but many also say the increase in munitions output in 1915–16 was due largely to reforms already underway, though not yet effective before he had even arrived. The Ministry broke through the cumbersome bureaucracy of the War Office, resolved labour problems, rationalised the supply system and dramatically increased production. Within a year it became the largest buyer, seller and employer in Britain.\n\nLloyd George was not at all satisfied with the progress of the war. He wanted to \u0022knock away the props\u0022, by attacking Germany\u0027s allies—from early in 1915 he argued for the sending of British troops to the Balkans to assist Serbia and bring Greece and other Balkan countries onto the side of the Allies ; in 1916, he wanted to send machine guns to Romania . These suggestions began a period of poor relations with the Chief of the Imperial General Staff, General William Robertson, who was \u0022brusque to the point of rudeness\u0022 and \u0022barely concealed his contempt for Lloyd George\u0027s military opinions\u0022, to which he was in the habit of retorting \u0022I\u0027ve \u0027eard different\u0022.\nLloyd George persuaded Lord Kitchener, the Secretary of State for War, to raise a Welsh Division, and, despite Kitchener\u0027s threat of resignation, to recognise nonconformist chaplains in the Army.\nLate in 1915, Lloyd George became a strong supporter of general conscription, an issue that divided Liberals, and helped the passage of several conscription acts from January 1916 onwards. In spring 1916 Alfred Milner hoped Lloyd George could be persuaded to bring down the coalition government by resigning, but this did not happen.\n\n\n=== Secretary of State for War ===\n\nIn June 1916 Lloyd George succeeded Lord Kitchener as Secretary of State for War, although he had little control over strategy, as General Robertson had been given direct right of access to the Cabinet so as to bypass Kitchener. He did succeed in securing the appointment of Sir Eric Geddes to take charge of military railways behind British lines in France, with the honorary rank of major-general. Lloyd George told a journalist, Roy W. Howard, in late September that \u0022the fight must be to a finish—to a knockout\u0022, a rejection of President Woodrow Wilson\u0027s offer to mediate.\nLloyd George was increasingly frustrated at the limited gains of the Somme offensive, criticising General Douglas Haig to Ferdinand Foch on a visit to the Western Front in September , proposing sending Robertson on a mission to Russia , and demanding that more troops be sent to Salonika to help Romania. Robertson eventually threatened to resign.\nMuch of the press still argued that the professional leadership of Haig and Robertson was preferable to civilian interference that had led to disasters like Gallipoli and Kut. Lord Northcliffe, owner of The Times, stormed into Lloyd George\u0027s office and, finding him unavailable, told his secretary \u0022You can tell him that I hear he has been interfering with Strategy and that if he goes on I will break him\u0022, and the same day Lloyd George also received a warning letter from H. A. Gwynne, editor of the Morning Post. He was obliged to give his \u0022word of honour\u0022 to Asquith that he had complete confidence in Haig and Robertson and thought them irreplaceable, but he wrote to Robertson wanting to know how their differences had been leaked to the press . He asserted his right to express his opinions about strategy in November, by which time ministers had taken to holding meetings to which Robertson was not invited.\n\nThe weakness of Asquith as a planner and organiser was increasingly apparent to senior officials. After Asquith had refused, then agreed to, and then refused again Lloyd George\u0027s demand to be allowed to chair a small committee to manage the war, he resigned in December 1916. Grey was among leading Asquithians who had identified Lloyd George\u0027s intentions the previous month. Lloyd George became prime minister, with the nation demanding he take vigorous charge of the war.\nAlthough during the political crisis Robertson had advised Lloyd George to \u0022stick to it\u0022 and form a small War Council, Lloyd George had planned if necessary to appeal to the country. His Military Secretary Colonel Arthur Lee prepared a memo blaming Robertson and the General Staff for the loss of Serbia and Romania. Lloyd George was restricted by his promise to the Unionists to keep Haig as Commander-in-Chief and the press support for the generals, although Milner and Curzon were also sympathetic to campaigns to increase British power in the Middle East. After Germany\u0027s offer of a negotiated peace, Lloyd George rebuffed President Wilson\u0027s request for the belligerents to state their war aims by demanding terms tantamount to German defeat.\r\n\r\n== Prime Minister ==\n\nLloyd George\u0027s tenure as wartime prime minister from 1916 to 1918, remains a subject of intense historical scrutiny, primarily due to its military success and his restructuring of the office along presidential lines.  His ascent to the premiership marked a significant departure from traditional norms, as he was the first Welshman to hold the office. Once in office his leadership style diverged markedly from his predecessors, characterized by a more dynamic and interventionist approach to governance. Lloyd George relied on his political background: rooted in Liberalism, advocating for social reforms and challenging the established aristocratic order, he had made his mark through his persuasive oratory and political acumen.\n\n\n=== War leader ===\n\n\n==== Forming a government ====\nThe fall of Asquith as prime minister split the Liberal Party into two factions: those who supported him and those who supported the coalition government. In his War Memoirs, Lloyd George compared himself with Asquith:\n\nThere are certain indispensable qualities essential to the Chief Minister of the Crown in a great war. ... Such a minister must have courage, composure, and judgment. All this Mr. Asquith possessed in a superlative degree. ... But a war minister must also have vision, imagination and initiative—he must show untiring assiduity, must exercise constant oversight and supervision of every sphere of war activity, must possess driving force to energize this activity, must be in continuous consultation with experts, official and unofficial, as to the best means of using the resources of the country in conjunction with the Allies for the achievement of victory. If to this can be added a flair for conducting a great fight, then you have an ideal War Minister.\nAfter December 1916 Lloyd George relied on the support of Conservatives and of the press baron Lord Northcliffe . Besides the Prime Minister, the five-member War Cabinet contained three Conservatives and Arthur Henderson, unofficially representing Labour. Edward Carson was appointed First Lord of the Admiralty, as had been widely touted during the intrigues of the previous month, but excluded from the War Cabinet. Amongst the few Liberal frontbenchers to support Lloyd George were Christopher Addison , H. A. L. Fisher, Lord Rhondda and Sir Albert Stanley. Edwin Montagu and Churchill joined the government in the summer of 1917.\nLloyd George\u0027s Secretariat, popularly known as Downing Street\u0027s \u0022Garden Suburb\u0022, assisted him in discharging his responsibilities within the constraints of the war cabinet system. Its function was to maintain contact with the numerous departments of government, to collect information, and to report on matters of special concern. Its leading members were George Adams and Philip Kerr, and the other secretaries included David Davies, Joseph Davies, Waldorf Astor and, later, Cecil Harmsworth.\nLloyd George wanted to make the destruction of the Ottoman Empire a major British war aim, and two days after taking office told Robertson that he wanted a major victory, preferably the capture of Jerusalem, to impress British public opinion.\nAt the Rome Conference Lloyd George was discreetly quiet about plans to take Jerusalem, an object which advanced British interests rather than doing much to win the war. Lloyd George proposed sending heavy guns to Italy with a view to defeating Austria-Hungary, possibly to be balanced by a transfer of Italian troops to Salonika but was unable to obtain the support of the French or Italians, and Robertson talked of resigning.\n\n\n==== Nivelle affair ====\nLloyd George engaged almost constantly in intrigues calculated to reduce the power of the generals, including trying to subordinate British forces in France to the French General Robert Nivelle. He backed Nivelle because he thought he had \u0022proved himself to be a Man\u0022 by his successful counterattacks at Verdun, and because of his promises that he could break the German lines in 48 hours. Nivelle increasingly complained of Haig\u0027s dragging his feet rather than cooperating with their plans for the offensive.\nThe plan was to put British forces under Nivelle\u0027s direct command for the great 1917 offensive. The British would attack first, thereby tying down the German reserves. Then the French would strike and score an overwhelming victory in two days. It was announced at a War Cabinet meeting on 24 February, to which neither Robertson nor Lord Derby had been invited. Ministers felt that the French generals and staff had shown themselves more skilful than the British in 1916, whilst politically Britain had to give wholehearted support to what would probably be the last major French effort of the war. The Nivelle proposal was then given to Robertson and Haig without warning on 26–27 February at the Calais Conference . Robertson in particular protested vehemently. Finally, a compromise was reached whereby Haig would be under Nivelle\u0027s orders but would retain operational control of British forces and keep a right of appeal to London \u0022if he saw good reason\u0022. After further argument the status quo, that Haig was an ally of the French but was expected to defer to their wishes, was largely restored in mid-March.\nThe British attack at the Battle of Arras was partly successful but with much higher casualties than the Germans suffered. There had been many delays and the Germans, suspecting an attack, had shortened their lines to the strong Hindenburg Line. The French attack on the Aisne River in mid-April gained some tactically important high ground but failed to achieve the promised decisive breakthrough, pushing the French Army to the point of mutiny. While Haig gained prestige, Lloyd George lost credibility, and the affair further poisoned relations between himself and the \u0022Brasshats\u0022.\n\n\n==== U-boat war ====\n\n\n===== Shipping =====\nIn early 1917 the Germans had resumed unrestricted submarine warfare in a bid to achieve victory on the Western Approaches. Lloyd George set up a Ministry of Shipping under Sir Joseph Maclay, a Glasgow shipowner who was not, until after he left office, a member of either House of Parliament, and housed in a wooden building in a specially drained lake in St James\u0027s Park, within a few minutes\u0027 walk from the Admiralty. The Junior Minister and House of Commons spokesman was Leo Chiozza Money, with whom Maclay did not get on, but on whose appointment Lloyd George insisted, feeling that their qualities would complement one another. The Civil Service staff was headed by the highly able John Anderson and included Arthur Salter. A number of shipping magnates were persuaded, like Maclay himself, to work unpaid for the ministry , who were also able to obtain ideas privately from junior naval officers who were reluctant to argue with their superiors in meetings. The ministers heading the Board of Trade, for Munitions and for Agriculture and Food , were also expected to co-operate with Maclay.\nIn accordance with a pledge Lloyd George had given in December 1916 nearly 90% of Britain\u0027s merchant shipping tonnage was soon brought under state control , whilst remaining privately owned . Merchant shipping was concentrated, largely on Chiozza Money\u0027s initiative, on the transatlantic route where it could more easily be protected, instead of being spread out all over the globe . Maclay began the process of increasing ship construction, although he was hampered by shortages of steel and labour, and ships under construction in the United States were confiscated by the Americans when she entered the war. In May 1917 Eric Geddes, based at the Admiralty, was put in charge of shipbuilding, and in July he became First Lord of the Admiralty. Later the German U-boats were defeated in 1918.\n\n\n===== Convoys =====\n\nLloyd George had raised the matter of convoys at the War Committee in November 1916, only to be told by the admirals present, including John Jellicoe, that convoys presented too large a target, and that merchant ship masters lacked the discipline to keep station in a convoy.\nIn February 1917 Maurice Hankey, the secretary of the War Cabinet, wrote a memorandum for Lloyd George calling for the introduction of \u0022scientifically organised convoys\u0022, almost certainly after being persuaded by Commander Reginald Henderson and the Shipping Ministry officials with whom he was in contact. After a breakfast meeting with Lloyd George, Sir Edward Carson and Admirals Jellicoe and Alexander Duff agreed to \u0022conduct experiments\u0022; however, convoys were not in general use until August, by which time the rate of shipping losses was already in decline after peaking in April.\nLloyd George later claimed in his War Memoirs that the delay in introducing convoys was because the Admiralty mishandled an experimental convoy between Britain and Norway and because Jellicoe obtained, behind Maclay\u0027s back, an unrepresentative sample of merchant skippers claiming that they lacked the skill to \u0022keep station\u0022 in convoy. In fact, Hankey\u0027s diary shows that Lloyd George\u0027s interest in the matter was intermittent, whilst Frances Stevenson\u0027s diaries contain no mention of the topic. He may well have been reluctant, especially at a time when his relations with the generals were so poor, for a showdown with Carson, a weak administrator who was as much the mouthpiece of the admirals as Derby was of the generals, but who had played a key role in the fall of Asquith and who led a significant bloc of Conservative and Irish Unionist MPs.\nThe new Commander of the Grand Fleet Admiral David Beatty, whom Lloyd George visited at Invergordon on 15 April, was a supporter of convoys, as was the American Admiral William Sims . The War Cabinet on 25 April authorised Lloyd George to look into the anti-submarine campaign, and on 30 April he visited the Admiralty. Duff had already recommended to Jellicoe that the Admiralty adopt convoys after a recent successful convoy from Gibraltar.\nMost of the organisations Lloyd George created during the First World War were replicated with the outbreak of the Second World War. As Lord Beaverbrook wrote, \u0022There were no road signs on the journey he had to undertake.\u0022 The latter\u0027s personal efforts to promote convoys were less consistent than he later claimed; the idea that he, after a hard struggle, sat in the First Lord\u0027s chair and imposed convoys on a hostile Board is a myth; however, in Grigg\u0027s view the credit goes largely to men and institutions which he set in place, and with a freer hand, and making fewer mistakes, than in his dealings with the generals, he and his appointees took decisions which can reasonably be said to have saved the country. \u0022It was a close-run thing ... failure would have been catastrophic.\u0022\n\n\n==== Russian Revolution ====\nLloyd George welcomed the Fall of the Tsar, both in a private letter to his brother and in a message to the new Russian Prime Minister Prince Georgy Lvov, not least as the war could now be portrayed as a clash between liberal governments and the autocratic Central Powers. Like many observers, he had been taken by surprise by the exact timing of the revolution and hoped—albeit with some concerns—that Russia\u0027s war effort would be invigorated like that of France in the early 1790s.\nLloyd George gave a cautious welcome to the suggestion by the Russian Foreign Minister Pavel Milyukov that the toppled Tsar and his family be given sanctuary in Britain . From the very start, the King\u0027s adviser Lord Stamfordham raised objections, and in April the British government withdrew its consent under royal pressure. Eventually, the Russian royal family were moved to the Urals where they were executed in 1918. Lloyd George was often blamed for the refusal of asylum, and in his War Memoirs he did not mention King George V\u0027s role in the matter, which was not explicitly confirmed until Kenneth Rose\u0027s biography of the King was published in 1983.\n\n\n==== Imperial War Cabinet ====\nAn Imperial War Cabinet, including representatives from Canada, Newfoundland, Australia, New Zealand, South Africa and India, met 14 times from 20 March 1917 to 2 May 1917 and twice in 1918. The idea was not entirely without precedent as there had been Imperial Conferences in 1887, 1894, 1897, 1902, 1907 and 1911, whilst the Australian Prime Minister Billy Hughes had been invited to attend the Cabinet and War Committee on his visit to the UK in the spring of 1916. The South African Jan Smuts was appointed to the British War Cabinet in the early summer of 1917.\n\n\n==== Passchendaele ====\nLloyd George set up a War Policy Committee to discuss strategy, which held 16 meetings over the next six weeks. At the very first meeting Lloyd George proposed helping the Italians to capture Trieste, explicitly telling the War Policy Committee that he wanted Italian soldiers to be killed rather than British.\nHaig believed that a Flanders offensive had a good chance of clearing the Belgian coast, from which German submarines and destroyers were operating , and that victory at Ypres \u0022might quite possibly lead to collapse\u0022. Robertson was less optimistic, but preferred Britain to keep her focus on defeating Germany on the Western Front, and had told Haig that the politicians would not \u0022dare\u0022 overrule both soldiers if they gave the same advice. Haig promised he had no \u0022intention of entering into a tremendous offensive involving heavy losses\u0022 whilst Robertson wanted to avoid \u0022disproportionate loss\u0022 .\nThe Flanders offensive was reluctantly sanctioned by the War Policy Committee on 18 July and the War Cabinet two days later, on condition it did not degenerate into a long drawn-out fight like the Somme. The War Cabinet promised to monitor progress and casualties and, if necessary call a halt, although in the event they made little effort to monitor progress until September. Frustrated at his inability to get his way, Lloyd George talked of resigning and taking his case to the public.\nThe Battle of Passchendaele began on 31 July, but soon became bogged down in unseasonably early wet weather, which turned much of the battlefield into a barely passable swamp in which men and animals sometimes drowned, whilst the mud and rain severely reduced the accuracy and effectiveness of artillery, the dominant weapon of the time. Lloyd George tried to enlist the King for diverting efforts against Austria-Hungary, telling Stamfordham that the King and Prime Minister were \u0022joint trustees of the nation\u0022 who had to avoid waste of manpower. A new Italian offensive began , but Robertson advised that it was \u0022false strategy\u0022 to call off Passchendaele to send reinforcements to Italy, and despite being summoned to George Riddell\u0027s home in Sussex, where he was served apple pudding , agreed only reluctantly. The Anglo-French leadership agreed in early September to send 100 heavy guns to Italy rather than the 300 which Lloyd George wanted—Lloyd George talked of ordering a halt to Passchendaele, but in Hankey\u0027s words \u0022funked it\u0022 . Had he not done so his government might have fallen, for as soon as the guns reached Italy Luigi Cadorna called off his offensive .\nAt a meeting at Boulogne on the 25th of September, Lloyd George broached with Paul Painlevé the setting up of an Allied Supreme War Council then making Ferdinand Foch generalissimo. Law had written to Lloyd George that ministers must soon decide whether or not the offensive was to continue. Lloyd George and Robertson met Haig in France to discuss the recent German peace feelers and the progress of the offensive. Haig preferred to continue, encouraged by Herbert Plumer\u0027s recent successful attacks in dry weather at Menin Road and Polygon Wood , and stating that the Germans were \u0022very worn out\u0022. In October the wet weather returned for the final attack towards Passchendaele. At the final meeting of the War Policy Committee on 11 October 1917, Lloyd George authorised the offensive to continue, but warning of failure in three weeks\u0027 time. Hankey claimed in his diary that Lloyd George had deliberately allowed Passchendaele to continue to discredit Haig and Robertson and make it easier for him to forbid similar offensives in 1918.\n\n\n==== Supreme War Council ====\nThe Italians suffered a disastrous defeat at Caporetto, requiring British and French reinforcements to be sent. Lloyd George said he \u0022wanted to take advantage of Caporetto to gain \u0022control of the War\u0022. The Supreme War Council was inaugurated at the Rapallo Conference . Lloyd George then gave a controversial speech in Paris at which he criticised the high casualties of recent Allied \u0022victories\u0022 . These events led to an angry Commons debate , which Lloyd George survived.\nIn reply to Robertson\u0027s 19 November memo, which warned that the Germans would use the opportunity of Russia\u0027s departure from the war to attack in 1918 before the Americans were present in strength, Lloyd George wrote that the Germans would not attack and would fail if they did. That autumn he declared that he was willing \u0022to risk his whole political reputation\u0022 to avoid a repetition of the Somme or Passchendaele.\nIn December 1917 Lloyd George remarked to C. P. Scott that: \u0022If people really knew, the war would be stopped tomorrow. But of course, they don\u0027t know, and can\u0027t know.\u0022\n\n\n==== Manpower crisis and the unions ====\nA Manpower Committee was set up on 6 December 1917, consisting of the Prime Minister, Curzon, Carson, George Barnes and Smuts with Maurice Hankey as secretary, and Auckland Geddes in regular attendance.\nThe first meeting of the Manpower Committee was on 10 December, and it met twice the next day and again on 15 December. Lloyd George questioned Generals Nevil Macready and George Macdonogh , who advised that the Allied superiority of numbers on the Western Front would not survive the transfer of German reinforcements from the East now that Russia was dropping out of the war. Deeply concerned about the publicity attracted by the recent Lansdowne letter\u0027s mention of casualties, he suggested removing Haig and Robertson from office at this time, but this was met by a threat of resignation from Lord Derby. At this stage Lloyd George opposed extending conscription to Ireland—Carson advised that extending conscription to Ulster alone would be impractical.\nWhen Hankey\u0027s report eventually emerged it reflected Lloyd George\u0027s wishes: it gave top priority to shipbuilding and merchant shipping , and placed Army manpower below both weapons production and civilian industry. The size of the Army in Britain was to be reduced from eight divisions to four, freeing about 40,000 men for service in France. In the House of Commons Lloyd George also argued that the collapse of Russia and defeat of Italy required further \u0022combing-out\u0022 of men from industry, in breach of pledges given to the trade unions in 1916. Auckland Geddes was given increased powers to direct labour—a new bill became law, despite the opposition of the Amalgamated Society of Engineers, in February 1918.\n\n\n==== War goals ====\nLloyd George outlined Allied war aims at a conference at Caxton Hall on 5 January 1918.  Addressing an audience of trade unionists, he called for Germany to be stripped of her conquests and democratised , and for the liberation of the subject peoples of Austria-Hungary and the Ottoman Empire. He also hinted at reparations and a new international order. Lloyd George explained to critics that he was hoping to detach Austria-Hungary and turn the German people against her rulers; the speech greatly increased his support amongst trade unions and the Labour Party. President Wilson at first considered abandoning his speech outlining US war aims—the \u0022Fourteen Points\u0022, many of which were similar to the aims outlined by Lloyd George—but was persuaded by his adviser Colonel House to deliver it. Wilson\u0027s speech overshadowed Lloyd George\u0027s and is better remembered by posterity.\n\n\n==== Strategic priorities ====\n\nLloyd George told Edmund Allenby, who was appointed the new commander in Egypt in June, that his objective was \u0022Jerusalem before Christmas.\u0022 Amidst months of argument throughout the autumn of 1917 Robertson was able to block Lloyd George\u0027s plan to make Palestine the main theatre of operations by having Allenby make the impossible demand that thirteen extra divisions be sent to him. Allenby captured Jerusalem in December 1917.\nIn the winter of 1917–18, Lloyd George secured the resignations of both the service chiefs. Removing the First Sea Lord Admiral Jellicoe earlier in 1917, as Lloyd George wanted, would have been politically impossible given Conservative anger at the return of Churchill to office as Minister of Munitions in July, and Lloyd George\u0027s preoccupations with Passchendaele, Caporetto and the Supreme War Council from July onward. By December it was clear that Lloyd George would have to sack Jellicoe or lose Eric Geddes , who wanted to return to his previous job in charge of military transport in France. The Christmas holiday, when Parliament was not sitting, provided a good opportunity. Before Jellicoe left for leave on Christmas Eve he received a letter from Geddes demanding his resignation. The other Sea Lords talked of resigning but did not do so, whilst Jellicoe\u0027s ally Carson remained a member of the War Cabinet until he resigned in January over Irish Home Rule.\nRelations with General Robertson had worsened further over the creation of the Supreme War Council at Versailles and he was eventually forced out over his insistence that the British delegate there be subordinate to Robertson as CIGS in London.\n\n\n==== Balfour Declaration ====\nAs Prime Minister Lloyd George played a pivotal role in the establishment of a Jewish National Home in Palestine. His government issued the Balfour Declaration in 1917 announcing an official British commitment to support an eventual Jewish homeland in Palestine.  Lloyd George led the war effort against the Ottomans, whose empire was broken up and taken over in large part by Britain and France. Britain took over Palestine. He presided over the Imperial Cabinet when it endorsed this policy, and he secured the backing of Britain\u0027s allies, especially the United States and France. He was also the principal delegate at the San Remo conference in 1920, where the League of Nations designed the Mandate for Palestine and conferred it upon Britain.  Zionist leader Chaim Weizmann said Lloyd George initiated the Balfour Declaration and followed the development of the Zionist movement and the upbuilding of Palestine with keen interest in every stage.\n\n\n==== Home front ====\n\nThe War Cabinet was a very successful innovation. It met almost daily, with Maurice Hankey as secretary, and made all major political, military, economic and diplomatic decisions. Rationing was finally imposed in early 1918 for meat, sugar and fats —but not bread; the new system worked smoothly. From 1914 to 1918 trade-union membership doubled, from a little over four million to a little over eight million. Work stoppages and strikes became frequent in 1917–18 as the unions expressed grievances regarding prices, alcohol control, pay disputes, dilution of labour, fatigue from overtime and from Sunday work, and inadequate housing.\nThe Corn Production Act 1917 bestowed upon the Board of Agriculture the power to ensure that all land was properly cultivated, appointed a wages board to operate a new minimum wage in agriculture, and guaranteed minimum prices for wheat and oats.\nConscription put into uniform nearly every physically fit man, six million out of ten million eligible. Of these, about 750,000 died and 1.7 million were wounded. Most deaths were of young unmarried men; however, 160,000 wives lost their husbands and 300,000 children lost their fathers.\n\n\n==== Crises of 1918 ====\nIn rapid succession in spring 1918 came a series of military and political crises. The Germans, having moved troops from the Eastern Front and retrained them in new tactics, now had more soldiers on the Western Front than the Allies. Germany launched the full-scale spring offensive starting on 21 March against the British and French lines, hoping for victory on the battlefield before the American troops arrived in numbers. The Allied armies fell back 40 miles in confusion, and, facing defeat, London realised it needed more troops to fight a mobile war. Lloyd George found half a million soldiers and rushed them to France, asked American President Wilson for immediate help, and agreed to the appointment of French General Foch as commander in chief on the Western Front. He considered taking on the role of War Minister himself, but was dissuaded by the King, and instead appointed Lord Milner.\nDespite strong warnings that it was a bad idea, the War Cabinet decided to impose conscription on Ireland. The main reason was that trade unions in Britain demanded it as the price for cutting back on conscription exemptions for certain workers. Labour wanted the principle established that no one was exempt, but it did not demand that conscription actually take place in Ireland. The proposal was enacted but never enforced. The Catholic bishops for the first time entered the fray and called for open resistance to conscription. Many Irish Catholics and nationalists moved into Sinn Féin, a decisive moment marking the dominance of Irish politics by a party committed to leaving the UK altogether.\nAt one point Lloyd George unknowingly misled the House of Commons in claiming that Haig\u0027s forces were stronger at the start of 1918 than they had been a year earlier—in fact, the increase was in the number of labourers, most of them Chinese, Indians and black South Africans, and Haig had fewer infantry, holding a longer stretch of front. The Prime Minister had used incorrect information furnished by the War Department office headed by Major-General Sir Frederick Maurice. Maurice then made the spectacular public allegation that the War Cabinet had deliberately held soldiers back from the Western Front, and both Lloyd George and Law had lied to Parliament about it. Instead of going to the Prime Minister about the problem Maurice had waited and then broke King\u0027s Regulations by making a public attack. Asquith, still the Liberal Party leader, took up the allegations and called for a Parliamentary Inquiry. While Asquith\u0027s presentation was poorly done, Lloyd George vigorously defended his position, treating the debate as a vote of confidence. He won over the House with a powerful refutation of Maurice\u0027s allegations. The Liberal Party was openly split for the first time.\nMeanwhile, the German offensive stalled. By summer the Americans were sending 10,000 fresh men a day to the Western Front, a speedup made possible by leaving their equipment behind and using British and French munitions. The German army had used up its last reserves and was steadily shrinking in numbers, further weakening its resolve. The Allies launched an offensive that led to a series of successful battles and victory came on 11 November 1918.\nThat autumn Lloyd George was one of the many infected during the 1918 flu pandemic, but he survived.\n\n\n=== Postwar prime minister ===\n\nAt the end of the war Lloyd George\u0027s reputation stood at its zenith. Law, who was also from a provincial background, said \u0022He can be Prime Minister for life if he likes.\u0022 Headlines at this time declared a \u0022huge majority win\u0022 and that \u0022pacifists, even \u0027shining lights\u0027 such as Arnold Lupton, had been completely overthrown by Ramsay MacDonald and Philip Snowden\u0022.\n\n\n==== Coupon election of 1918 ====\n\nIn the \u0022Coupon election\u0022 of December 1918 he led a coalition of Conservatives and his own faction of Liberals to a landslide victory. Coalition candidates received a \u0022coalition coupon\u0022 . He did not say \u0022We shall squeeze the German lemon until the pips squeak\u0022 , but he did express that sentiment about reparations from Germany to pay the entire cost of the war, including pensions. He said that German industrial capacity \u0022will go a pretty long way\u0022. We must have \u0022the uttermost farthing\u0022, and \u0022shall search their pockets for it\u0022. As the campaign closed, he summarised his programme:\n\nTrial of the exiled Kaiser Wilhelm II;\nPunishment of those guilty of atrocities;\nFullest indemnity from Germany;\nBritain for the British, socially and industrially;\nRehabilitation of those broken in the war; and\nA happier country for all.\nThe election was fought not so much on the peace issue and what to do with Germany, although those themes played a role. More important was the voters\u0027 evaluation of Lloyd George in terms of what he had accomplished so far and what he promised for the future. His supporters emphasised that he had won the Great War. Against his strong record in social legislation, he himself called for making \u0022a country fit for heroes to live in\u0022.\nThe Coalition gained an overwhelming victory, winning 525 of the 707 seats contested; however, the Conservatives had more than two-thirds of the Coalition\u0027s seats.\nAsquith\u0027s independent Liberals were crushed, although they were still the official opposition as the two Liberal factions combined had more seats than Labour. Accounts vary about the factional allegiance of some MPs: by some accounts as few as 29 uncouponed Liberals had been elected, only 3 with any junior ministerial experience, and only 23 of them were actually opponents of the coalition. Until April 1919 the government whip was extended to all Liberal MPs and Lloyd George might easily have been elected chairman of the Liberal MPs had he been willing to antagonise his Conservative coalition partners by doing so.\n\n\n==== Paris 1919 ====\n\nLloyd George represented Britain at the Paris Peace Conference, clashing with French Prime Minister Georges Clemenceau, US President Woodrow Wilson, and Italian Prime Minister Vittorio Orlando. Unlike Clemenceau and Orlando, Lloyd George on the whole stood on the side of generosity and moderation. He did not want to utterly destroy the German economy and political system—as Clemenceau demanded—with massive reparations. The economist John Maynard Keynes looked askance at Lloyd George\u0027s economic credentials in The Economic Consequences of the Peace, and in Essays in Biography called the Prime Minister \u0022this goat-footed bard, this half-human visitor to our age from the hag-ridden magic and enchanted woods of Celtic antiquity\u0022.\nLloyd George was also responsible for the pro-German shift in the peace conditions regarding the borders of Poland. Instead of handing over Upper Silesia , and the southern part of East Prussia to Poland as was planned before, the plebiscite was organised. Danzig was organised as the Free City of Danzig. The Poles were grateful that he had saved that country from the Bolsheviks but were annoyed by his comment that they were \u0022children who gave trouble\u0022. Distrusting Foreign Office professionals, Lloyd George and his team at Paris instead relied on non-professional experts through informal networks below them. They consulted with James Headlam-Morley about Danzig. Several academic historians also were consulted. Their experiences were the basis for building up diplomatic history as a field of academic research and the emergence of the new academic discipline of international relations.\nAsked how he had done at the peace conference, Lloyd George retorted: \u0022I think I did as well as might be expected, seated as I was between Jesus Christ [Wilson] and Napoleon Bonaparte [Clemenceau].\u0022 Historian Antony Lentin evaluated his role in Paris as a major success, saying:\n\nHe was an unrivalled negotiator: on top of his brief, full of bounce, sure of himself, forceful, engaging, compelling. ... Acutely sensitive to what he divined as the motive force in his listeners, he was adept at finding the right tone and turn of phrase to divert that force in the desired direction. ... [he had] powerful combative instincts, executive drive and an indomitable determination to succeed. ... [He secured] as visible and immediate trophies ... the spoils of empire: the coveted Middle Eastern mandates, protecting the route to India and rich in oil. There were the confiscated German colonies in Africa and the South Pacific, making a reality of British rule from Cairo to the Cape and setting the far-flung bounds of Empire at their widest. ... [while being] wholly in accord with British interest in a continental balance of power.\n\n\n==== Postwar social reforms ====\nA major programme of social reform was introduced under Lloyd George in the last months of the war, and in the post-war years. The Workmen\u0027s Compensation Act 1918 allowed for compensation to be paid to men \u0022who could prove they had worked in rock which contained no less than 80% silica.\u0022 The Education Act 1918 raised the school leaving age to 14, increased the powers and duties of the Board of Education , and introduced a system of compulsory part-time continuation schools for children between the ages of 14 and 16. The Blind Persons Act 1920 provided assistance for unemployed blind people and blind persons who were in low paid employment.\nThe Housing, Town Planning, \u0026c. Act 1919 provided subsidies for house building by local authorities, and 170,000 dwellings were built under it by the end of 1922. which established, according to A. J. P. Taylor, \u0022the principle that housing was a social service\u0022. A further 30,000 houses were constructed by private enterprise with government subsidy under a second act.\nThe Land Settlement Act 1919 and Land Settlement Acts of 1919 encouraged local authorities to provide land for people to take up farming \u0022and also to provide allotments in urban areas.\u0022\nThe Rent Act 1920 was intended to safeguard working-class tenants against exorbitant rent increases, but it failed. Rent controls were continued after the war, and an \u0022out-of-work donation\u0022 was introduced for ex-servicemen and civilians.\n\n\n==== Electoral changes: suffragism ====\n\nThe Representation of the People Act 1918 greatly extended the franchise for men and gave the vote to many women over 30, and the Parliament Act 1918 enabled women to sit in the House of Commons. The Sex Disqualification Act 1919 provided that \u0022A person shall not be disqualified by sex or marriage from the exercise of any public function, or from being appointed to or holding any civil or judicial office or post, or from entering or assuming or carrying on any civil profession or vocation, or for admission to any incorporated society\u0022.\n\n\n==== Wages for workers ====\nThe Unemployment Insurance Act 1920 extended national insurance to 11 million additional workers. This was considered to be a revolutionary measure, in that it extended unemployment insurance to almost the entire labour force, whereas only certain categories of workers had been covered before. As a result of this legislation, roughly three-quarters of the British workforce were now covered by unemployment insurance.\n\nThe Agriculture Act 1920 provided for farm labourers to receive a minimum wage while the state continued to guarantee the prices of farm produce until 1921. It also provided tenant farmers with greater protection by granting them better security of tenure. In education, teachers\u0027 salaries were standardised, and more than doubled from pre-War levels, in 1921 by the Burnham Committee.\nThe Mining Industry Act 1920 placed a mandatory requirement to provide social welfare opportunities to mining communities, while the Public Health Act 1921 increased the obligation of local authorities to treat and prevent TB.\n\n\n==== Health reforms ====\nIn 1919, the government set up the Ministry of Health, a development which led to major improvements in public health in the years that followed. Whilst the Unemployed Workers\u0027 Dependants Act 1921 provided payments for the wives and dependent children of unemployed workers. The Employment of Women, Young Persons, and Children Act 1920 prohibited the employment of children below the limit of compulsory school age in railways and transport undertakings, building and engineering construction works, factories, and mines. The legislation also prohibited the employment of children in ships at sea .\n\nThe National Health Insurance Act 1920 increased insurance benefits, and eligibility for pensions was extended to more people. The means limit for pensions was raised by about two-thirds, immigrants and their wives were allowed to receive pensions after living in Britain for ten years, and the imprisonment and \u0022failure to work\u0022 disqualifications for receiving pensions were abolished. The Blind Persons Act 1920 reduced the pension age for blind people from 70 to 50.\nOld age pensions were nearly doubled , efforts were made to help returning soldiers find employment, and the Whitley Councils of employees and employers set up.\n\n\n==== Cost ====\nThe reforming efforts of the coalition government were such that, according to the historian Kenneth O. Morgan, its achievements were greater than those of the pre-war Liberal governments. However, the reform programme was substantially rolled back by the Geddes Axe, which cut public expenditure by £76 million, including substantial cuts to education, and abolished the Agricultural Wages Board.\n\n\n==== Ireland ====\nAs early as 1913 Lloyd George expressed interest in the issues surrounding the of Irish Home Rule movement. He stated that he supported \u0022...the principle of a referendum...each of the Ulster Counties is to have the option of exclusion from the Home Rule Bill\u0022. Had a referendum occurred it is quite possible that only four of Ulster\u0027s nine Counties would have voted for exclusion . During Asquith\u0027s premiership, the armed insurrection by Irish republicans, known as the Easter Rising, had taken place in Dublin during Easter Week, 1916. The government responded with harsh repression; key leaders were quickly executed. The mostly Catholic Irish nationalists then underwent a dramatic change of mood, and shifted to demand vengeance and independence.\nIn 1917, Lloyd George called the 1917–18 Irish Convention in an attempt to settle the outstanding Home Rule for Ireland issue; however, the upsurge in republican sympathies in Ireland following the Easter Rising coupled with Lloyd George\u0027s disastrous attempt to extend conscription to Ireland in April 1918 led to the landslide victory of Sinn Féin and the wipeout of the Irish Parliamentary Party at the December 1918 election. Replaced by Sinn Féin MPs, they immediately declared an Irish Republic.\nLloyd George presided over the Government of Ireland Act 1920 which partitioned Ireland into Southern Ireland and Northern Ireland in May 1921 during the Anglo-Irish War. Lloyd George famously declared of the Irish Republican Army that \u0022We have murder by the throat!\u0022 However, he soon afterwards began negotiations with IRA leaders to recognise their authority and to end a bloody conflict. Lloyd George also invited the leader of northern Irish Unionists James Craig to the negotiations but he refused to attend. Lloyd George wrote to Craig on 14 November 1921 \u0022Your proposal to leave the six counties under the Northern Parliament would stereotype a frontier based neither upon natural features nor broad geographical considerations by giving it the character of an international boundary. Partition upon these lines the majority of the Irish people will never accept, nor could we conscientiously attempt to enforce it.\u0022 ). The Anglo-Irish Treaty was signed in December 1921 with Irish leaders. The Parliament of Northern Ireland exercised Article 12 of the Treaty to opt out of the Irish Free State. The Treaty established the Irish Boundary Commission to draw a border between Northern Ireland and the rest of Ireland \u0022in accordance with the wishes of the inhabitants, so far as may be compatible with economic and geographic conditions...\u0022. Southern Ireland, representing over a fifth of the United Kingdom\u0027s territory, seceded in 1922 to form the Irish Free State. .\n\n\n==== Foreign policy crises ====\n\nIn 1921, Lloyd George successfully concluded the Anglo-Soviet Trade Agreement. Despite much effort he was unable to negotiate full diplomatic relations, as the Russians rejected all repayment of Tsarist era debts, and Conservatives in Britain grew exceedingly wary of the communist threat to European stability. Indeed, Henry Wilson, the Chief of the Imperial General Staff, worried that Lloyd George had become \u0022a traitor \u0026 a Bolshevist\u0022.\nLloyd George in 1922 decided to support Greece in a war against Turkey. This led to the Chanak Crisis when most of the Dominions rejected his policy and refused to support the proposed war.\n\n\n==== Domestic crises ====\n\nThe more conservative wing of the Unionist Party had no intention of introducing reforms, which led to three years of frustrated fighting within the coalition both between the National Liberals and the Unionists and between factions within the Conservatives themselves. Many Conservatives were angered by the granting of independence to the Irish Free State and by Edwin Montagu\u0027s moves towards limited self-government for India, while a sharp economic downturn and wave of strikes in 1921 damaged Lloyd George\u0027s credibility. The \u0022cash for patronage\u0022 scandal erupted in 1922 when it became known that Lloyd George had essentially sold peerages and lesser honours such as knighthoods, with a \u0022price list for peerages\u0022 , to raise funds for his party, via Maundy Gregory. This was not illegal at the time. The practoce was in fact well-established, and seen as a safeguard against the kind of corruption seen in France and the USA. A major attack in the House of Lords on his corruption followed, resulting in the Honours Act 1925. Other complaints were that the Cabinet contained too many Scots, too few men from Oxbridge and the great public schools, too many businessmen, and too few gentlemen.\n\n\n==== Fall from power, 1922 ====\nThe coalition was dealt its final blow in October 1922. The Conservatives felt let down by France over the Chanak Crisis, with Law telling France, \u0022We cannot act alone as the policeman of the world.\u0022 The Conservative leader, Austen Chamberlain, summoned a meeting of Conservative members of parliament at the Carlton Club to discuss their attitude to the Coalition in the forthcoming election. Chamberlain and most Conservative leaders supported Lloyd George; however, the rank and file rejected the coalition. The main attack came from Stanley Baldwin, then President of the Board of Trade, who spoke of Lloyd George as a \u0022dynamic force\u0022 who would break the Conservative Party. They sealed Lloyd George\u0027s fate on 19 October 1922 by voting in favour of the motion to end the coalition and fight the election \u0022as an independent party, with its own leader and its own programme\u0022. Lloyd George submitted his resignation to the King that afternoon.\r\n\r\n== Later political career ==\n\n\n=== Liberal reunion ===\n\nThroughout the 1920s Lloyd George remained highly visible in politics; predictions that he would return to power were common, but it never happened. He still controlled a large fund, thought to have been between £1m and £3m , from his investments in newspaper ownership and from his sale of titles.\nBefore the 1923 election, he resolved his dispute with Asquith, allowing the Liberals to run a united ticket against Stanley Baldwin\u0027s policy of protective tariffs. Baldwin both feared and despised Lloyd George, and one of his aims was to keep him out of power. He later claimed that he had adopted tariffs, which cost the Conservatives their majority, out of concern that Lloyd George was about to do so on his return from a tour of North America. Although there was press speculation at the time that Lloyd George would do so , there is no evidence that this was his intent. Asquith and Lloyd George reached agreement on 13 November 1923 and issued a joint Free Trade manifesto, followed by a more general one. Lloyd George agreed to contribute £100,000 .\nIn 1924, Lloyd George, realising that Liberal defeat was inevitable and keen to take control of the party himself, spent only £60,000.\nAt the 1924 general election, Baldwin won a clear victory. Despite having a large majority, he appointed the leading coalitionists such as Austen Chamberlain and F. E. Smith, 1st Earl of Birkenhead to senior cabinet places, to discourage any restoration of the 1916–1922 coalition.\n\n\n=== Liberal leader ===\nThe disastrous election result in 1924 left the Liberals as a weak third party in British politics behind the ascendant Labour Party, with just over 40 MPs. Although Asquith, who had again lost his seat and was created an Earl, remained Liberal leader, Lloyd George was elected chairman of the Liberal MPs by 26 votes to 7. Sir John Simon and his followers were still loyal to Asquith whilst Walter Runciman led a separate radical group within the Parliamentary Party.\nLloyd George was now mainly interested in the reform of land ownership, but had only been permitted to put a brief paragraph about it in the hastily drafted 1924 Liberal manifesto. In the autumn of 1925, despite the hostility of Charles Hobhouse, Runciman and Alfred Mond, he began an independent campaign, soon to become \u0022The Land and the Nation\u0022 . Asquith rebuked him, but was ignored; they reached an agreement in principle on 2 December, then together they presented Lloyd George\u0027s plans to the National Liberal Federation on 26 February 1926.\nThe Liberal Shadow Cabinet, including Lloyd George, unequivocally backed Baldwin\u0027s handling of the General Strike on 3 May 1926, but Lloyd George then wrote an article for the American press more sympathetic to the strikers, and did not attend the Shadow Cabinet on 10 May, sending his apologies on \u0022policy grounds\u0022. Asquith sent him a public letter rebuking him for not attending the meeting to discuss his opinions with colleagues in private. Lloyd George\u0027s letter of 10 May had not been published, making it appear that Asquith had fired the first shot, and Lloyd George sent a public reply, moderate in tone , on 25 May. In late May, the executive of the National Liberal Federation convened to plan the agenda for the following month\u0027s conference. 16 were pro-Asquith and 8 pro-Lloyd George; they planned a motion expressing confidence in Asquith, but another option was also proposed to seek Asquith\u0027s opinion first, and also general feeling of regret at having been forced to choose between Asquith and Lloyd George. Asquith then wrote another public letter stating that he regarded Lloyd George\u0027s behaviour as tantamount to resignation, the same as if a Cabinet Minister had refused to abide by the principle of collective responsibility. Twelve leading Liberals wrote in Asquith\u0027s support to The Times ; however, Lloyd George had more support in the wider party than among the grandees: the London Liberal Candidates\u0027 Association defied its officers and expressed its dismay at the split, effectively supporting Lloyd George, and on 8 June the Liberal MPs voted 20:10 urging a reconciliation. Asquith had planned to launch a fightback at the National Liberal Federation in Weston-super-Mare, but on 12 June, five days before the conference was due to start, he suffered a stroke which put him out of action for three months. Lloyd George was given a rapturous welcome. Asquith resigned as party leader in October 1926, dying in 1928.\n\nAs Liberal leader at last, Lloyd George used his fund to finance candidates and put forward innovative ideas for public works to reduce unemployment, detailed in works such as Britain\u0027s Industrial Future , and We Can Conquer Unemployment . Charles Masterman, a member of the commission which prepared Britain\u0027s Industrial Future, wrote: \u0022When Lloyd George came back to the party, ideas came back to the party\u0022. Lloyd George was helped by John Maynard Keynes to write We Can Conquer Unemployment, setting out economic policies to solve unemployment. In 1927, Lloyd George gave £300,000 and an annual grant of between £30,000 and £40,000 for the operations of the Liberal headquarters. He also gave £2,000 per annum to the parliamentary party until 1931. Even with the money, the results at the 1929 general election were disappointing. The Liberals increased their support only to 59 seats, while Labour became the largest party for the first time. Once again, the Liberals ended up supporting a minority Labour government. In 1929, Lloyd George became Father of the House , an honorific position without power.\n\n\n=== Marginalised ===\n\nIn 1931, an illness prevented Lloyd George\u0027s joining the National Government when it was formed. When the National Government later called a general election he tried to pull the Liberal Party out of it, but succeeded in taking only a few followers, most of whom were related to him; the main Liberal Party remained in the coalition for a year longer, under the leadership of Sir Herbert Samuel. By the 1930s Lloyd George was on the margins of British politics, although still intermittently in the public eye and publishing his War Memoirs.\n\n\n=== Lloyd George\u0027s \u0022New Deal\u0022 ===\n\nIn January 1935 Lloyd George announced a programme of economic reform, called \u0022Lloyd George\u0027s New Deal\u0022 after the American New Deal. This Keynesian economic programme was essentially the same as that of 1929. Ramsay MacDonald requested that he put his case before the Cabinet. In March, Lloyd George submitted a 100-page memorandum that was cross-examined between April and June in ten meetings of the Cabinet\u0027s sub-committee; however, the programme did not find favour; two-thirds of Conservative MPs were against Lloyd George joining the National government, and some Cabinet members would have resigned if he had joined.\n\n\n=== Support for Nazi Germany ===\nLloyd George was consistently pro-German after 1923, in part due to his growing conviction that Germany had been treated unfairly at Versailles. He supported German demands for territorial concessions and recognition of its \u0022great power\u0022 status; he paid much less attention to the security concerns of France, Poland, Czechoslovakia, and Belgium.\nIn a speech in 1933, he warned that if Adolf Hitler were overthrown, communism would replace him in Germany. In August 1934, he insisted Germany could not wage war and assured European nations that there would be no risk of war during the next ten years. In September 1936, he visited Germany to talk with Hitler. Hitler said he was pleased to have met \u0022the man who won the war\u0022; Lloyd George was moved, and called Hitler \u0022the greatest living German\u0022.\nLloyd George also visited Germany\u0027s public works programmes and was impressed. On his return to Britain, he wrote an article for the Daily Express praising Hitler and stating: \u0022The Germans have definitely made up their minds never to quarrel with us again.\u0022 He believed Hitler was \u0022the George Washington of Germany\u0022; that he was rearming Germany for defence and not for offensive war; that a war between Germany and the Soviet Union would not happen for at least ten years; that Hitler admired the British and wanted their friendship but that there was no British leadership to exploit this. However, by 1937, Lloyd George\u0027s distaste for Neville Chamberlain led him to disavow Chamberlain\u0027s appeasement policies.\n\n\n=== Final years ===\nIn the last important parliamentary intervention of his career, which occurred during the crucial Norway Debate of May 1940, Lloyd George made a powerful speech that helped to undermine Chamberlain as prime minister and to pave the way for the ascendancy of Churchill. Churchill offered Lloyd George the agriculture portfolio in his Cabinet, initially subject to Chamberlain\u0027s approval, but this condition and, once Chamberlain had withdrawn his opposition, Lloyd George\u0027s unwillingness to sit alongside Chamberlain, led him to refuse.\n\nAs we approached No 10 LG said \u0027I won\u0027t go in with Neville\u0027 \nLloyd George also thought that Britain\u0027s chances in the war were dim, and he remarked to his secretary: \u0022I shall wait until Winston is bust.\u0022\n\nA pessimistic speech by Lloyd George on 7 May 1941 led Churchill to compare him with Philippe Pétain who had become a Nazi puppet. He cast his last vote in the Commons on 18 February 1943 as one of the 121 MPs condemning the Government for its failure to back the Beveridge Report.\nHe continued to attend Castle Street Baptist Chapel in London, but by 1944 he was weakening rapidly and his voice failing. He was still an MP but, concerned about his health and the wartime social changes in the constituency, he feared Carnarvon Boroughs might go Conservative at the next election.\nIt was announced in the 1945 New Year Honours that Lloyd George would be made an earl, which he was as Earl Lloyd-George of Dwyfor, and Viscount Gwynedd, of Dwyfor in the County of Caernarvonshire on 12 February 1945; however, he did not live long enough to take his seat in the House of Lords.\n\n\n=== Death ===\nLloyd George died of cancer at the age of 82 on 26 March 1945, with his wife Frances and his daughter Megan at his bedside. Four days later, on Good Friday, he was buried beside the river Dwyfor in Llanystumdwy. A boulder marks the grave; there is no inscription; however, a monument designed by the architect Sir Clough Williams-Ellis was subsequently erected around the grave, bearing an englyn engraved on slate in his memory composed by his nephew W. R. P. George. Nearby stands the Lloyd George Museum, also designed by Williams-Ellis and opened in 1963.\r\n\r\n== Assessment ==\nLloyd George has often been ranked highly among modern British prime ministers, but his legacy remains complicated and controversial. Scholars have praised his welfare reforms and his efforts to mobilise and lead Britain to victory during the First World War, but he has also been criticised for adopting a \u0022presidential\u0022 style of leadership, for distrusting his own commanders during the war, and for his strategic failures and involvement in various scandals. His legacies over Ireland and the Treaty of Versailles are also controversial; he was an ardent Zionist, who expressed antisemitic views. In the post-war period he arguably alienated many of the workers he had earlier championed, helping to swell Labour\u0027s popular support at the Liberals\u0027 expense .\n\nHistorian Martin Pugh in The Oxford Companion to British History argues that:[Lloyd George] made a greater impact on British public life than any other 20th-cent. statesman. He laid the foundations of what later became the welfare state, and put a progressive income tax system at the centre of government finance. He also left his mark on the system of government by enlarging the scope of the prime minister\u0027s role. He was acclaimed, not without reason, as the \u0027Man Who Won the War\u0027. ... he was blamed by many Liberals for destroying their party in 1918, hated in the Labour movement for his handling of industrial issues after 1918, and disparaged by Conservatives for his radicalism.\nGeorge Riddell, 1st Baron Riddell, a wealthy newspaper publisher, was a close confidant and financial supporter of Lloyd George from 1908 to 1922. During Lloyd George\u0027s first year as prime minister, in summer 1917, Riddell assessed his personality in his diary:His energy, capacity for work, and power of recuperation are remarkable. He has an extraordinary memory, imagination, and the art of getting at the root of a matter. ... He is not afraid of responsibility, and has no respect for tradition or convention. He is always ready to examine, scrap or revise established theories and practices. These qualities give him unlimited confidence in himself. ... He is one of the craftiest of men, and his extraordinary charm of manner not only wins him friends, but does much to soften the asperities of his opponents and enemies. He is full of humour and a born actor. ... He has an instinctive power of divining the thoughts and intentions of people with whom he is conversing ... His chief defects are: Lack of appreciation of existing institutions, organisations, and stolid, dull people ... their ways are not his ways and their methods are not his methods. Fondness for a grandiose scheme in preference to an attempt to improve existing machinery. Disregard of difficulties in carrying out big projects ... he is not a man of detail.\nIn 2007, historian John Shepherd wrote in History Today:\nIn any poll of modern historians Winston Churchill and David Lloyd George would emerge as the two most renowned prime ministers during the past century.\r\n\r\n== Family ==\n\n\n=== Margaret and children ===\n\nHe had five children by his first wife, Dame Margaret Lloyd George:\n\nRichard Lloyd George, 2nd Earl Lloyd-George of Dwyfor , army officer\nMair Eluned Lloyd George Olwen Elizabeth Lloyd George , humanitarian and writer, later Dame Olwen Carey Evans\nGwilym Lloyd George, 1st Viscount Tenby , National Liberal politician\nMegan Arvon Lloyd George , Labour politician\nDespite his long-term affair with Frances Stevenson, he remained married to Margaret, and remained fond of her until her death on 20 January 1941; Lloyd George was deeply upset by the fact that bad weather prevented him from being with her when she died.\nGwilym and Megan both followed their father into politics and were elected Members of Parliament. They were politically faithful to their father throughout his life, but after 1945 each drifted away from the Liberal Party, Gwilym finishing his career as Home Secretary under the Conservatives in the 1950s and Megan becoming a Labour MP in 1957.\n\n\n=== Frances ===\nLloyd George met Frances Stevenson in 1910; she worked for him first as a teacher for Megan in 1911; she became his secretary and, from early 1913, his long-term mistress. Lloyd George may have been the father of Stevenson\u0027s daughter Jennifer , born long before they wed, but it is more likely that she was the daughter of Thomas Tweed, with whom Stevenson had had an affair. To the disapproval of his children he finally married Frances in October 1943; he was aged 80 at the time.\nFrances was the first Countess Lloyd-George, and is now largely remembered for her diaries, which dealt with the great issues, and statesmen, of Lloyd George\u0027s heyday. A volume of their letters, My Darling Pussy, has also been published; Lloyd George\u0027s nickname for Frances referred to her gentle personality.\n\n\n=== Womanising ===\nLloyd George had a considerable reputation as a womaniser, including an alleged long affair with the wife of a Parliamentary colleague in the 1890s. In a letter to his wife, Lloyd George wrote of his philandering, \u0022You say I have my weakness. So has anyone that ever lived \u0026 the greater the man the greater the weakness. It is only insipid, wishy washy fellows that have no weaknesses\u0022. His biographer Travis Crosbie comments that although he clearly enjoyed the company of women much of the information is based on hearsay rather than actual evidence and that his reputation may well be considerably exaggerated.\n\n\n=== Descendants ===\nThe Canadian historian Margaret MacMillan, who detailed Lloyd George\u0027s role at the 1919 Peace Conference in her book, Peacemakers: The Paris Peace Conference of 1919 and Its Attempt to End War, is his great-granddaughter. The British television historian and presenter Dan Snow is a great-great-grandson through his mother, Canadian-born Ann MacMillan , a long-time CBC reporter based in London and sister of Margaret MacMillan.\r\n\r\n== Honours ==\n\n\n=== Peerage ===\n Earl Lloyd-George of Dwyfor and Viscount Gwynedd of Dwyfor in the county of Caernarvonshire .\n\n\n=== Arms ===\n\n\n=== Decorations ===\n Order of Merit 1919\n Knight of Grace, Order of Saint John; Chancellor of the Welsh Priory from 1918 and Prior of Wales from 1943.\n Grand Cordon of the Legion of Honour 1920\n Grand Cordon of the Order of Leopold Grand Cross of the Order of St Maurice and St Lazarus Cross of Liberty  for civilian service, 29 April 1925\n\n\n=== Academic ===\nOxford University – DCL 1908\nFellow of Jesus College 1910\nUniversity of Wales – LLD 1908\nGlasgow University – LLD 1917\nUniversity of Edinburgh – LLD 1918\nRector – 1920\nDurham University – DCL 1919\nSheffield University – DLitt 1919\nCambridge University – LLD 1920\nBirmingham University – LLD 1921\nLeeds University – LLD 1922\n\n\n=== Freedoms ===\nLloyd George was made Honorary Freeman of the following cities and towns:\n\nCardiff – 24 June 1908\nCity of London – 1908\nMaster of the Worshipful Company of Curriers Birmingham, Manchester – 1908\nBlackpool – 1918\nNeath – 1920\nCriccieth – July 1919.\nBristol, York, Glasgow, Barnsley – 1921\nLeeds, Aberystwyth – 1922\nSalford – October 1922\nMontreal, Brecon, Llandovery, Carmarthen, Llanelli, Swansea – 1923\nPortsmouth – 1924\n\n\n=== Namesakes ===\nLloyd George Avenue is an extension of the A470 road, connecting Central Cardiff to Cardiff Bay.\nMount Lloyd George in the Northern Rocky Mountains of British Columbia, Canada was named after Lloyd George during the First World War, and still retains the name.\nKibbutz Ramat David in the Jezreel Valley in northern Israel and the adjacent Ramat David Airbase are named after him.\nDavid Lloyd George Elementary School in Vancouver was named after Lloyd George in 1921.\nDavid Lloyd George, a Fairlie locomotive built in 1992 on the Ffestiniog Railway, is named after him. Lloyd George was once a frequent passenger on the railway.\r\n\r\n== Cultural depictions ==\r\n\r\n== Selected works ==\nThe People\u0027s Budget, Hodder \u0026 Stoughton, 1909\nThe Lords, The Land and the People, Hodder \u0026 Stoughton, 1909\nThe People\u0027s Will, Hodder \u0026 Stoughton, 1910\nBetter Times, Hodder \u0026 Stoughton, 1910\nThe People\u0027s Insurance, Hodder \u0026 Stoughton, 1912\nThrough Terror to Triumph , Hodder and Stoughton, 1915\nThe Great Crusade , Hodder and Stoughton, 1918\nIs It Peace?, Hodder and Stoughton, 1923\nWhere Are We Going?, George H. Doran Company, 1923 Slings and Arrows , Cassell and Company, Ltd, 1929\nHow to Tackle Unemployment , The Press Printers Ltd, 1930\nThe Truth About Reparations and War-Debts, William Heinemann Ltd, 1932\nWar Memoirs, 6 volumes, Ivor Nicholson and Watson, 1933 – 1936: re-published in 2 volumes by Odhams Press, 1938\nOrganizing Prosperity, Ivor Nicholson and Watson, 1935\nThe Truth About the Peace Treaties Volume I, Victor Gollancz Ltd, 1938\nThe Truth About the Peace Treaties Volume II, Victor Gollancz Ltd, 1938\nPublished in the US as Memoirs of the Peace Conference, 2 volumes, Yale University Press, 1939",
  "imageNames": [
    "2211-lloyd-george.jpg",
    "Big_four.jpg",
    "ChurchillGeorge0001.jpg",
    "ClemenceauLloydGeorgeYOrlando.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1863,
  "end": 1945,
  "categoryId": "arweinwyr",
  "id": "lloyd-george",
  "label": "David Lloyd George"
}