{
  "wikiSummary": "The Reports of the Commissioners of Inquiry into the State of Education in Wales, commonly referred to in Wales as  \u0022The Treason of the Blue Books\u0022 or \u0022The Treachery of the Blue Books\u0022 or just the \u0022Blue Books\u0022 is a three-part publication by the British government in 1847 about education in Wales. Commissioned in response to government concern over unrest in the region, the publication caused uproar in Wales, where many saw it as disparaging the Welsh, as it was particularly scathing in its view of the nonconformity, the Welsh language  and the morality of the Welsh people in general. The Welsh sobriquet Brad y Llyfrau Gleision was from the name of a play satirising the reports, and those who gave evidence to the inquiry, which was published seven years after the reports. The Welsh Academy Encyclopaedia of Wales says that the name \u0022took hold of the public imagination to such an extent that ever since the report has been known by that name\u0022.\nAccording to the author and business academic, Simon Brooks, the Blue Books are regarded today as \u0022colonial diktat\u0022, and are \u0022the most important ideological intervention by the British state in Wales in the 19th century.\u0022 However the inquiry did not lead to any governmental action and the hostile reaction was mainly aimed at the comments about Welsh morality.   One of the many legacies of the reports that prominent Welsh nationalist activist Saunders Lewis opined in The Fate of the Language in 1962 was that Wales embraced bilingualism, through the requirement to learn English as a second language.",
  "wikiArticle": "The Reports of the Commissioners of Inquiry into the State of Education in Wales, commonly referred to in Wales as  \u0022The Treason of the Blue Books\u0022 or \u0022The Treachery of the Blue Books\u0022 or just the \u0022Blue Books\u0022 is a three-part publication by the British government in 1847 about education in Wales. Commissioned in response to government concern over unrest in the region, the publication caused uproar in Wales, where many saw it as disparaging the Welsh, as it was particularly scathing in its view of the nonconformity, the Welsh language  and the morality of the Welsh people in general. The Welsh sobriquet Brad y Llyfrau Gleision was from the name of a play satirising the reports, and those who gave evidence to the inquiry, which was published seven years after the reports. The Welsh Academy Encyclopaedia of Wales says that the name \u0022took hold of the public imagination to such an extent that ever since the report has been known by that name\u0022.\nAccording to the author and business academic, Simon Brooks, the Blue Books are regarded today as \u0022colonial diktat\u0022, and are \u0022the most important ideological intervention by the British state in Wales in the 19th century.\u0022 However the inquiry did not lead to any governmental action and the hostile reaction was mainly aimed at the comments about Welsh morality.   One of the many legacies of the reports that prominent Welsh nationalist activist Saunders Lewis opined in The Fate of the Language in 1962 was that Wales embraced bilingualism, through the requirement to learn English as a second language.\r\n\r\n== Background ==\nDuring the second quarter of the 19th century there was much public unrest in Wales and this persuaded the British Government that the root causes of this needed to be understood. There had been riots in Tredegar and Merthyr Tydfil and other places, trouble related to land enclosures in Ceredigion, the Rebecca Riots and the Chartist march on Newport. As was the case throughout England and Wales at the time, the view was held that the solution was pedagogical, at all levels of society . The government establishment assumed, even before the inquiry took place, that this would be mainly in the English language, and thus would require trained teachers to be provided.\nAt the time of the report education was not compulsory and schools were largely provided and run by religious institutions, charities and private ventures. In 1833 the government had started to contribute towards the cost of erecting both National Society and British Schools; at the same time, the Church of England wanted to control education. In 1843, after strong protests against it, Robert Peel\u0027s Conservative government abandoned a bill that would have established schools for the poor, and ensured that they were run by Anglicans. The reaction by Nonconformists was fierce, indeed, for many, state interference into education was dangerous and a form of oppression.\nThe majority of people in Wales at that time spoke only Welsh. Cardiff, the industrial Valleys and the coalfields of the North-east were bilingual. The three commissioners sent to Wales were English monoglots, who \u0027knew nothing about the Welsh language, nonconformity or elementary education\u0027. The report exaggerated the weaknesses of the Welsh education system, according to historian John Davies in A History of Wales \u0027because of the ignorance and the prejudice of the Commissioners. Wales was alien to them, and they had no experience of teaching working-class children\u0027.\nAccording to academic and author Brooks, who is a member of Plaid Cymru, \u0022the Welsh-language community was so bereft of rights that it was used by politicians in central Europe as an example of linguistic subjugation.\u0022\r\n\r\n== Inquiry ==\nThe public inquiry was commissioned as a result of pressure from William Williams, Radical MP for Coventry, who was himself a Welshman by birth and Welsh-speaking, and was concerned about the state of education in Wales. The secretary of the government\u0027s Committee of the Privy Council on Education at the time was James Kay-Shuttleworth, a man who held the view that the solution to the poor conditions suffered by labouring classes lay in improved education. Kay-Shuttleworth\u0027s guidelines on selecting the commissioners to conduct the inquiry was that they were to \u0022examine the whole question with impartiality\u0022, be \u0022laymen of the Church of England\u0022, \u0022accustomed to statistical inquiries\u0022, and \u0022capable of analysing the opinions on social, political and religious questions which may be presented to them, and of diffusing juster views among all classes\u0022. The commissioners appointed by the Privy Council\u0027s committee on education, were three young English law graduates; Ralph Lingen, Jelinger C. Symons, and Henry R. Vaughan Johnson. The commissioners visited every part of Wales during 1846, collecting evidence and statistics. They spoke no Welsh, but it was generally the army of Welsh-speaking assistant commissioners, who were also appointed, who visited the schools, villages, and towns. Schools attended by children from the higher and middle classes were out of scope of the inquiry, so were not included in the survey. The evidence collected from Anglican witnesses was treated seriously whilst that from Nonconformists may have been ignored. This was a time when Wales was a stronghold of Nonconformism.\r\n\r\n== Report ==\n\nThe work was completed in 1847 and printed in November of that year in three large blue-covered volumes . The full title was:\n\nReports of the commissioners of inquiry into the state of education in Wales: appointed by the Committee of council on education, in pursuance of proceedings in the House of commons, on the motion of Mr. Williams, of March 10, 1846, for an address to the Queen, praying Her Majesty to direct an inquiry to be made into the state of education in the principality of Wales, and especially into the means afforded to the labouring classes of acquiring a knowledge of the English language.\nSunday Schools\nThe report acknowledged that the only schools in most of Wales were the Sunday Schools; in R W Lingen\u0027s region, for example, 30,000 pupils attended day school, whilst 80,000 attended Sunday school.\nSchools\nThe report found that \u0022Welsh parents [had already] endorsed an English-language future\u0022; that English was already being taught in schools; and that the primary function of the existing Welsh schools was the teaching of English. The report was detailed and its authors criticised several sectors of society, including the gentry, clergy, and capitalists for their lack of interest in providing schools. They concluded that schools in Wales were extremely inadequate, often with teachers speaking only English and using only English textbooks in areas where the children spoke only Welsh, and that Welsh-speakers had to rely on the Nonconformist Sunday Schools to acquire literacy. They also said that amongst the causes of this were the use of the Welsh language and nonconformity.\nSociety\n\nIt is rarely observed that the commissioners complimented the Welsh on their hunger for education, and noted the sacrifices many were prepared to make to acquire it, the intelligence they brought to bear on theological matters, bred in Sunday schools, and their quickness in mathematics.\nThe report was damning of the Welsh people, and \u0022mildly pornographic in parts\u0022 ,characterising them as dirty, ignorant, lazy, and immoral.\nThe commissioners often simply reported verbatim the prejudiced opinions of landowners and local Anglican clergy, jealous of the successes of the chapels. The more bilious editorial attacks on Welsh culture mostly emanated from Commissioner Lingen and others who worked with him. They often asked complicated questions, according to the historian John Davies, and relied on bad translations, and misinterpreted the pupils\u0027 answers.\n\n\n=== Statistics ===\nThese do not include Sunday schools or schools for the higher and middle classes.\nThe report provided a breakdown of the 1,657 schools it surveyed by the language used for teaching.\n\nNotes:\n\nNorth Wales: Anglesey, Caernarfon, Denbigh, Flint, Merioneth and Montgomery.\nCentral Wales: Brecon, Cardigan and Radnor.\nSouth Wales: Glamorgan, Carmarthen and Pembroke.\nWith the exception of Monmouth the report provides a breakdown of the different types of schools in Wales.\n\nThe government did not contribute anything to the running of costs of schools in Wales until the decision in late 1846 to start funding apprentice teachers and reward school masters who trained them. Until that time schools had to rely solely on school fees and charitable donations.\n\nNotes:\n\nSome schools were inspected by more than one group of inspectors so the number of inspections can exceed the number of schools.\nCommittee: Committee, Trustees, Governors or Guardians\nPatron: Patron or Promotor\nInspector: Government inspectors \u0026 inspectors employed by Mrs Bevan Schools\r\n\r\n== Reaction ==\nThe report\u0027s publication resulted in a furious reaction in Wales which lasted for years. The clerics of the Established Church were considered as internal enemies. Staunch Anglicans refuted the report, next came the satirical attacks and statistically-based analytical challenge of the facts from Evan Jones , a Nonconformist journalist.\n\u0022Eloquent speeches\u0022 by Nonconformists such as Henry Richard and the essays of Ieuan Gwynedd as well as angry nationalistic responses came from editors of the Welsh journals, particularly the \u0027incisive articles\u0027 by Lewis Edwards in Y Traethodydd and David Rees in Y Diwygiwr. Generally speaking, the historian John Davies suggested that the chapel people were the only true Welsh, and that Welshness was synonymous with Nonconformity.\nAs time passed, Wales saw campaign after campaign against wantonness, drunkenness etc, and accepted that reform was needed. In an apparent attempt to turn the attacks to the advantage of the Nonconformists, Jones suggested that the Welsh nation had been unjustly condemned on religious rather than nationalistic grounds. Radical leaders led mass meetings to protest against the defamations in the reports.\n\n\n=== The play ===\nSeven years after the report was published, the poet Robert Jones Derfel published a play, Brad y Llyfrau Gleision . The play satirised the government commissioners and their Welsh witnesses. According to Phil Carradice, in his book Snapshots of Welsh History, \u0022the play opens in Hell where the Devil decides that the Welsh people are too good and too godly and are becoming more godly by the hour thanks to the influence of non-conformity. He promptly hatches a plan to bring down this pure and godly people\u0022. A summary of the play on the website of the National Library of Wales describes how the \u0022Treason\u0022 in the play is that committed by the Welsh church goers and clergymen and it says that Derfel, and others, \u0022thought that their evidence enhanced and even fed The Blue Books\u0027 anti-Welsh judgements\u0022. The play so gripped the imagination of the Welsh public, that the reports have been known in Wales by that sobriquet since then. The play was published by Isaac Clarke in Ruthin.\r\n\r\n== Legacy ==\nThe Books remain an invaluable, although slanted, source of information on mid-19th century Welsh society.\nSaunders Lewis, in his BBC address Tynged yr Iaith , maintained that the Blue Books were for Welsh history \u0022the most important nineteenth-century historical documents we possess\u0022 as their effect was to turn Wales into a more bilingual country, through the requirement to learn English as a second language. Such a judgement also reflects the fact that the publication of the reports, and the controversy that followed, was the catalyst for a much greater level of nonconformist involvement in the politics of Wales than hitherto. Critics such as Evan Jones , William Rees , Henry Richard, Thomas Price and Sir Thomas Phillips gained wide publicity for their trenchant criticisms of the reports. Over time these criticisms evolved into an organised political action, which culminated at the general election of 1868.",
  "imageNames": [
    "Blue_Books_prt_2_no.9_p.66_-_Evils_of_the_Welsh_Language.gif"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1847,
  "categoryId": "cymdeithasol",
  "id": "llyfrau-gleision",
  "label": "Blue books"
}