{
  "wikiSummary": "Llywelyn ap Gruffudd , also known as Llywelyn II and Llywelyn the Last , was Prince of Gwynedd, and later was recognised as the Prince of Wales from 1258 until his death at Cilmeri in 1282. Llywelyn was the son of Gruffudd ap Llywelyn ap Iorwerth and grandson of Llywelyn ab Iorwerth , and he was one of the last native and independent princes of Wales before its conquest by Edward I of England and English rule in Wales that followed, until Owain Glyndŵr held the title during his rebellion of 1400–1415.",
  "wikiArticle": "Llywelyn ap Gruffudd , also known as Llywelyn II and Llywelyn the Last , was Prince of Gwynedd, and later was recognised as the Prince of Wales from 1258 until his death at Cilmeri in 1282. Llywelyn was the son of Gruffudd ap Llywelyn ap Iorwerth and grandson of Llywelyn ab Iorwerth , and he was one of the last native and independent princes of Wales before its conquest by Edward I of England and English rule in Wales that followed, until Owain Glyndŵr held the title during his rebellion of 1400–1415.\r\n\r\n== Genealogy and early life ==\nLlywelyn was the second of the four sons of Gruffudd ap Llywelyn ap Iorwerth, the eldest son of Llywelyn ab Iorwerth, and Senana ferch Caradog, the daughter of Caradoc ap Thomas ap Rhodri, Lord of Anglesey.\nThe eldest was Owain Goch ap Gruffudd and there were two younger brothers, Dafydd ap Gruffydd and Rhodri ap Gruffudd. Llywelyn is thought to have been born around 1222 or 1223. He is first heard of holding lands in the Vale of Clwyd around 1244.\nFollowing his grandfather\u0027s death in 1240, Llywelyn\u0027s uncle, Dafydd ap Llywelyn , succeeded him as ruler of Gwynedd. At this time, Llywelyn went on crusade with Richard of Cornwall, brother of Henry III of England.\nLlywelyn\u0027s father, Gruffudd , and his brother, Owain, were initially kept prisoner by Dafydd, then transferred into the custody of King Henry III of England. Gruffudd died in 1244 from a fall while trying to escape from his cell at the top of the Tower of London. The window from which he attempted to escape the Tower was bricked up and can still be seen to this day. King Henry could no longer use Gruffudd against him, war broke out between Dafydd II and King Henry in 1245. Llywelyn supported his uncle in the savage fighting that followed. Owain, meanwhile, was freed by Henry III after his father\u0027s death and was given a portion of Snowdonia by Henry at the treaty of Woodstock in 1247.\r\n\r\n== Early reign ==\n\n\n=== Gwynedd ===\n\nLlywelyn and Owain came to terms with King Henry III and in 1247 signed the Treaty of Woodstock at Woodstock Palace. The terms they were forced to accept restricted them to the west of Conwy around Snowdonia and Anglesey, which was divided between them. The other half of Gwynedd east of Conwy known as the Perfeddwlad was taken over by King Henry.\nWhen Dafydd ap Gruffydd came of age, King Henry accepted his homage and announced his intention to give him part of the already reduced Gwynedd. Llywelyn refused to accept this and Owain and Dafydd formed an alliance against him. This led to the Battle of Bryn Derwin in June 1255. Llywelyn defeated Owain and Dafydd and captured them, thereby becoming the sole ruler of Gwynedd Uwch Conwy. Llywelyn now looked to expand his area of control. The population of Gwynedd Is Conwy resented English rule. This area, also known as \u0022Perfeddwlad\u0022 had been given by King Henry to his son Edward and during the summer of 1256, he visited the area but failed to deal with grievances against the rule of his officers. An appeal was made to Llywelyn, who, that November, crossed the River Conwy with an army, accompanied by his brother, Dafydd, whom he had released from prison. By early December, Llywelyn controlled all of Gwynedd Is Conwy, apart from the royal castle at Dyserth, as a reward for his support and dispossessing his brother-in-law, Rhys Fychan, who supported the king. An English army led by Stephen Bauzan invaded to try to restore Rhys Fychan but was decisively defeated by Welsh forces at the Battle of Cadfan in June 1257, with Rhys having previously slipped away to make his peace with Llywelyn.\n\n\n=== All of Wales ===\nDuring 1257, Llywelyn aggressively pursued his interests and gained control of lands in Gwrtheyrnion, driving out his cousin, the Anglo-Norman, Roger Mortimer. Then to Powys, which affected his fellow Welshman, Gwenwynwyn, and Deheubarth in South Wales, helping his kin against Norman control going as far as the Bristol Channel, leaving a trail of destruction during the time of Lent. Despite liberating his fellow Welsh folk, some would return to siding with the English upon his departure. The English retaliated by mobilising a force from Scotland to Deganwy in Wales but did not cross into Conwy, which was officially Llywelyn\u0027s Welsh territory. Henry III waited for an Irish naval force to attack on land from the west to corner Llywelyn, however, his force never arrived. The acts of aggression were followed by a peace truce for 1258, of which the Marcher Lords, did not completely abide by.\nThe leader of Deheubarth, Rhys Fychan now accepted Llywelyn as overlord, but this caused problems for Llywelyn, as Rhys\u0027s lands had already been given to Maredudd. Llywelyn restored his lands to Rhys, but the king\u0027s envoys approached Maredudd and offered him Rhys\u0027s lands if he would change sides. Maredudd paid homage to Henry in late 1257. After the betrayal, in 1259, Llywelyn jailed Maredudd until Christmas in Criccieth Castle. Maredudd was released only for him to surrender a son as hostage, it was then Dinefwr became a vassal kingdom of Gwynedd.\nIn early 1258, Llywelyn was using the title Prince of Wales, first used in an agreement between Llywelyn and his supporters and the Scottish nobility associated with the Comyn family. The English Crown refused to recognise this title however, and, in 1263, Llywelyn\u0027s brother, Dafydd was hostile against the Prince and submitted himself to King Henry.\nThen in January 1260, Llywelyn pursued his interests internally by dislodging Roger Mortimer of Buellt. This would be an act of war which would be followed by an English decree which was summoned in Oxford on 1 August. Armies assembled at Shrewsbury and Chester with the sole purpose of removing Llywelyn from power. However, the English could not come to an agreement in government over the matter, and a truce was enacted again for a further 2 years. After 2 years the English continued castle building which caused a revolt from the Welsh, who in turn requested and were assisted by Llywelyn in defending their lands in Maelienydd. After, Llywelyn continued his expansion into South Wales to the Lordship of Brecon, where he received fealty from the Welsh who too ousted their Anglo-Norman Marcher Lord Mortimer. This success brought him to the attention of the Montfort family, which would start a new era for Gwynedd and Llywelyn. The change in territory forced Edward I to return to Wales for the first time since 1254.\nOn 12 December 1263, in the commote of Ystumanner, Gruffydd ap Gwenwynwyn did homage and swore fealty to Llywelyn. In return he was made a vassal lord and the lands taken from him by Llywelyn about six years earlier were restored to him.\r\n\r\n== Supremacy in Wales ==\n\nLlywelyn\u0027s interests were now not solely excluded to Wales. In England, Simon de Montfort defeated the king\u0027s supporters at the Battle of Lewes in 1264 , capturing the king and Lord Edward. Llywelyn began negotiations with de Montfort, and in 1265, offered him 25,000 marks in exchange for a permanent peace, 5,000 of which immediately and then 3,000 a year thereafter. The Treaty of Pipton, 22 June 1265, established an alliance between Llywelyn and de Montfort, although Pope Clement IV warned Llywelyn against allying himself with the excommunicated Montfort. As well as the rule of the whole Principality, Llywelyn was offered the castles of Maud, Hawarden, Ellesmere and Montgomery. Thus, Llywelyn\u0027s right to rule the Principality of Wales as the hereditary Prince of Wales would be acknowledged. De Montfort was to die at the Battle of Evesham in 1265, a battle in which Llywelyn took no part. \nAfter Simon de Montfort\u0027s death, Llywelyn launched a campaign in order to rapidly gain a bargaining position before King Henry had fully recovered. In 1265, he routed the combined armies of Hamo le Strange and Maurice FitzGerald in North Wales. Llywelyn then moved on to Montgomery, and routed Roger Mortimer\u0027s army. With these victories and the backing of the papal legate, Ottobuono, Llywelyn opened negotiations with the king and was eventually recognised as Prince of Wales by King Henry in the Treaty of Montgomery in 1267. All of the Welsh princes submitted to Llywelyn II except for Maredudd ap Rhys Gryg. For this recognition he would have to pay the English crown 24,000 marks in installments, this agreement was confirmed by the papacy in Rome. If he wished, Llywelyn could purchase the homage of the one outstanding native prince –  Maredudd ap Rhys of Deheubarth – for 5,000 marks. However, Llywelyn\u0027s territorial ambitions gradually made him unpopular with some minor Welsh leaders, particularly the princes of South Wales.\nThe Treaty of Montgomery marked the high point of Llywelyn\u0027s power. Problems began arising soon afterward, initially a dispute with Gilbert de Clare concerning the allegiance of a Welsh nobleman holding lands in Glamorgan. Gilbert built Caerphilly Castle in response to this. King Henry sent a bishop to take possession of the castle while the dispute was resolved but when Gilbert regained the castle by trickery, the king was unable to do anything about it.\nFollowing the death of King Henry in late 1272, with the new King Edward I of England away from the kingdom on a crusade, the rule fell to three men. One of them, Roger Mortimer was one of Llywelyn\u0027s rivals in the marches. When Humphrey de Bohun tried to take back Brycheiniog, which was granted to Llywelyn by the Treaty of Montgomery, Mortimer supported de Bohun. Llywelyn was also finding it difficult to raise the annual sums required under the terms of this treaty and ceased making payments.\nIn early 1274, there was a plot by Llywelyn\u0027s brother, Dafydd, and Gruffydd ap Gwenwynwyn of Powys Wenwynwyn and his son, Owain, to kill Llywelyn. Dafydd was with Llywelyn at the time, and it was arranged that Owain would come with armed men on 2 February to carry out the assassination; however, he was prevented by a snowstorm. Llywelyn did not discover the full details of the plot until Owain confessed to the Bishop of Bangor. He said that the intention had been to make Dafydd prince of Gwynedd and that Dafydd would reward Gruffydd with lands. Dafydd and Gruffydd fled to England where they were maintained by the king and carried out raids on Llywelyn\u0027s lands, increasing Llywelyn\u0027s resentment. When Edward called Llywelyn to Chester in 1275 to pay homage, Llywelyn refused to attend.\nLlywelyn also made an enemy of King Edward by continuing to ally himself with the family of Simon de Montfort, even though their power was now greatly reduced. Llywelyn sought to marry Eleanor de Montfort, born c. 1258, Simon de Montfort\u0027s daughter. They were married by proxy in 1275, but King Edward took exception to the marriage, in part because Eleanor was his first cousin: her mother was Eleanor of England, daughter of King John and princess of the House of Plantagenet. When Eleanor sailed from France to meet Llywelyn, Edward hired men to seize her ship and she was imprisoned at Windsor Castle until Llywelyn made certain concessions.\r\n\r\n== Treaty of Aberconwy ==\n\nIn 1276 Edward declared Llywelyn a rebel, and in 1277 he gathered an enormous army to march against him. Edward\u0027s intention was to disinherit Llywelyn completely and take over Gwynedd Is Conwy himself. He was considering two options for Gwynedd Uwch Conwy: either to divide it between Llywelyn\u0027s brothers, Dafydd and Owain, or to annex Anglesey and divide only the mainland between the two brothers. Edward was supported by Dafydd ap Gruffudd and Gruffudd ap Gwenwynwyn. Many of the lesser Welsh princes who had supported Llywelyn had hastened to make peace with Edward. By the summer of 1277, Edward\u0027s forces had left from Chester to reach the River Conwy and encamped at Deganwy, while another force had captured Anglesey and took possession of the harvest there. This deprived Llywelyn and his men of food, forcing them to seek terms. The attack came from all directions from east of the border, Henry de Lacy attacked from Shrewsbury and Montgomeryshire, Roger Mortimer to Builth and Gwenwynwyn returned to take back Cyfeiliog and other parts of Powys. The lack of provisions forced Llywelyn into hiding, but the Welsh did see minor successes against the English.\nFollowing the battles, the result was the Treaty of Aberconwy, signed by Llywelyn on 9 November 1277. The outcome and peace accord guaranteed the return of lands to Llywelyn, but at a price. He regained Anglesey and parts of Snowdonia as his Kingdom of Gwynedd ruled as the Prince of Wales with the homage of five lords. He would have to pay a fine of 50,000 marks for the incident and would forgo his share of the rent of Anglesey to the crown. Meanwhile, the Llŷn Peninsula was given to his brother Owain who was released from jail in 1254. Then the Perfeddwlad in Gwynedd was given to Dafydd ap Gruffudd, with a promise that if Llywelyn died without an heir he would be given a share of Gwynedd Uwch Conwy instead.\n\nWith the peace accord in place, Llywelyn went to London and Parliament for the Christmas of 1277 and paid homage to the King of England. Llywelyn met Edward, and his partner Eleanor with the royal family at Worcester, they would marry the next year.\nLlywelyn exacted peace for several years, however, the English continued to pursue an Anglicisation policy in Wales. In the North East of Wales, the four cantrefs of the Court of Chester were brought under power violently. Whilst in the South West in Cardiganshire and Carmarthenshire the same policy was enacted by local sheriffs. The rough policy forced the Archbishop of Canterbury, John Peckham to attempt to bring harmony between the Church of England and the Church in Wales. In 1280, Peckham met with Llywelyn to make an agreement on the changes. However, Llywelyn\u0027s intentions were distracted and claimed the truce was broken by his fellow kin, Gruffudd ap Gwenwynwyn. The archbishop reminded Llywelyn that his grievance would not be heard, as Llywelyn\u0027s terms of Cyfraith Hywel were unreasonable in a contemporary setting. However, Llywelyn reconciled with his brother, Dafydd III, and they listened to the grievances of the cantrefs in Chester and once more secretly plotted a revolt together, this time, the forces of Wales were united against the English.\r\n\r\n== Marriage and family ==\nLlywelyn agreed with Edward I and was given permission to be married at the door of Worcester Cathedral on 13 October 1278. It was a minor ceremony attended by the Kings of Scotland and England, the Earl of Lancaster. Eleanor was to die in childbirth on 19 June 1282 after she gave birth to a daughter named Gwenllian. A stained glass window exists to this day depicting the wedding of the Prince of Wales and Lady Eleanor. By all accounts, the marriage was a genuine love match; Llywelyn is not known to have fathered any illegitimate children, which is extremely unusual for the Welsh royalty. === Descendants confusion ===\nSince the lifetime of Llywelyn II, sources have differed as to how many children he fathered and whether he has any living descendants today. Llywelyn definitely had one daughter named Gwenllian of Wales. However, she died childless in 1337. He was also alleged to have had another daughter by the same wife, Eleanor de Montfort, named Catherine. However, her existence as Llywelyn\u0027s first daughter has since been contested by Professor John Edward Lloyd, who said when speaking of Gruffydd Fychan II who supposedly married Catherine\u0027s granddaughter, Eleanor : \u0022The genealogists of a later age are not content even with this distinction; they proceed to heighten its effect by alleging that Helen was descended on her mother\u0027s side from a daughter of the last Llywelyn, so making Glyn Dwr represent Gwynedd as well as the other two principalities. But there is no evidence that Llywelyn had any daughter but Gwenllian, born in the last year of his life and after his death confined for the rest of her days as a nun of the order of Sempringham\u0022.\nSome authors have subsequently adopted Lloyd\u0027s position and deny the existence of Catherine. However, genealogist Bernard Burke the Norroy and Ulster King of Arms in the 19th century did confirm the evidence of Catherine\u0027s supposed lineage which continues in modern times with noble families such the former Welsh Barons of Cymmer-yn-Edeirnion , and also the current Croft baronets today.\r\n\r\n== Last campaign and death ==\n\nBy early 1282, many of the lesser princes who had supported Edward against Llywelyn in 1277 were becoming disillusioned with the exactions of the royal officers. On Palm Sunday that year, Dafydd ap Gruffydd attacked the English at Hawarden Castle and then laid siege to Rhuddlan. Meanwhile, the revolt quickly spread to other parts of Wales, with Aberystwyth Castle captured and burnt by Maredudd ap Rhys Gryg and rebellion in South Wales, also inspired by Dafydd according to the annals, where Carreg Cennen Castle was captured. Llywelyn, according to a letter he sent to the Archbishop of Canterbury John Peckham, was not involved in the planning of the revolt. He felt obliged, however, to support his brother and a war began for which the Welsh were ill-prepared.\nEvents followed a similar pattern to 1277, with Edward\u0027s forces capturing Gwynedd Is Conwy, Anglesey and taking the harvest. The English force occupying Anglesey tried to cross to the mainland on a bridge of boats but failed and was defeated in the Battle of Moel-y-don. The Archbishop of Canterbury tried mediating between Llywelyn and Edward, and Llywelyn was offered a large estate in England if he would surrender Wales to Edward, while Dafydd was to go on crusade and not return without the king\u0027s permission. In an emotional reply, which has been compared to the Declaration of Arbroath, Llywelyn said he would not abandon the people whom his ancestors had protected since \u0022the days of Kamber son of Brutus\u0022 and rejected the offer.\nLlywelyn now left Dafydd to lead the defence of Gwynedd and took a force South, trying to rally support in Mid and South Wales and open up an important second front. On 11 December at the Battle of Orewin Bridge at Builth Wells, he was killed while separated from his army. The exact circumstances are unclear and there are two conflicting accounts of his death. Both accounts agree that Llywelyn was tricked into leaving the bulk of his army and was then attacked and killed. The first account says that Llywelyn and his chief minister approached the forces of Edmund Mortimer and Hugh Le Strange after crossing a bridge. They then heard the sound of battle as the main body of his army was met in battle by the forces of Roger Despenser and Gruffydd ap Gwenwynwyn. Llywelyn turned to rejoin his forces and was pursued by a lone lancer who struck him down. It was not until some time later that an English knight recognised the body as that of the King. This version of events was written in the north of England some fifty years later and has suspicious similarities with details about the Battle of Stirling Bridge in Scotland.\nAn alternative version of events written in the east of England by monks in contact with Llywelyn\u0027s exiled daughter, Gwenllian ferch Llywelyn, and niece, Gwladys ferch Dafydd, states that Llywelyn, at the front of his army, approached the combined forces of Edmund and Roger Mortimer, Hugo Le Strange, and Gruffydd ap Gwenwynwyn on the promise that he would receive their homage. This was a deception. His army was immediately engaged in fierce battle during which a significant section of it was routed, causing Llywelyn and his eighteen retainers to become separated. At around dusk, Llywelyn and a small group of his retainers were ambushed and chased into a wood at Aberedw. Llywelyn was surrounded and struck down. As he lay dying, he asked for a priest and gave away his identity. He was then killed and his head hewn from his body. His person was searched and various items recovered, including a list of \u0022conspirators\u0022, which may well have been faked, and his privy seal.\n\nIf the king wishes to have the copy [of the list] found in the breeches of Llywelyn, he can have it from Edmund Mortimer, who has custody of it and also of Llywelyn’s privy seal and certain other things found in the same place.\nThe privy seal of Llywelyn the Last, his wife Eleanor and his brother Dafydd ap Gruffydd are thought to have been melted down by the English after finding them upon their bodies to make a chalice in 1284.\nThere are legends surrounding the fate of Llywelyn\u0027s severed head. It is known that it was sent to Edward at Rhuddlan and after being shown to the English troops based in Anglesey, Edward sent the head on to London. In London, it was set up in the city pillory for a day, and crowned with ivy . Then it was carried by a horseman on the point of his lance to the Tower of London and set up over the gate. It was still on the Tower of London 15 years later.\nThe last resting place of Llywelyn\u0027s body is not known for certain; however, it has always been tradition that it was interred at the Cistercians Abbey at Abbeycwmhir. On 28 December 1282, Archbishop Peckham wrote a letter to the Archdeacon of Brecon at Brecon Priory:\n\n... inquire and clarify if the body of Llywelyn has been buried in the church of Cwmhir, and he was bound to clarify the latter before the feast of Epiphany, because he had another mandate on this matter, and ought to have certified the lord Archbishop before Christmas, and has not done so.\nThere is further supporting evidence for this hypothesis in the Chronicle of Florence of Worcester:\n\nAs for the body of the Prince, his mangled trunk, it was interred in the Abbey of Cwm Hir, belonging to the Cistercian Order.\nAnother theory is that his body was transferred to Llanrumney Hall in Cardiff.\nThe poet Gruffudd ab yr Ynad Coch wrote in an elegy on Llywelyn:\n\nThere is an enigmatic reference in the Welsh annals Brut y Tywysogion, \u0022... and then Llywelyn was betrayed in the belfry at Bangor by his own men\u0022. No further explanation is given.\r\n\r\n== Annexation ==\nWith the loss of Llywelyn, Welsh morale and the will to resist diminished. Dafydd was Llywelyn\u0027s named successor. He carried on the struggle for several months, but in June 1283 was captured in the uplands above Abergwyngregyn at Bera Mountain together with his family. He was brought before Edward, then taken to Shrewsbury where a special session of Parliament condemned him to death. He was dragged through the streets, hanged, drawn and quartered.\nAfter the final defeat of 1283, Gwynedd was stripped of all royal insignia, relics and regalia. Edward Longshanks took particular delight in appropriating the royal home of the Gwynedd dynasty. In August 1284, he set up his court at Abergwyngregyn, Gwynedd. With equal deliberateness, he removed all the insignia of majesty from Gwynedd; a coronet was solemnly presented to the shrine of St. Edward at Westminster; the matrices of the seals of Llywelyn, of his wife, and of his brother Dafydd were melted down to make a chalice which was given by the king to Vale Royal Abbey where it remained until the dissolution of that institution in 1538, after which it came into the possession of the family of the final abbot. The most precious religious relic in Gwynedd, the fragment of the True Cross known as Cross of Neith, was paraded through London in May 1285 in a solemn procession on foot led by the king, the queen, the archbishop of Canterbury and fourteen bishops and the magnates of the realm. Edward was thereby appropriating the historical and religious regalia of the house of Gwynedd and placarding to the world the extinction of its dynasty and the annexation of the principality to his Crown. Commenting on this a contemporary chronicler is said to have declared \u0022and then all Wales was cast to the ground\u0022.\nMost of Llywelyn\u0027s relatives ended their lives in captivity with the notable exceptions of his younger brother Rhodri ap Gruffudd, who had long since sold his claim to the crown and endeavoured to keep a very low profile, and a distant cousin, Madog ap Llywelyn, who in 1294 led a revolt and briefly claimed the title Prince of Wales. Llywelyn and Eleanor\u0027s baby daughter Gwenllian of Wales was captured by Edward\u0027s troops in 1283. She was interned at Sempringham Priory in England for the rest of her life, becoming a nun in 1317 and dying without issue in 1337, probably knowing little of her heritage and speaking none of her language.\nDafydd\u0027s two surviving sons were captured and incarcerated at Bristol Gaol, where they eventually died many years later. Llywelyn\u0027s elder brother Owain Goch ap Gruffudd disappears from the record in 1282. Llywelyn\u0027s surviving brother Rhodri ap Gruffudd survived and held manors in Gloucestershire, Cheshire, Surrey, and Powys and died around 1315. His grandson, Owain Lawgoch, later claimed the title Prince of Wales.\r\n\r\n== Family tree ==\r\n\r\n== Coat of Arms ==\n\nThe Arms of Llywelyn ap Gruffudd are here shown graphically, being reproduced from the image on a roll of painted arms c. 1270–1280 Other rolls exist where variations of the coat of arms are found.\r\n\r\n== In popular culture ==\nThe 1982 Bardic Chair at the National Eisteddfod of Wales was awarded to Gerallt Lloyd Owen for his awdl Cilmeri, which Hywel Teifi Edwards has called the only 20th century awdl, that matches T. Gwynn Jones\u0027 1902 masterpiece Ymadawiad Arthur . Owen\u0027s Cilmeri reimagines the death of Llywelyn ap Gruffudd in battle near the village of the same name on 11 December 1282, while leading his doomed uprising against the occupation of Wales by King Edward I of England. Owen\u0027s poem depicts the Prince as a tragic hero and invests his fall with an anguish unmatched since Gruffudd ab yr Ynad Coch wrote his famous lament for the king immediately following his death. Owen also, according to Edwards, encapsulates in the Prince\u0027s death the Welsh people\u0027s continuing \u0022battle for national survival\u0022.",
  "imageNames": [
    "Alexander_IIILlywelyn_ab_Gruffydd_with_Edward_I.jpg",
    "COA_Llywelyn_ap_Gruffudd.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": true,
  "start": 1223,
  "end": 1282,
  "categoryId": "arweinwyr",
  "id": "llywelyn-ein-llyw-olaf",
  "label": "Llywelyn the Last"
}