{
  "wikiSummary": "The Rebecca Riots took place between 1839 and 1843 in West and Mid Wales. They were a series of protests undertaken by local farmers and agricultural workers in response to levels of taxation. The rioters, often men dressed as women, took their actions against toll-gates, as they were tangible representations of taxes and tolls. The rioters went by the name of Merched Beca which translates directly from Welsh as \u0027Rebecca\u0027s Daughters\u0027. The riots ceased prior to 1844 due to several factors, including increased troop levels, a desire by the protestors to avoid violence, and the appearance of criminal groups using the guise of the biblical character Rebecca for their own purposes. In 1844 an act of Parliament to consolidate and amend the laws relating to turnpike trusts in Wales was passed.",
  "wikiArticle": "The Rebecca Riots took place between 1839 and 1843 in West and Mid Wales. They were a series of protests undertaken by local farmers and agricultural workers in response to levels of taxation. The rioters, often men dressed as women, took their actions against toll-gates, as they were tangible representations of taxes and tolls. The rioters went by the name of Merched Beca which translates directly from Welsh as \u0027Rebecca\u0027s Daughters\u0027. The riots ceased prior to 1844 due to several factors, including increased troop levels, a desire by the protestors to avoid violence, and the appearance of criminal groups using the guise of the biblical character Rebecca for their own purposes. In 1844 an act of Parliament to consolidate and amend the laws relating to turnpike trusts in Wales was passed.\r\n\r\n== History ==\n\n\n=== Events leading to the riots ===\nIn the late 1830s and early 1840s, the agricultural communities of west Wales were in dire poverty. In 1837 and 1838 the whole country suffered from poor harvests, worse in the south west, where atrocious seasons of rain forced farmers to buy corn at famine prices to feed themselves, their animals and their families, which further eroded what little capital they had. Grain harvests collapsed, but the price of butter between 1837 and 1841, and sheep between 1839 and 1841, was relatively high, and even the low cattle prices of 1839 recovered by 1841. But by 1842 a general fall in prices occurred throughout the agricultural markets that continued into 1843. Cattle prices slumped sharply in 1842, and the blame was placed on the government, and in particular Robert Peel\u0027s tariff measures which eased importation of foreign cattle and meat. In 1842, the harvest was one of the most successful in years, and that, combined with the contraction in demand from the Glamorgan ironworks, led to a slump in corn prices.\nThe farmers\u0027 economic position had therefore shifted from that of dire grain harvests with life supported by sheep and butter sales, to one where the price of their corn, when the weather was favourable, was very low. The diminution of the Glamorgan ironworks, coupled with the new tariff, also had an adverse effect on the prices of butter, cheese, pigs, horses, sheep and lean cattle, impacting harshly on the Welsh pastoral farmer.\nThe farmers were faced with a drastic reduction in their income, but had no financial relief in similar reductions in their outgoings, mainly rents, tithes, county rates, poor rates and the turnpike tolls. Farm rents were mainly static, but the tithes, tolls and poor rates increased. Seeing themselves as victims of \u0027tyranny and oppression\u0027, the farmers and their workers took the law into their own hands to rid themselves of these taxes. The first institutions to be attacked were the hated toll-gates.\nIn the early 19th century many toll-gates on the roads in Wales were operated by trusts which were supposed to maintain and improve the roads, funding this from tolls. However, many trusts charged high tolls but spent the money on other things. Even where this was not done, the toll-gate laws imposed an additional financial burden on poor farming communities. The \u0027oppression\u0027, felt by the farmers, began in the late 1830s, when a group of toll-renters bought the right to collect tolls in the region\u0027s trusts , who then tried to aggressively tried to recoup their investment. This group was led by Thomas Bullin, who was hated by those who paid his tolls. The main reason for his dislike was the exacting method of the toll collection and the big toll increases of side-bars. The side-bars were simple toll-gates, away from the main trunk roads, placed strategically on by-roads to catch any traffic that had tried to bypass the main toll booths via side lanes. These side-bars dramatically increased the cost of farmers\u0027 carting lime to their fields to fertilize or to reduce acidity in the soil. It was said that it cost ten times as much as the lime itself to cart it from Cardiff docks to a farm in the hills.\n\n\n=== Rebecca ===\n\nThe first appearance of Rebecca or Beca, as the members called themselves, occurred in 1839. Although this precedes the economic events of 1842, the early appearances of Rebecca were sporadic isolated outbursts, with the true body of rioting not beginning until the winter of 1842. Although these early \u0027uprisings\u0027 were few and uncommon, they were the first appearance of mobs dressed in the guise of Rebecca. These gangs became known as Merched Beca or merely the Rebeccas. The origin of their name is said to be a verse in the Bible, Genesis 24:60 - \u0027And they blessed Rebekah and said unto her, Thou art our sister, be thou the mother of thousands of millions, and let thy seed possess the gate of those which hate them\u0027. This verse was shouted many a time by religious townsfolk.\nBefore destroying the toll-gates, \u0027Rebecca\u0027 would call to his followers who were also dressed as women and perform a scene which involved the following words:\n\nRebecca: \u0022What is this my children? There is something in my way. I cannot go on....\u0022\nRioters: \u0022What is it, mother Rebecca? Nothing should stand in your way,\u0022\nRebecca: \u0022I do not know my children. I am old and cannot see well.\u0022\nRioters: \u0022Shall we come and move it out of your way mother Rebecca?\u0022\nRebecca: \u0022Wait! It feels like a big gate put across the road to stop your old mother.\u0022\nRioters: \u0022We will break it down, mother. Nothing stands in your way.\u0022\nRebecca: \u0022Perhaps it will open...Oh my dear children, it is locked and bolted. What can be done?\u0022\nRioters: \u0022It must be taken down, mother. You and your children must be able to pass.\u0022\n\nRebecca: \u0022Off with it then, my children.\u0022\nThe toll-gates would then be destroyed. Although not all members of the mob would wear women\u0027s clothes, those that did, often in white gowns, would also blacken their faces or wear masks. The attacks were accompanied by much noise; and in the earliest, a mock trial would also take place.\nThe accepted leader of the first protests, Thomas Rees , wore women\u0027s clothes when leading attacks. Some versions of the story say that these were borrowed from a woman called Rebecca living near his home at the foot of the Preseli Hills. The story states that this woman was an old maid and her clothes were borrowed because she was the only woman tall enough and large enough in the village. Local records do not bear this out—and the wearing of women\u0027s clothes was an established part of traditional Welsh justice , of which Twm Carnabwth is remembered as a notoriously enthusiastic participant.\nThe Ceffyl Pren bears many similarities to the Rebeccas, with men wearing female clothing, blackening their faces and conducting mock trials; and was on a significant increase in the late 1830s in Wales. The Ceffyl Pren was a way of frightening and punishing members of a community, of whom wrongdoing was suspected, but little will or evidence existed to bring the person to justice. Normally \u0027crimes\u0027 punished by the Ceffyl Pren included marital infidelity or informing on a neighbour. Other examples of rebels cross-dressing, destroying toll booths, and adopting shared pseudonyms can be found in British history going back at least as far as the Western Rising.\n\n\n=== The riots ===\n\nThe Rebecca Riots were a response not only against the toll-gates, but also other factors affecting Welsh farming communities. The toll-gates were chosen as the most tangible representation of the system the rioters so despised. Their only other option would have been the union workhouses, as the Poor Law was as hated as the toll roads; but these could be easily defended and were often garrisoned by troops.\nThe first protests led by \u0022Rebecca\u0022 destroyed the toll-gates at Yr Efail Wen in two attacks in Carmarthenshire in 1839. These were believed to be led by Twm Carnabwth, though he  did not appear to participate in further riots when the attacks flared again three years later. Other communities later adopted the name and disguise, and other grievances besides the toll-gates were aired in the riots. Anglican clergymen from the established Church of England were targets on several occasions. The Church of England could demand tithes and other ecclesiastical benefits even though most of the population of Wales were Nonconformists. Other victims were petty local villains such as the fathers of illegitimate children.\nThe next time the Rebeccas assembled was roughly three years later, when Tom Bullin was allowed to raise a toll-gate by the Mermaid Tavern near St Clears. This was an obvious \u0027trap\u0027 side-bar, and angered the locals, who destroyed it and two other gates. Other toll-gates to be target included the Bolgoed toll-gate on the outskirts of Pontarddulais. On 6 July 1843 the Bolgoed toll-gate was attacked and destroyed by a group of some 200 men.\nIn mid-July 1843, letters were sent from representatives of the Rebeccas, targeting the landlords of farmers, and thus reflecting a shift away from a focus on tollgate alone towards more general grievances against the landlord class. These threatening letters warned the landlords to make reductions in the rent of their tenant farmers. The summer of 1843 also saw farmers conducting open meetings demanding a lowering of rent by at least a third. The threats came to little and the meetings had no effect, and the rents remained the same, though by August farmers had changed tactics to calling for an independent assessment of the regulations of rents.\nThe riots resulted in at least one murder, in the small village of Hendy on 7 September 1843, in which a young woman and gate keeper named Sarah Williams was killed. She had been warned beforehand that the rioters were on their way but refused to leave. On the night of her death she could be heard shouting \u0022I know who you are\u0022 by a family living up the road who had locked their doors from the rioters. Williams called for help at the house of John Thomas, a labourer, to extinguish a fire at the toll-gate, but when she returned to the toll house, a shot was heard. Williams returned to the house of John Thomas, and collapsed at the threshold of the house. Two minutes later she was dead.\nFrom August 1843, local and open protest meetings were taking the place of riots, partly due to the farmers\u0027 scaling back on violent activity, and to the increasing presence of troop numbers. Another major factor in reduction of riots was the work of a group of petty criminals masquerading as Rebecca and operating from Five Roads near Llanelli. This group, led by known trouble-maker John Jones and his associate David Davies , turned more respectable people away from Rebecca. Davies was eventually convicted of crimes during the riots and transported to Australia,  as was Jones for an unrelated assault charge.\r\n\r\n== Aftermath ==\n\nBy late 1843, the riots had stopped. Although Rebecca had failed to produce an immediate effect on the lives of the farmers she had sought to serve, the very nature of a leaderless uprising of the downtrodden peasantry in an attempt to obtain justice from an unfair system, was an important socio-political event within Wales. In the aftermath of the riots, some rent reductions were achieved, the toll rates were improved and the protests prompted several reforms, including a royal commission into the question of toll roads, which led to the South Wales Turnpike Trusts Act 1844 . This act consolidated the trusts, simplified the rates and reduced the hated toll on lime movement by half. More importantly, the riots inspired later Welsh protests. These included opposition to the privatisation of salmon reserves on the River Wye in the 1860s and 70s, which became known as \u0027the second Rebecca riots\u0027, and the formation in the 1970s of the radical arts collective known as the Beca group.\nAs late as December 1910, the historic horn used to gather the Rebeccaites was sounded during the general election campaign to signify the arrival of the car carrying Liberal candidate John Hinds for a meeting at Bethania Chapel, Talog.\nThe toll house near Porthmadog, at the south-eastern end of the Cob, was built for collection of the tolls which were introduced when the long embankment opened in 1811. A tariff of toll charges from the 19th century is still to be seen on the front of the building. The Cob’s private operator was authorised by an 1807 act of Parliament, Madocks\u0027 Estate Act 1807 , to levy tolls on road vehicles which crossed. In April 1978 the rights were purchased by a local body called the Rebecca Trust, which continued to levy a 5p toll per vehicle for 25 years. Surplus funds were distributed annually to local good causes. Tolls ended on 29 March 2003, after the Welsh Government bought the Cob from the trust.\r\n\r\n== In popular culture ==\n\n\n=== Literature ===\nThe Rebecca Riots were the setting for the novel Hosts of Rebecca by Alexander Cordell.\nOne of the earliest novels about the Rebecca Riots was written by Welsh author Amy Dillwyn, who wrote The Rebecca Rioter, first published in 1880. ISBN 1870206436\nThe Rebecca Riots play an important part in the plot of the novel The Sheep-stealers by Violet Jacob, first published in 1902.\nA more recent novel is Children of Rebecca by Vivien Annis Bailey, published by Honno in 1995.\nA later crime thriller by Alis Hawkins None So Blind published by Canelo in 2021, ISBN 978 1 80032 269 1, describes the fight of a blind lawyer against Rebeccas who probably murdered his youthful enamourata.\nMary Balogh\u0027s historical romance Truly deals in great detail with the causes and actions of Rebecca Riots. Her story is told from the perspective of residents of one small community but references the poverty, violence and punishments associated with this movement. ASIN B084KGP78Z\n\n\n=== Film ===\nIn 1948 Dylan Thomas wrote the screenplay for a film, Rebecca\u0027s Daughters, which was published as a novel of the same name in 1965. The film was not released until 1992, and starred Peter O\u0027Toole, Paul Rhys and Joely Richardson. The 44 years between the writing of the screenplay and the release of the film is the longest on record.\n\n\n=== Music ===\nThe name Rebecca is also mentioned in the context of the Merthyr Rising of 1831 in the song \u0022Ironmasters\u0022 by the British folkpunk band The Men They Couldn\u0027t Hang on their album Night of a Thousand Candles. The phrase \u0022The Rebeccas ride at dawn, petticoat ghost and Tom. Working to reclaim the land for no reward\u0022 is found in the song \u0022Newtown Jericho\u0022 from rock band The Alarm. A song called \u0022Rebecca Run\u0022, written and performed by the duo Brenig is completely about the Rebecca Riots.",
  "imageNames": [
    "Penparcau_tollhouse_St_Fagans.jpg",
    "RebeccaRiots.gif",
    "Rebecca_Riots_-_Punch1843.jpeg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1839,
  "end": 1843,
  "categoryId": "cymdeithasol",
  "id": "merched-beca",
  "label": "Rebecca Riots"
}