{
  "wikiSummary": "Pembrokeshire Coast National Park is a national park along the Pembrokeshire coast in west Wales.\nIt was established as a National Park in 1952. It is one of the three National parks of Wales, the others being the Brecon Beacons and Snowdonia. It is the only national park in the United Kingdom to consist largely of coastal landscapes.",
  "wikiArticle": "Pembrokeshire Coast National Park is a national park along the Pembrokeshire coast in west Wales.\nIt was established as a National Park in 1952. It is one of the three National parks of Wales, the others being the Brecon Beacons and Snowdonia. It is the only national park in the United Kingdom to consist largely of coastal landscapes.\r\n\r\n== Landscape ==\n\nSee also Geology of the Pembrokeshire Coast National Park\nThe National Park has a varied landscape of rugged cliffs, sandy beaches, wooded estuaries, wild inland hills, the moorland of the Preseli Hills and the wooded Gwaun valley. The total area is 629 km2 . There are four distinct sections: clockwise these are the south Pembrokeshire coast, including Caldey Island; the Daugleddau estuary; the St Bride\u0027s Bay coast, including the coastal islands; and the Preseli Hills.\nThe geology of the area is of particular interest with many good exposures both inland and along the coast, exhibiting a variety of rock types and structural features such as natural arches, stacks, rock folding and sea caves. A stack of note is Elegug Stacks , two large detached pillars of limestone which in the spring provide valued nesting sites for razorbills and guillemots. In the north, the rocks of Carn Llidi, Pen Beri and Garn Fawr, together with the extensive moorland on Mynydd Carningli and Mynydd Preseli, give an exposed and mountainous feel to the landscape, cut through by the wooded valleys of the Gwaun and Nevern. In the west, the National Park is dominated by the broad sweep of St Bride\u0027s Bay, bounded at its northern end by Ramsey Island, near St David\u0027s peninsula, and at its southern end by Skomer. The southern coast is another contrast, with the limestone plateau and cliffs of the Castlemartin peninsula, the steep-sided wooded valleys inland from Amroth; the Bosherston lakes — now, like much of the coastal strip, in the care of the National Trust — and the tourist resorts of Tenby and Saundersfoot. Between the western and southern areas of the National Park lies the Milford Haven waterway, where the tranquil Daugleddau estuary feeds into one of the finest natural deep water harbours in the world.\n\nThe National Park includes many sites of historic and archaeological importance and areas which are of national or international nature conservation significance in their own right, including 7 Special Areas of Conservation, a Marine Nature Reserve, 6 national nature reserves and 75 Sites of Special Scientific Interest.\nIn 2011, National Geographic Traveler magazine voted Pembrokeshire the second best coastal destination in the world for sustainable tourism.\nIn January 2016 the Authority launched the \u0022Changing Coasts\u0022 project to document the way the coastline has changed as a result of recent winter storms; the project invites visitors to submit photographs taken from fixed points; a pilot study will be carried out at Abereiddy.\r\n\r\n== Pembrokeshire Coast Path ==\n\nThe Pembrokeshire Coast Path is a designated National Trail.  It was established in 1970, and is 186 miles long, much of it at cliff-top level, with a total of 35,000 feet of ascent and descent.\nThe southern end of the path is at Amroth. The northern end was regarded as being at Poppit Sands, near St. Dogmaels, where the official plaque was sited; however, the path now continues to St. Dogmaels, where a new marker was unveiled in July 2009, and links with the Ceredigion Coast Path to continue northwards as part of the Wales Coast Path, the 870-mile long-distance walking route around the whole coast of Wales from Chepstow to Queensferry, which was officially opened in 2012.\r\n\r\n== Administration ==\nThe Park is managed by Pembrokeshire Coast National Park Authority, which has around 150 staff and a committee of 18 members. The Authority\u0027s purposes are to conserve and enhance the National Park, and encourage the public to enjoy and understand it. In pursuing these purposes, the authority has a duty to foster the social and economic well-being of the communities within its boundaries. Its offices are in Pembroke Dock. The Chief Executive is Tegryn Jones.\nThe Authority also manages the entire length of the Pembrokeshire Coast Path, a 186-mile national trail which lies almost entirely within the Pembrokeshire Coast National Park.\nIn light of renaming of the other two Welsh national parks, the authority stated it plans to retains both its English and Welsh name in April 2023.\r\n\r\n== Beaches ==\n\nOver the years Pembrokeshire\u0027s beaches, all of which lie in the National Park, have been awarded many International Blue Flag Awards , 47 Green Coast Awards and 106 Seaside Awards .  In 2011 it also had 39 beaches recommended by the Marine Conservation Society.\nBeaches in the park include:",
  "location": {
    "lat": 51.83333333,
    "long": -5.08333333
  },
  "imageNames": [
    "Barafundle_Bay_beach_May_2009.jpg",
    "Green_Bridge_of_Wales_1_-_Pembrokeshire_2010.jpg",
    "Pentre_Ifan_burial_chamber_-_geograph.org.uk_-_384085.jpg",
    "St_Govans_chapel_-_geograph.org.uk_-_876068.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1952,
  "categoryId": "lleoedd",
  "id": "parc-penfro",
  "label": "Pembrokeshire"
}