{
  "wikiSummary": "The Menai Suspension Bridge is a suspension bridge spanning the Menai Strait between the island of Anglesey and the mainland of Wales. Designed by Thomas Telford and completed in 1826, it was one of the world\u0027s first major suspension bridges, and second such bridge designed to carry vehicular traffic, after the Union Chain Bridge across the River Tweed. The bridge still carries road traffic and is a Grade I listed structure.",
  "wikiArticle": "The Menai Suspension Bridge is a suspension bridge spanning the Menai Strait between the island of Anglesey and the mainland of Wales. Designed by Thomas Telford and completed in 1826, it was one of the world\u0027s first major suspension bridges, and second such bridge designed to carry vehicular traffic, after the Union Chain Bridge across the River Tweed. The bridge still carries road traffic and is a Grade I listed structure.\r\n\r\n== Background ==\nThe Menai Strait was created by glacial erosion along a line of weakness associated with the Menai Strait fault system. During a series of Pleistocene glaciations , a succession of ice-sheets moved from northeast to southwest across Anglesey and neighbouring Gwynedd, scouring the underlying rock and creating a series of linear bedrock hollows. The deepest of these channels eventually became flooded by the sea as the ice sheets receded, forming the Menai Strait.\nAs Anglesey has been an island throughout recorded human history, the only way to reach it was by crossing the strait. However, this has always been a dangerous endeavour because there are four strong tidal flows each day generated by the twice daily tides. These flow in both directions through the strait, creating strong currents and whirlpools. Despite the dangers, ferries operated all along the Menai Strait, carrying passengers and goods between the island and the mainland. In 1785, a boat carrying 55 people ran aground at the southern end of the Menai Strait in a strong gale and began to sink. The stricken vessel sank before a rescue boat from Caernarfon could reach it, and only one person survived.\nAdditionally, the main source of income on Anglesey was from the sale of cattle, and to move them to the markets of the mainland, including London, they had to be driven into the water and encouraged to swim across the Strait. This often resulted in the loss of valuable animals.\nIn 1800, Ireland joined Great Britain in the Act of Union. This led rapidly to an increase in people travelling between London and Holyhead en route to Dublin. In 1815, the British Parliament passed an act of Parliament, the Holyhead Roads Act 1815 , to build the Holyhead Road with responsibility for the project given to civil engineer Thomas Telford. Despite some difficult geographical obstacles to overcome , the route was chosen because Holyhead was the principal port for ferries to Dublin as it was the closest point to Ireland. After Telford had completed a survey of the route from London to Holyhead, he proposed that the best option was to build a bridge over the Menai Strait from a point near Bangor on the mainland to the village of Porthaethwy on Anglesey.\nThe site for the bridge was chosen because it had tall banks that would be high enough to allow sailing ships to pass underneath. Telford proposed that a suspension bridge would be the best option because it would have a span wide enough to cross the fast flowing waters of the Strait at this point. His recommendation was accepted by Parliament, which authorised the bridge in the Roads Between London and Holyhead Act 1819 .\r\n\r\n== Construction ==\n\nConstruction of the bridge, to Telford\u0027s design, began in 1819 with the towers on either side of the strait. These were constructed from Penmon limestone and were hollow with internal cross-walls. Then came the sixteen huge chain cables to support the 176-metre span, each consisting of five parallel bars of wrought iron links, for a total of 80 iron bars and 935 links per cable.\nThe chains were carried over the piers on cast iron saddles with rollers, allowing for movement caused by temperature changes. Each chain measured 522.3 metres and weighed 121 long tons . Their suspending power was calculated at 2,016 long tons . To avoid rusting between manufacture and use, the iron was soaked in linseed oil and later painted. On both sides of the strait the chains were conveyed through three tunnels into a chamber cut into the rock, where they were held in place by 9 feet bolts resting in cast iron sockets. William Hazledine was contracted to supply the necessary wrought and cast iron, and each chain had four adjusting links to compensate for differences in length caused by imperfections during the production of the large number of separate links.\nWorkmen assembled the majority of the chains link by link on-site. This was carried out on platforms near the tunnel mouths until the chains, supported by scaffolding, reached the tops of the piers. A cradle capable of carrying two workers was then suspended from each tower and links were lifted up and attached by the men in the cradles until the chains reached water level. The final central portion of each chain was floated across on a 400 feet raft and lifted via a system of pulleys by 150 men.\nThe bridge was opened to much fanfare on 30 January 1826. It reduced the 36-hour journey time from London to Holyhead by 9 hours.\r\n\r\n== Later history ==\nThe roadway was only 24 feet wide and, without stiffening trusses, soon proved highly unstable in the wind. The deck of the Menai Bridge was strengthened in 1840 by W. A. Provis and, in 1893, the entire wooden surface was replaced with a steel deck designed by Sir Benjamin Baker. Over the years, the 41⁄2-ton weight limit proved problematic for the increasing freight industry and in 1938 the original wrought iron chains were replaced by a new arrangement of steel ones, without the need to close the bridge. In 1999, the bridge was closed for around a month to resurface the road and strengthen the structure, requiring all traffic to cross via the nearby Britannia Bridge.\nOn 28 February 2005, one carriageway of the bridge was closed for six months, restricting traffic to a single carriageway. The bridge was reopened to traffic in both directions on 11 December 2005 after its first major repainting in 65 years. It has been proposed by the British government as a candidate World Heritage Site.\nOn 21 October 2022, the bridge was shut without prior notice. A statement from the Welsh Government said it was closed for essential maintenance work following safety recommendations from structural engineers. Initially, the bridge was shut completely in both directions, but it was soon reopened to foot passengers and dismounted cyclists. The Welsh Government stated the bridge would remain closed for 14 to 16 weeks, reopening in early 2023.\nOn 1 February 2023, the bridge was reopened in both directions, but subject to a seven and a half ton weight restriction. A date for full remedial work has yet to be set.\nOn 4 October 2025, the bridge was again closed to all traffic after additional issues had been uncovered and the recommended reduced weight limit of 3 tonnes had proven impossible to police.. A date for full remedial work has yet to be set.\r\n\r\n== Surroundings ==\nThe Anglesey Coastal Path passes below the bridge and the Wales coast path passes over the bridge and joins the mainland path at the bridge end. The bridge has a memorial to the Aberfan disaster victims on the Anglesey side.\r\n\r\n== Cultural references ==\n\nThe nearest settlement is the town of Menai Bridge. A representation of the Menai Bridge inside a border of railings and stanchions is featured on the reverse of British one-pound coins minted in 2005.\n\n\n=== Quotation ===\n\n\n=== Famous Welsh englyn ===",
  "location": {
    "lat": 53.22,
    "long": -4.16305556
  },
  "imageNames": [
    "A_plan_and_view_of_a_chain_bridge_-_erecting_over_the_menai_at_Bangor_Ferry_1820.jpeg",
    "Bangor_View_on_Suspension_Bridge_8571590364.jpg",
    "Menai_Bridge_at_dusk.jpg",
    "Select_Sketches_-_Menai_Bridge_2.jpg",
    "The_Menai_Suspension_Bridge_35349065306.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1819,
  "categoryId": "diwydiant",
  "id": "pont-menai",
  "label": "Menai suspension bridge"
}