{
  "wikiSummary": "Portmeirion is a folly tourist village in Gwynedd, North Wales. It lies on the estuary of the River Dwyryd in the community of Penrhyndeudraeth, 2 miles from Porthmadog and 1 mile from Minffordd railway station. Portmeirion was designed and built by Sir Clough Williams-Ellis between 1925 and 1975 in the Baroque style and is now owned by a charitable trust. It has served as the location for numerous films and television shows, most famously as \u0022the Village\u0022 in the 1960s television show The Prisoner.\nMany of the buildings within the village are listed by Cadw, the Welsh historic environment service, for their architectural and historical importance, and the gardens are listed, at Grade II*, on the Cadw/ICOMOS Register of Parks and Gardens of Special Historic Interest in Wales.",
  "wikiArticle": "Portmeirion is a folly tourist village in Gwynedd, North Wales. It lies on the estuary of the River Dwyryd in the community of Penrhyndeudraeth, 2 miles from Porthmadog and 1 mile from Minffordd railway station. Portmeirion was designed and built by Sir Clough Williams-Ellis between 1925 and 1975 in the Baroque style and is now owned by a charitable trust. It has served as the location for numerous films and television shows, most famously as \u0022the Village\u0022 in the 1960s television show The Prisoner.\nMany of the buildings within the village are listed by Cadw, the Welsh historic environment service, for their architectural and historical importance, and the gardens are listed, at Grade II*, on the Cadw/ICOMOS Register of Parks and Gardens of Special Historic Interest in Wales.\r\n\r\n== History ==\n\nSir Clough Williams-Ellis, Portmeirion\u0027s architect, denied repeated claims that the design was based on the fishing village of Portofino on the Italian Riviera. He stated only that he wanted to pay tribute to the atmosphere of the Mediterranean. He did, however, draw on a love of the Italian village stating, \u0022How should I not have fallen for Portofino? Indeed, its image remained with me as an almost perfect example of the man-made adornment and use of an exquisite site.\u0022 Williams-Ellis designed and constructed the village between 1925 and 1975. He incorporated fragments of demolished buildings, including works by a number of other architects. Portmeirion\u0027s architectural bricolage and deliberately fanciful nostalgia have been noted as an influence on the development of postmodernism in architecture in the late 20th century.\nThe main building of the hotel and the cottages \u0022White Horses\u0022, \u0022Mermaid\u0022, and \u0022Salutation\u0022 had been a private estate called Aber Iâ , developed in the 1850s on the site of a late 18th-century foundry and boatyard. Williams-Ellis changed the name to Portmeirion: \u0022Port-\u0022 from its place on the coast; \u0022-meirion\u0022 from the county of Merioneth in which it was sited. The very minor remains of a mediaeval castle are in the woods just outside the village, recorded by Gerald of Wales in 1188.\nIn 1931 Williams-Ellis bought from the estate of his uncle, Sir Osmond Williams, Bt , the Victorian crenellated mansion Castell Deudraeth with the intention of incorporating it into the Portmeirion hotel complex, but the intervention of the war and other problems prevented this. Williams-Ellis had always considered the Castell to be “the largest and most imposing single building on the Portmeirion Estate\u0022 and sought ways to incorporate it. Eventually, with support from the Heritage Lottery Fund and the European Regional Development Fund as well as the Wales Tourist Board, his original aims were achieved and Castell Deudraeth was opened by the Welsh opera singer Bryn Terfel as an 11 bedroom hotel and restaurant on 20 August 2001, 23 years after Williams-Ellis\u0027s death.\nThe village of Portmeirion has been a source of inspiration for writers and television producers. Noël Coward wrote Blithe Spirit while staying in the Fountain 2 suite at Portmeirion, though Clough Williams-Ellis, in a television interview, said: \u0022...the Watch House...where Noel Coward wrote that delightful thing of his, Blithe Spirit\u0022.  George Bernard Shaw and H. G. Wells were also early visitors. In 1956 the architect Frank Lloyd Wright came, and other famous guests included Gregory Peck and Ingrid Bergman. In the late 1950s, Stanley Long, a former RAF photographer, came to create a collectible stereoview series through VistaScreen. The village has many connections to the Beatles. Their manager Brian Epstein was a frequent visitor, along with Paul McCartney, and George Harrison spent his 50th birthday there in 1993. It was while Harrison was in Portmeirion that he filmed interviews for The Beatles Anthology documentary. Musician Jools Holland visited whilst filming for the TV music show The Tube, and was so impressed that he had his studio and other buildings at his home in Blackheath built to a design inspired by Portmeirion.\n\nPortmeirion is now owned by a charitable trust, and has always been run as a hotel, which uses most of the buildings as hotel rooms or self-catering cottages, together with shops, a cafe, tea-room, and restaurant. Portmeirion is today a major tourist attraction in North Wales and day visits can be made on payment of an admission charge.\nThe village was the setting of the inaugural Festival N°6, which took place in September 2012 and featured headline acts Spiritualized, Primal Scream and New Order. The festival then ran each year in September at Portmeirion until 2018, when the festival organisers announced that the festival would be taking an indefinite break.\r\n\r\n== Architecture ==\n\nArchitecture critic Lewis Mumford devoted a large part of a chapter of his 1963 book The Highway and the City to Portmeirion, which he called an artful and playful little modern village, designed as a whole and all of a piece ... a fantastic collection of architectural relics and impish modern fantasies. ... As an architect, [Williams-Ellis] is equally at home in the ancient, traditional world of the stark Welsh countryside and the once brave new world of \u0022modern architecture.\u0022 But he realized earlier than most of his architectural contemporaries how constricted and desiccated modern forms can become when the architect pays more attention to the mechanical formula or the exploitation of some newly fabricated material than to the visible human results. In a sense, Portmeirion is a gay, deliberately irresponsible reaction against the dull sterilities of so much that passes as modern architecture today. ... [I]t is prompted by [the] impulse ... to reclaim for architecture the freedom of invention — and the possibility of pleasurable fantasy — it had too abjectly surrendered to the cult of the machine.\n\nMumford referred to the architecture as both romantic and picturesque in Baroque form, \u0022with tongue in cheek.\u0022 He described the total effect as \u0022relaxing and often enchanting\u0022 with \u0022playful absurdities\u0022 that are \u0022delicate and human in touch\u0022, making the village a \u0022happy relief\u0022 from the \u0022rigid irrationalities and the calculated follies\u0022 of the modern world.\nThe houses Anchor, Arches, the hotel building, Lady\u0027s Lodge, the inside of the Pantheon and the vaulted ceiling of Gate House are decorated with murals and frescoes by the Frankfurt-born artist and friend of Clough Williams-Ellis Hans Feibusch.\nPortmeirion Town Hall is a grade I listed building, incorporating stonework and the Hercules Hall from the demolished Emral Hall in Flintshire. Many other buildings and structures within the village have their own listings.\n\n\n=== Chronology of construction ===\r\n\r\n== Y Gwyllt ==\nThe grounds contain a collection of rhododendrons and other exotic plants in a wild-garden setting, which was begun before Williams-Ellis\u0027s time by the previous owner George Henry Caton Haigh and has continued to be developed since Williams-Ellis\u0027s death.\nY Gwyllt forms an approximately triangular shaped area on the peninsula to the north of the Hotel and stretches down to the coast and the Dwyryd estuary. Its location by the sea means it is frost-free, making it possible to grow rare plants such as camellias and \u0022an outstanding rhododendron collection of the early twentieth century\u0022. The area also contains a Dog Cemetery.\nThe gardens are designated, at Grade II*, on the Cadw/ICOMOS Register of Parks and Gardens of Special Historic Interest in Wales.\r\n\r\n== Filming location ==\n\nTelevision series and films have shot exterior scenes at Portmeirion, often depicting the village as an exotic European location. These include the 1960 Danger Man episode \u0022View from the Villa\u0022 starring Patrick McGoohan and the 1976 four-episode Doctor Who story titled The Masque of Mandragora set in Renaissance Italy. The last episode of Citizen Smith, the Christmas 1980 episode Buon Natale, was filmed partly in Portmeirion. In 2002, some scenes were filmed there for the final episode of the TV series Cold Feet. Both the CBeebies series Gigglebiz and its spin-off series Captain Adorable were shot in Portmeirion. The village of Llan-ar-goll-en, which appeared in the Welsh preschool show of the same name on S4C, was also shot there.\nPortmeirion has been the location for music videos and concerts. The 1980s Scottish band Altered Images used Portmeirion in their video \u0022See Those Eyes\u0022. Siouxsie and the Banshees used Portmeirion as a setting in their 1987 recording of \u0022The Passenger\u0022 for the \u0022Laughing Prisoner\u0022 spoof. This video included various scenes from The Prisoner.\n\n\n=== The Prisoner ===\nIn 1966–1967, Patrick McGoohan returned to Portmeirion to film exteriors for The Prisoner, a surreal spy drama in which Portmeirion played a starring role as \u0022The Village\u0022, in which McGoohan\u0027s retired intelligence agent, known only as \u0022Number 6\u0022, was incarcerated and interrogated, albeit in pleasant surroundings. At Williams-Ellis\u0027 request, Portmeirion was not identified on screen as the filming location until the credits of the final episode of the series, and indeed, Williams-Ellis stated that the levy of an entrance fee was a deliberate ploy to prevent the Village from being spoilt by overcrowding. The show, broadcast on ITV in the UK during the winter of 1967-68 and CBS in the US in the summer of 1968, became a cult classic, and fans continue to visit Portmeirion, which hosts annual Prisoner fan conventions.\nThe building that was used as the lead character\u0027s home in the series was used as a Prisoner-themed souvenir shop. Many of the locations used in The Prisoner are virtually unchanged after more than 50 years. A large outdoor chess board was installed in 2016 in homage to its appearance in the series.\nBecause of its Prisoner connection, Portmeirion has been used as the filming location for a number of homages to the series, ranging from comedy skits to an episode of the BBC documentary series The Celts, which recreated scenes from The Prisoner. Other instances have included:\n\nIn 1987 Jools Holland starred in a spoof documentary, The Laughing Prisoner, with Stephen Fry, Terence Alexander, and Hugh Laurie.  Much of it was shot in Portmeirion, and it included archive footage of McGoohan.\nPortmeirion, along with the Welsh village of Morfa Bychan, was used as the location for the filming of the Supergrass video \u0022Alright\u0022. The video includes numerous references to The Prisoner.\nIron Maiden recorded a song called \u0022The Prisoner\u0022 on their album The Number of the Beast . In a documentary programme about that album , lead singer Bruce Dickinson wanders through the avenues of Portmeirion and describes how the song was written and how the band\u0027s manager obtained permission from Patrick McGoohan to use dialogue from the show in the song\u0027s introduction.\nThe Channel 4 music programme The Tube produced videos for XTC\u0027s songs \u0022The Meeting Place\u0022 and \u0022The Man Who Sailed Around His Soul\u0022, both of which were filmed in Portmeirion with the band wearing costumes from The Prisoner.\nIn Series 12, Episode 13 of Wheeler Dealers the finished Caterham 7 is taken to Portmeirion to pay homage to The Prisoner, which featured the Lotus 7, the predecessor of the Caterham 7.",
  "location": {
    "lat": 52.91305556,
    "long": -4.09916667
  },
  "imageNames": [
    "Hercules_statue_by_William_Brodie_Portmeirion_Wales.jpg",
    "Portmeirion_Wales_48559387366.jpg",
    "Portmeirion_Wales_49280865701.jpg",
    "Portmeirion._48576915327.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1925,
  "end": 1975,
  "categoryId": "lleoedd",
  "id": "portmeirion",
  "label": "Portmeirion"
}