{
  "wikiSummary": "Cardiff is the capital and largest city of Wales. Cardiff had a population of 383,919 in 2024 and forms a principal area officially known as the City and County of Cardiff . The city is the eleventh largest in the United Kingdom. Located in the southeast of Wales and in the Cardiff Capital Region, Cardiff is the county town of the historic county of Glamorgan and in 1974–1996 of South Glamorgan. It belongs to the Eurocities network of the largest European cities. A small town until the early 19th century, its prominence as a port for coal when mining began in the region helped its expansion. In 1905, it was ranked as a city and in 1955 proclaimed capital of Wales. The Cardiff urban area covers a larger area outside the county boundary, including the towns of Dinas Powys and Penarth.\nCardiff is the main commercial centre of Wales as well as the base for the Senedd, the Welsh Parliament. At the 2021 census, the unitary authority area population was put at 362,400. The population of the wider urban area in 2011 was 479,000. In 2011, it ranked sixth in the world in a National Geographic magazine list of alternative tourist destinations. It is the most popular destination in Wales with 21.3 million visitors in 2017. It was voted as the best city in the UK at the 2023 Readers\u0027 Choice Awards.  \nCardiff is a major centre for television and film production and is the Welsh base for the main national broadcasters.\nCardiff Bay contains the Senedd building and the Wales Millennium Centre arts complex. Work continues at Cardiff Bay and in the centre on projects such as Cardiff International Sports Village, BBC drama village, and a new business district.",
  "wikiArticle": "Cardiff is the capital and largest city of Wales. Cardiff had a population of 383,919 in 2024 and forms a principal area officially known as the City and County of Cardiff . The city is the eleventh largest in the United Kingdom. Located in the southeast of Wales and in the Cardiff Capital Region, Cardiff is the county town of the historic county of Glamorgan and in 1974–1996 of South Glamorgan. It belongs to the Eurocities network of the largest European cities. A small town until the early 19th century, its prominence as a port for coal when mining began in the region helped its expansion. In 1905, it was ranked as a city and in 1955 proclaimed capital of Wales. The Cardiff urban area covers a larger area outside the county boundary, including the towns of Dinas Powys and Penarth.\nCardiff is the main commercial centre of Wales as well as the base for the Senedd, the Welsh Parliament. At the 2021 census, the unitary authority area population was put at 362,400. The population of the wider urban area in 2011 was 479,000. In 2011, it ranked sixth in the world in a National Geographic magazine list of alternative tourist destinations. It is the most popular destination in Wales with 21.3 million visitors in 2017. It was voted as the best city in the UK at the 2023 Readers\u0027 Choice Awards.  \nCardiff is a major centre for television and film production and is the Welsh base for the main national broadcasters.\nCardiff Bay contains the Senedd building and the Wales Millennium Centre arts complex. Work continues at Cardiff Bay and in the centre on projects such as Cardiff International Sports Village, BBC drama village, and a new business district.\r\n\r\n== History ==\n\n\n=== Etymology ===\nCaerdydd derives from the Middle Welsh Caerdyf. The change from -dyf to -dydd shows the colloquial alteration of Welsh f [v] and dd [ð] and was perhaps also driven by folk etymology. This sound change probably first occurred in the Middle Ages; both forms were current in the Tudor period. Caerdyf has its origins in post-Roman Brythonic words meaning \u0022the fort of the Taff\u0022. The fort probably refers to that established by the Romans. Caer is Welsh for fort and -dyf is a form of Taf , the river which flows by Cardiff Castle, with the ⟨t⟩ showing consonant mutation to ⟨d⟩, as is normal in compound words, and the vowel showing affection as a result of a genitive case ending.\nThe anglicised Cardiff is derived from Caerdyf, with the Welsh f [v] borrowed as ff , as also happens in Taff and Llandaff .\nThe antiquarian William Camden suggested that the name Cardiff may derive from *Caer-Didi , a name supposedly given in honour of Aulus Didius Gallus, governor of a nearby province at the time when the Roman fort was established. Although some sources repeat this theory, it has been rejected on linguistic grounds by modern scholars such as Professor Gwynedd Pierce.\n\n\n=== Origins ===\nArchaeological evidence from sites in and around Cardiff show that people had settled in the area by at least around 6000 BC, during the early Neolithic: about 1,500 years before either Stonehenge or the Great Pyramid of Giza was completed. These include the St Lythans burial chamber near Wenvoe, ; the Tinkinswood burial chamber, near St. Nicholas , the Cae\u0027rarfau Chambered Tomb, Creigiau and the Gwern y Cleppa long barrow, near Coedkernew, Newport . A group of five Bronze Age tumuli is at the summit of the Garth, within the county\u0027s northern boundary. Four Iron Age hill fort and enclosure sites have been identified within Cardiff\u0027s county boundaries, including Caerau Hillfort, an enclosed area of 5.1 hectares .\n\nUntil the Roman conquest of Britain, Cardiff was part of the territory of the Silures – a Celtic British tribe that flourished in the Iron Age – whose territory included the areas that would become known as Breconshire, Monmouthshire and Glamorgan. The 3.2 ha fort established by the Romans near the mouth of the River Taff in AD 75, in what would become the north western boundary of the centre of Cardiff, was built over an extensive settlement that had been established by the Romans in the 50s AD. The fort was one of a series of military outposts associated with Isca Augusta that acted as border defences. The fort may have been abandoned in the early 2nd century as the area had been subdued. However, by this time a civilian settlement, or vicus, was established. It was likely made up of traders who made a living from the fort, ex-soldiers and their families. A Roman villa has been discovered at Ely. Contemporary with the Saxon Shore forts of the 3rd and 4th centuries, a stone fortress was established at Cardiff. Similar to the shore forts, the fortress was built to protect Britannia from raiders. Coins from the reign of Gratian indicate that Cardiff was inhabited until at least the 4th century; the fort was abandoned towards the end of the 4th century, as the last Roman legions left the province of Britannia with Magnus Maximus.\nLittle is known of the fort and civilian settlement in the period between the Roman departure from Britain and the Norman Conquest. The settlement probably shrank in size and may even have been abandoned. In the absence of Roman rule, Wales was divided into small kingdoms; early on, Meurig ap Tewdrig emerged as the local king in Glywysing . The area passed through his family until the advent of the Normans in the 11th century.\n\n\n=== Norman occupation and Middle Ages ===\n\nIn 1081 William I, King of England visited Cardiff as part of an armed pilgrimage across South Wales and ordered work to begin on the castle keep within the walls of the old Roman fort. Cardiff Castle has been at the heart of the city ever since. The castle was substantially altered and extended during the Victorian period by John Crichton-Stuart, 3rd Marquess of Bute, and the architect William Burges. Original Roman work can, however, still be distinguished in the wall facings.\nA town grew up under the castle, consisting mainly of settlers from England. Cardiff had a population of between 1,500 and 2,000 in the Middle Ages – a normal size for a Welsh town in the period. It was the centre of the Norman Marcher Lordship of Glamorgan. By the end of the 13th century, Cardiff was the only town in Wales with a population exceeding 2,000, although it remained relatively small compared with notable towns in England and continued to be contained within its walls, which were begun as a wooden palisade in the early 12th century. It was of sufficient size and importance to receive a series of charters, notably in 1331 from William La Zouche, Lord of Glamorgan through marriage with the de Clare family, Edward III in 1359, then Henry IV in 1400, and later Henry VI.\nIn 1404, Owain Glyndŵr burned Cardiff and took possession of the Castle. As many of the buildings were made of timber and tightly packed within the town walls, much of Cardiff was destroyed. The settlement was soon rebuilt on the same street plan and began to flourish again. Besides serving an important political role in the governance of the fertile south Glamorgan coastal plain, Cardiff was a busy port in the Middle Ages and declared a staple port in 1327.\n\n\n=== County town of Glamorganshire ===\n\nIn 1536, the Laws in Wales Acts 1535–1542 led to the creation of Glamorganshire and Cardiff was made the county town, it also became part of Kibbor hundred, around the same time the Herberts became the most powerful family in the area. In 1538, Henry VIII closed Cardiff\u0027s Dominican and Franciscan friaries, whose remains were used as building materials. A writer in this period noted: \u0022The River Taff runs under the walls of his honours castle and from the north part of the town to the south part where there is a fair quay and a safe harbour for shipping.\u0022\nCardiff became a borough in 1542 and further Royal Charters were granted to it by Elizabeth I in 1600 and James I in 1608. In 1573, it was made a head port for collection of customs duties. Pembrokeshire historian George Owen described Cardiff in 1602 as \u0022the fayrest towne in Wales yett not the welthiest\u0022. It gained a second Royal Charter in 1608.\n\nA disastrous flood in the Bristol Channel on 30 January 1607 changed the course of the River Taff and ruined St Mary\u0027s Parish Church, which was replaced by a chapel of ease dedicated to St John the Baptist.\nDuring the Second English Civil War St Fagans, just to the west of the town, the Battle of St Fagans, between Royalist rebels and a New Model Army detachment, was a decisive victory for the Parliamentarians that allowed Oliver Cromwell to conquer Wales. It was the last major battle in Wales, with about 200, mostly Royalist soldiers killed.\nCardiff was at peace throughout the ensuing century. In 1766, John Stuart, 1st Marquess of Bute married into the Herbert family and was later created Baron Cardiff. In 1778, he began renovating Cardiff Castle. A racecourse, printing press, bank and coffee house opened in the 1790s and Cardiff gained a stagecoach service to London. Despite these improvements, Cardiff\u0027s position in the Welsh urban hierarchy declined over the 18th century. Iolo Morganwg called it \u0022an obscure and inconsiderable place\u0022 and the 1801 census found a population of only 1,870, making it only the 25th largest town in Wales, well behind Merthyr and Swansea.\n\n\n=== Building the docks ===\n\nIn 1793, John Crichton-Stuart, 2nd Marquess of Bute was born. He spent his life building the Cardiff docks and was later hailed as \u0022the creator of modern Cardiff\u0022. A twice-weekly boat service between Cardiff and Bristol opened in 1815, and in 1821, the Cardiff Gas Works was established.\nAfter the Napoleonic Wars Cardiff suffered some social and industrial unrest, starting with the trial and hanging of Dic Penderyn in 1831.\n\nThe town grew rapidly from the 1830s onwards, when the Marquess of Bute built a dock, which eventually linked to the Taff Vale Railway. Cardiff became the main port for coal exports from the Cynon, Rhondda, and Rhymney valleys, and grew in population at a rate of nearly 80 per cent per decade between 1840 and 1870. Much of this was due to migration from within and outside Wales: in 1841, a quarter of Cardiff\u0027s population were English-born and more than 10 per cent born in Ireland. By the 1881 census, Cardiff had overtaken Merthyr and Swansea to become the largest town in Wales. Cardiff\u0027s status as the premier town in South Wales was confirmed when it was chosen as the site for the University College of South Wales and Monmouthshire in 1883.\nA permanent military presence was established with the completion of Maindy Barracks in 1877.\nCardiff faced a challenge in the 1880s when David Davies of Llandinam and the Barry Railway Company promoted rival docks at Barry. These had the advantage of being accessible in all tides: David Davies claimed his venture would cause \u0022grass to grow in the streets of Cardiff\u0022. From 1901 coal exports from Barry surpassed those from Cardiff, but the administration of the coal trade remained centred on Cardiff, in particular its Coal Exchange, where the price of coal on the British market was determined and the first million-pound deal was struck in 1907. The city also strengthened its industrial base when the owners of the Dowlais Ironworks in Merthyr built a steelworks close to the docks at East Moors, which Lord Bute opened on 4 February 1891.\n\n\n=== County Borough of Cardiff ===\nCardiff became a county borough on 1 April 1889 under the Local Government Act 1888. The town had grown rapidly and had a population of over 123,000. It retained its county borough status until 1974.\n\n\n=== City and capital city status ===\n\nKing Edward VII granted Cardiff city status on 28 October 1905. It acquired a Roman Catholic cathedral in 1916. Later, more national institutions came to the city, including the National Museum of Wales, the Welsh National War Memorial, and the University of Wales Registry Building, but it was denied the National Library of Wales, partly because the library\u0027s founder, Sir John Williams, considered Cardiff to have \u0022a non-Welsh population\u0022.\nAfter a brief post-war boom, Cardiff docks entered a prolonged decline in the interwar period. By 1936, trade was at less than half its value in 1913, reflecting the slump in demand for Welsh coal. Bomb damage in the Cardiff Blitz of World War II included the devastation of Llandaff Cathedral, and in the immediate postwar years, the city\u0027s link with the Bute family came to an end.\nThe city was recognised as the capital city of Wales on 20 December 1955, in a written reply by the Home Secretary, Gwilym Lloyd George. Caernarfon had also vied for the title. Welsh local authorities had been divided: only 76 out of 161 chose Cardiff in a 1924 poll organised by the South Wales Daily News. The subject was not debated again until 1950, and meanwhile Cardiff took steps to promote its \u0022Welshness\u0022. The stalemate between Cardiff and cities such as Caernarfon and Aberystwyth was not broken until Cardiganshire County Council decided to support Cardiff; and in a new local authority vote, 134 out of 161 voted for Cardiff.\nCardiff therefore celebrated two important anniversaries in 2005. The Encyclopedia of Wales notes that the decision to recognise the city as the capital of Wales \u0022had more to do with the fact that it contained marginal Conservative constituencies than any reasoned view of what functions a Welsh capital should have.\u0022 Although the city hosted the Commonwealth Games in 1958, Cardiff became a centre of national administration only with the establishment of the Welsh Office in 1964, which later prompted the creation of various other public bodies such as the Arts Council of Wales and the Welsh Development Agency, most of which were based in Cardiff.\n\nThe East Moors Steelworks closed in 1978 and Cardiff lost population in the 1980s, consistent with a wider pattern of counter-urbanisation in Britain. However, it recovered to become one of the few cities outside London where population grew in the 1990s. During this period the Cardiff Bay Development Corporation was promoting the redevelopment of south Cardiff; an evaluation of the regeneration of Cardiff Bay published in 2004 concluded that the project had \u0022reinforced the competitive position of Cardiff\u0022 and \u0022contributed to a massive improvement in the quality of the built environment, although it had \u0022failed \u0022to attract the major inward investors originally anticipated\u0022.\nIn the 1997 Welsh devolution referendum, Cardiff voters rejected the establishment of the National Assembly for Wales by 55.4% to 44.2% on a 47% turnout, which Denis Balsom partly ascribed to a general preference in Cardiff and some other parts of Wales for a British rather than exclusively Welsh identity. The relative lack of local support for the Assembly and difficulties between the Welsh Office and Cardiff Council in acquiring the originally preferred venue, Cardiff City Hall, encouraged other local authorities to bid to house the Assembly. However, the Assembly was eventually located at Tŷ Hywel in Cardiff Bay in 1999. In 2005, a new debating chamber on an adjacent site, designed by Richard Rogers, was opened.\r\n\r\n== Government ==\n\nThe Senedd has been based in Cardiff Bay since its formation in 1999 as the \u0022National Assembly for Wales\u0022. The Senedd building was opened on 1 March 2006 by The Queen. The Members of the Senedd , the Senedd Commission and ministerial support staff are based in Cardiff Bay.\nCardiff elects four constituency Members of the Senedd to the Senedd; the constituencies for the Senedd are the same as for the UK Parliament. All of the city\u0027s electors have an extra vote for the South Wales Central regional members; this system increases proportionality to the Senedd. The most recent Senedd general election was held on 6 May 2021.\nIn the Senedd, Cardiff is represented by Jenny Rathbone in Cardiff Central, Julie Morgan in Cardiff North, former First Minister Mark Drakeford in Cardiff West and former First Minister Vaughan Gething in Cardiff South and Penarth.\n\nAt Westminster, Cardiff is represented by four constituencies: Cardiff East, Cardiff North, Cardiff South and Penarth, and Cardiff West.\nThe Welsh Government is headquartered in Cardiff\u0027s Cathays Park, where most of its civil servants are based, with smaller numbers in other central locations: Cathays, Canton, and Cardiff Bay. There are other Welsh Government offices in other parts of Wales, such as Llandudno and Aberystwyth, and there are international offices.\n\n\n=== Local government ===\n\nBetween 1889 and 1974 Cardiff was a county borough governed by Cardiff County Borough Council . Between 1974 and 1996, Cardiff was governed by Cardiff City Council, a district council of South Glamorgan. Since local government reorganisation in 1996, Cardiff has been governed by the City and County Council of Cardiff, based at County Hall in Atlantic Wharf, Cardiff Bay. Voters elect 75 councillors every four years.\nBetween the 2004 and 2012 local elections, no individual political party held a majority on Cardiff County Council. The Liberal Democrats held the largest number of seats and Cllr Rodney Berman was Leader of the council. The Liberal Democrats and Plaid Cymru formed a partnership administration. In the 2012 elections the Labour Party achieved an outright majority, after gaining an additional 33 seats across the city.\nCardiff is divided into communities, several with their own community council and the rest governed directly by Cardiff City Council. Elections are held every five years. The last contested elections would have been held at the same time as the 2017 Cardiff Council election had there been more candidates standing than available seats. Those with community councils are:\n\nLisvane Old St. Mellons Pentyrch Radyr \u0026 Morganstown Tongwynlais St Fagans == Geography ==\n\nThe centre of Cardiff is relatively flat and bounded by hills to the east, north and west. Its location influenced its development as the world\u0027s largest coal port, notably its proximity and easy access to the coalfields of the South Wales Valleys. The highest point in the local authority area is Garth Hill, 307 m above sea level.\nCardiff is built on reclaimed marshland on a bed of Triassic stones. This reclaimed marshland stretches from Chepstow to the Ely Estuary, which is the natural boundary of Cardiff and the Vale of Glamorgan. Triassic landscapes of this part of the world are usually shallow and low-lying, consistent with the flatness of the centre of Cardiff. The classic Triassic marl, sand and conglomerate rocks are used predominantly throughout Cardiff as building materials. Many of these Triassic rocks are purplish, especially the coastal marl found near Penarth. One of the Triassic rocks used in Cardiff is \u0022Radyr Stone\u0022, a freestone which as its name suggests is quarried in the Radyr district. Cardiff has also imported some materials for buildings: Devonian sandstones from the Brecon Beacons has been used. Most famously, the buildings of Cathays Park, the civic centre in the centre of the city, are built of Portland stone from Dorset. A widely used building stone in Cardiff is the yellow-grey Liassic limestone rock of the Vale of Glamorgan, including the rare \u0022Sutton Stone\u0022, a conglomerate of lias limestone and carboniferous limestone.\nCardiff is bordered to the west by the rural district of the Vale of Glamorgan, also known as the Garden of Cardiff, to the east by the city of Newport; to the north by the South Wales Valleys, and to the south by the Severn Estuary and Bristol Channel. The River Taff winds through the city centre and together with the River Ely flows into the freshwater Cardiff Bay. A third river, the Rhymney, flows through the east of the city directly into the Severn Estuary.\nCardiff lies near the Glamorgan Heritage Coast, stretching westward from Penarth and Barry – commuter towns of Cardiff – with striped yellow-blue Jurassic limestone cliffs. The Glamorgan coast is the only part of the Celtic Sea with exposed Jurassic geology. This stretch of coast with its reefs, sandbanks and serrated cliffs was a ship graveyard; many ships sailing to Cardiff during the industrial era were wrecked on this hostile coastline during west/south-westerly gales. Smuggling, deliberate shipwrecking and attacks on ships were also common.\r\n\r\n== Cityscape ==\n\n\u0022Inner Cardiff\u0022 consists of the wards of Plasnewydd, Gabalfa, Roath, Cathays, Adamsdown and Splott ward on the north and east of the city centre, and Butetown, Grangetown, Riverside and Canton to the south and west. The inner-city areas to the south of the A4161 road, known as the \u0022Southern Arc\u0022, are with the exception of Cardiff Bay some of the poorest districts of Wales, with low levels of economic activity. On the other hand, Gabalfa, Plasnewydd and Cathays north of the \u0027arc\u0027 have large student populations, and Pontcanna is a favourite for students and young professionals. Penylan, to the north east of Roath Park, is an affluent area popular with older parents and the retired.\nTo the west lie Ely and Caerau, which have some of the largest housing estates in the United Kingdom. With the exception of some outlying privately built estates at Michaelston-super-Ely, this is an economically disadvantaged area with high numbers of unemployed households. Culverhouse Cross is a more affluent western area of the city. Fairwater, Heath, Birchgrove, Gabalfa, Mynachdy, Llandaff North, Llandaff, Llanishen, Radyr, Whitchurch \u0026 Tongwynlais, Rhiwbina, Thornhill, Lisvane and Cyncoed lie in an arc from the north-west to the north-east of the centre. Lisvane, Cyncoed, Radyr and Rhiwbina contain some of the most expensive housing in Wales.\nFurther east lie the wards of Pontprennau and Old St Mellons, St Mellons, Rumney, Pentwyn, Llanrumney, Llanedeyrn and Trowbridge. The last four are largely public housing stock, although much new private housing is being built in Trowbridge. Pontprennau is the newest \u0022suburb\u0022 of Cardiff, while Old St Mellons has a history going back to the 11th-century Norman Conquest. The region that may be called \u0022Rural Cardiff\u0022 contains the villages of St Fagans, Creigiau, Pentyrch, Tongwynlais and Gwaelod-y-garth. In 2017, plans were approved for a new suburb of 7,000 homes between Radyr and St Fagans, known as Plasdŵr. St Fagans, home to the Museum of Welsh Life, is protected from further development.\nSince 2000, there has been a marked change of scale and building height in Cardiff, with the development of the city centre\u0027s first purpose-built high-rise apartments. Tall buildings have been built in the city centre and Cardiff Bay, and more are planned.\r\n\r\n== Climate ==\n\nCardiff, in the north temperate zone, has a maritime climate marked by mild weather that is often cloudy, wet and windy. Cardiff is one of the warmest and wettest cities in the UK, with an average annual temperature and rainfall of approximately 11°C and 1200mm respectively. Summers tend to be warm and sunny, with average maxima between 19 and 22 °C . Winters are fairly wet, but excessive rainfall as well as frost are rare. Spring and autumn feel similar, with mild temperatures averaging around 15°C as daytime maxima. Rain is unpredictable at any time of year, although showers tend to be shorter in summer.\nThe northern part of the county, being higher and inland, tends to be cooler and wetter than the city centre.\nCardiff\u0027s maximum and minimum monthly temperatures average 21.8 °C  and 2.5 °C  .For Wales, the temperatures average 19.3 °C  and 1.6 °C  .\nCardiff has 1,573 hours of sunshine in an average year . Cardiff is sunniest in July, with an average 199.6 hours during the month , and least sunny in December with 50.4 hours .\nCardiff experiences less rainfall than average for Wales. It falls on 153 days in an average year, with total annual rainfall of 1,203.3 mm . Monthly rainfall patterns show that from October to January, average monthly rainfall in Cardiff exceeds 100 mm each month, the wettest month being December with 139.6 mm and the driest from April to June, with average monthly rainfall fairly consistent between 70 and 80 mm .\r\n\r\n== Demography ==\n\nAfter a period of decline in the 1970s and 1980s, Cardiff\u0027s population is growing again. It reached 362,400 in the 2021 census, compared to a 2011 census figure of 346,100. Between mid-2007 and mid-2008, Cardiff was the fastest-growing local authority in Wales, with growth of 1.2%. According to 2001 census data, Cardiff was the 21st largest urban area in the United Kingdom. The Cardiff Larger Urban Zone has 841,600 people, the 10th largest LUZ in the UK. The Cardiff and South Wales Valleys metropolitan area has a population of nearly 1.1 million.\n\nOfficial census estimates of the city\u0027s total population have been disputed. The city council published two articles arguing that the 2001 census seriously under-reported the population of Cardiff, and in particular the ethnic minority population of some inner city areas.\nThe Welsh Government\u0027s official mid-year estimate of the population of the Cardiff local authority area in 2019 was 366,903. At the 2011, census the official population of the Cardiff Built Up Area was put at 447,287. The BUA is not contiguous with the local authority boundary and aggregates data at a lower level; for Cardiff this includes the urban part of Cardiff, Penarth/Dinas Powys, Caerphilly and Pontypridd.\nCardiff has an ethnically diverse population due to past trading connections, post-war immigration and large numbers of foreign students who attend university in the city. The ethnic make-up of Cardiff\u0027s population at the 2011 census was: 84.7% White, 1.6% mixed White and Black African/Caribbean, 0.7% mixed White and Asian, 0.6% mixed other, 8.1% Asian, 2.4% Black, 1.4% Arab and 0.6% other ethnic groups. This means almost 53,000 people from a non-white ethnic group reside in the city. This diversity, especially that of the city\u0027s long-established African and Arab communities, has been recorded in cultural exhibitions and events, along with books published on this subject.\n\n\n=== Health ===\n\nThere are seven NHS hospitals in the city, the largest being the University Hospital of Wales, which is the third largest hospital in the UK and deals with most accidents and emergencies. The University Dental Hospital, which provides emergency treatment, is also located on this site. Llandough Hospital is located in the south of the city.\nSt. David\u0027s Hospital, the city\u0027s newest hospital, built behind the former building, is located in Canton and provides services for the elderly and children. Cardiff Royal Infirmary is on Newport Road, near the city centre. The majority of this hospital was closed in 1999, but the west wing remained open for clinic services, genitourinary medicine and rehabilitation treatment. Rookwood Hospital and the Velindre Cancer Centre are also located within Cardiff. They are administered by the Cardiff and Vale University Health Board, with the exception of Velindre, which is run by a separate trust. Spire Healthcare, a private hospital, is in Pontprennau.\n\n\n=== Language ===\n\nCardiff has a chequered linguistic history with Welsh, English, Latin, Norse and Norman French preponderant at different times. Welsh was the majority language in Cardiff from the 13th century until the city\u0027s explosive growth in the Victorian era. As late as 1850, five of the 12 Anglican churches within the current city boundaries conducted their services exclusively in Welsh, while only two worshipped exclusively in English. By 1891, the percentage of Welsh speakers had fallen to 27.9% and only Lisvane, Llanedeyrn and Creigiau remained as majority Welsh-speaking communities. The Welsh language became grouped around a small cluster of chapels and churches, the most notable of which is Tabernacl in the city centre, one of four UK churches chosen to hold official services to commemorate the new millennium.\nThe city\u0027s first Welsh-language school was established in the 1950s. Welsh has since regained ground. Aided by Welsh-medium education and migration from other parts of Wales, there are now many more Welsh speakers: their numbers doubled between the 1991 and 2011 censuses, from 18,071 to 36,735 residents aged three years and above. The LSOA with the highest percentage of Welsh speakers in the city centre is found in Canton, at 25.5%. The LSOA with the highest percentage of Welsh speakers in the whole of Cardiff is Whitchurch, at 26%.\nCardiff City Council adopted a five-year Welsh-language strategy in 2017, aimed at increasing the number of Welsh speakers in Cardiff by 15.9%, from 36,735 in 2011 to 42,584 residents by the 2021 Census. The ONS estimated that in December 2020, 89,900 of Cardiff\u0027s population could speak Welsh.\nIn addition to English and Welsh, the diversity of Cardiff\u0027s population means that many other languages are spoken. One study has found that Cardiff has speakers of at least 94 languages, with Somali, Urdu, Bengali and Arabic being the most commonly spoken foreign ones.\nThe modern Cardiff accent is distinct from that of nearby South Wales Valleys. It is marked primarily by:\n\nSubstitution of ⟨iə⟩ by ⟨jøː⟩\nhere [hiːə] pronounced as [ jøː] in the broader form\nThe vowel of start may be realised as [æː] or even [ɛː], so that Cardiff is pronounced [ˈkæːdɪf].\n\n\n==== Language schools ====\nDue to its diversity and large student population, more people now come to the city to learn English. Foreign students from Arab states and other European countries are a common sight on the streets of Cardiff. The British Council has an office in the city centre and there are six accredited schools in the area.\n\n\n=== Religion ===\n\nSince 1922, Cardiff has included Llandaff within its boundary, along with the Anglican Llandaff Cathedral, the parish church of Llandaff and the seat of the Bishop of Llandaff, head of the Church in Wales and the Diocese of Llandaff.\nThere is a Roman Catholic cathedral in the city. Since 1916, Cardiff has been the seat of a Catholic archbishop, but there appears to have been a fall in the estimated Catholic population, with numbers in 2006 around 25,000 fewer than in 1980. Likewise, the Jewish population appears to have fallen – there are two synagogues in Cardiff, one in Cyncoed and one in Moira Terrace, as opposed to seven at the turn of the 20th century. There are several nonconformist chapels, an early 20th century Greek Orthodox church and 11 mosques. In the 2001 census, 66.9% of Cardiff\u0027s population described itself as Christian, a percentage point below the Welsh and UK averages.\nThe oldest of the non-Christian communities in Wales is Judaism. Jews were not permitted to live in England and Wales between the 1290 Edict of Expulsion and the 17th century. A Welsh Jewish community was re-established in the 18th century. There was once a fairly substantial Jewish population in South Wales, most of which has disappeared. The Orthodox Jewish community congregations are consolidated in the Cardiff United Synagogue in Cyncoed, which was dedicated by Chief Rabbi Jonathan Sacks in 2003. The Cardiff Reform Synagogue is in Adamsdown.\n\nCardiff\u0027s Muslim population is much above the Welsh average and the longest established in the UK, being started by Yemeni and Somali sailors settling in the 19th century. Cardiff now has over 11,000 Muslims with various national affiliations – nearly 52 per cent of the Muslim population in Wales.\nThe proportion of Cardiff residents declaring themselves Hindu, Sikh and Jewish were all considerably higher than the Welsh averages, but lower than the UK figures. The city has had a Hindu community since Indian immigrants settled in the 1950s and 1960s. The first Hindu temple in the city was opened in Grangetown on 6 April 1979 on the site of an abandoned synagogue. The 25th anniversary of the founding was celebrated in September 2007 with a parade of over 3,000 people through the city centre, including Hindus from across the United Kingdom and members of Cardiff\u0027s other religious communities. There are over 2,000 Hindus in Cardiff, worshipping at three temples.\nIn the 2001 census 18.8% of the city\u0027s population stated they had no religion, while 8.6% did not state a religion.\r\n\r\n== Economy ==\n\nAs the capital city of Wales, Cardiff is the main engine of growth in the Welsh economy. Though the population of Cardiff is about 10% of the Welsh population, the economy of Cardiff makes up nearly 20% of Welsh GDP and 40% of the city\u0027s workforce are daily in-commuters from the surrounding South Wales area.\nIndustry has played a major part in Cardiff\u0027s development for many centuries. The main catalyst for its transformation from a small town into a big city was the demand for coal required in making iron and later steel, brought to sea by packhorse from Merthyr Tydfil. This was first achieved by building a 25-mile canal from Merthyr to the Taff Estuary at Cardiff. Eventually the Taff Vale Railway replaced the canal barges and massive marshalling yards sprang up as new docks were developed in Cardiff – all prompted by the soaring worldwide demand for coal from the South Wales valleys.\nAt its peak, Cardiff\u0027s port area, known as Tiger Bay, became the busiest port in the world and – for some time – the world\u0027s most important coal port. In the years leading up to the First World War, more than 10 million tonnes of coal was exported annually from Cardiff Docks. In 1907, Cardiff\u0027s Coal Exchange was the first host to a business deal for a million pounds Sterling. The high demand for Welsh coal and specifically Welsh artificial fuel, named Patent Fuel, is shown by the numerous factories producing this fuel, with the same recipe, in the region of Cardiff. Most well known factories were the Star Patent fuel Co., the Crown Patent fuel, the Cardiff Patent fuel etc. After a period of decline, due to low demand on coal, Cardiff\u0027s port has started to grow again – over 3 million tonnes of cargo passed through the docks in 2007.\n\nCardiff today is the main finance and business services centre in Wales, with strong representation of finance and business services in the local economy. This sector, combined with the public administration, education and health sectors, have accounted for about 75% of Cardiff\u0027s economic growth since 1991. The city was recently placed seventh overall in the top 50 European cities in the fDI 2008 Cities of the Future list published by the fDi magazine, and ranked seventh in terms of attracting foreign investment. Notable companies such as Legal \u0026 General, Admiral Insurance, HBOS, Zurich, ING Direct, The AA, Principality Building Society, 118118, British Gas, Brains, SWALEC Energy and BT, all operate large national or regional headquarters and contact centres in the city, some of them based in Cardiff\u0027s office towers such as Capital Tower and Brunel House. Other major employers include NHS Wales and the Senedd. On 1 March 2004, Cardiff was granted Fairtrade City status.\nCardiff is one of the most popular tourist destinations in the United Kingdom, receiving 18.3 million visitors in 2010 and generating £852 million for the city\u0027s economy. One result is that one in five employees in Cardiff is based in the distribution, hotels and restaurants sector, highlighting the growing retail and tourism industries in the city. The city has many hotels of varying sizes and standards, providing almost 9,000 available beds.\n\nCardiff is home to the Welsh media and a large media sector with BBC Cymru Wales, S4C and ITV Wales all having studios in the city. There is a large independent TV production industry sector of over 600 companies, employing around 6,000, with a turnover estimated at £350 million. Just to the north-west of the city, in Rhondda Cynon Taff, the first completely new film studios in the UK for 30 years are being built, to be named Valleywood. The studios are set to be the biggest in the UK. In 2011 the BBC completed the Roath Lock studios in Cardiff Bay to film dramas such as Casualty, Doctor Who, and Pobol y Cwm.\nCardiff has several regeneration projects, such as St David\u0027s 2 Centre and surrounding areas of the city centre, and the £1.4 billion International Sports Village in Cardiff Bay, which played a part in the London 2012 Olympics. It features the only Olympic-standard swimming pool in Wales, the Cardiff International Pool, which opened on 12 January 2008.\nAccording to the Welsh Rugby Union, the Principality Stadium contributed £1 billion to the Welsh economy in the ten years after it opened in 1999, with around 85% of that staying in the Cardiff area.\n\n\n=== Shopping ===\n\nMost of Cardiff\u0027s shopping portfolio is in the city centre around Queen Street, St Mary Street and High Street, with large suburban retail parks in Cardiff Bay, Culverhouse Cross, Leckwith, Newport Road and Pontprennau, together with markets in the city centre and Splott. A £675 million regeneration programme for Cardiff\u0027s St. David\u0027s Centre was completed in 2009, providing a total of 1,400,000 sq ft of shopping space, making it one of the largest shopping centres in the United Kingdom. The centre was named the international shopping centre of the year in 2010 by Retail Leisure International .\n\nThe Castle Quarter is a commercial area in the north of the city centre, which includes some of Cardiff\u0027s Victorian and Edwardian arcades: Castle Arcade, Morgan Arcade and Royal Arcade, and principal shopping streets: St Mary Street, High Street, The Hayes, and Queen Street. Morgan Arcade is home to Spillers Records, the world\u0027s oldest record shop. Cardiff has a number of markets, including the vast Victorian indoor Cardiff Central Market and the newly established Riverside Community Market, which specialises in locally produced organic produce.\r\n\r\n== Transport ==\n\n\n=== Rail ===\n\nCardiff Central railway station is the largest railway station in Wales, with eight platforms coping with over 12.5 million passengers a year. It provides direct services to Bridgend and Newport, long-distance, cross-Wales services to Wrexham and Holyhead, and services to Bristol, Birmingham, Manchester and London. Cardiff Central Station is situated within the southern border of what was known Temperance Town, a former residential area within central Cardiff.\nCardiff Queen Street railway station is the second busiest in Wales and the hub for the Valley Lines services that connect the South Wales Valleys and the Cardiff suburbs with the city centre. It is located at the eastern end of the city centre and provides services to Cardiff Bay. Cardiff has a suburban rail system known as the Valleys \u0026 Cardiff Local Routes, operated by Transport for Wales. There are eight lines that serve 20 stations in the city, 26 in the wider urban area and more than 60 in the South Wales valleys and the Vale of Glamorgan.\n\n\n=== Metro ===\nThe South Wales Metro is an integrated public transport system under development in south-east Wales, centered on Cardiff. The project is to include the electrification of some of the existing railway lines and the creation of multiple light rail and light rapid transit lines. Four lines are under construction with a further three planned. The first lines will link Penarth and Cardiff Bay to Radyr, Treherbert, Aberdare and Merthyr Tydfil, with plans to also serve Pontyclun, St Mellons and Porth Teigr. Alongside this, current commuter services will be improved with a near-tripling in capacity on some routes to Bridgend and Rhymney.\n\n\n=== Air ===\n\nDomestic and international air links to Cardiff and South \u0026 West Wales are provided from Cardiff Airport , the only international airport in Wales. The airport lies in the village of Rhoose, 10 miles west of the city. There are regular bus services linking the airport with Cardiff city centre, and a train service from Rhoose Cardiff International Airport railway station to Cardiff Central.\n\n\n=== Road and bus ===\n\nThe M4 motorway connects Cardiff with Swansea to the west and Newport and London to the east, with four junctions on the M4, including one with the A48 . The A470 provides an important link from the city to the Heads of the Valleys road. When completed, the A4232 – also known as the Peripheral Distributor Road – will form part of the Cardiff ring-road system, along with the M4 motorway between junctions 30 and 33.\nCardiff has a comprehensive bus network, whose providers include the municipal bus company Cardiff Bus , Adventure Travel , Stagecoach South Wales and First Cymru . National Express and Megabus provides direct services to major cities such as Bristol, London, Newcastle upon Tyne and Manchester. Most bus services in the city use Cardiff Bus Interchange located next to Central Station, which opened in 2024 replacing an older structure on the same site, whilst intercity and coach services use the coach terminal located near Sophia Gardens in the north of the city centre.\n\n\n=== Cycle ===\n\nThe Taff Trail is a walking and cycle path running for 55 miles between Cardiff Bay and Brecon in the Brecon Beacons National Park. It runs through Bute Park, Sophia Gardens and many other green areas within Cardiff. It is possible to cycle the entire distance of the Trail almost completely off-road, as it largely follows the River Taff and many of the disused railways of the Glamorganshire valleys.\nNextbike previously operated a public bike-hire scheme in the city between March 2018 and January 2024, with the scheme allegedly being scrapped due to theft. Cardiff Council are seeking a replacement operator.\n\n\n=== Water ===\nThe Aquabus water taxi runs every hour between the city centre and Cardiff Bay , and between Cardiff Bay and Penarth Cardiff Bay Barrage. Throughout the year, Cardiff Waterbus sail between the Pierhead on The Waterfront and the Penarth end of the Cardiff Bay Barrage with short sightseeing cruises.\nBetween March and October boats depart from Cardiff Bay for Flat Holm Island. The PS Waverley and MV Balmoral sail from Britannia Quay to various destinations in the Bristol Channel.\r\n\r\n== Telecommunications ==\n\n029 is the current telephone dialling code for Cardiff, as well as for the neighbouring towns of Penarth, Dinas Powys and Caerphilly. The dialling code is optional when dialling within the area: one can dial between any two phones within the 029 code using only the eight-digit local number.\nPrior to the Big Number Change on 22 April 2000 the area had shorter, six-digit local numbers with an area code of 01222. This was 0222 before May 1995, derived from 0 , 22 and 2 . Before the introduction of automated trunk call dialling, non-local numbers were accessed through a system of manual telephone exchanges, in common with rest if the United Kingdom.\nThere remains a common misconception that local numbers are still six digits long and that the code is 02920, even though there are newer Cardiff numbers in the ranges 21xx xxxx and 22xx xxxx.\r\n\r\n== Education ==\n\nCardiff is home to four major institutions of higher education: Cardiff University, Cardiff Metropolitan University, University of South Wales and the Royal Welsh College of Music \u0026 Drama.\nCardiff University was founded by a royal charter in 1883 as the University College of South Wales and Monmouthshire, is a member of the Russell Group of leading research led universities, having most of its campus in Cathays and the city centre. Cardiff Metropolitan University has campuses in the Llandaff, Cyncoed and city centre areas, and is part of the confederal University of Wales. The Royal Welsh College of Music \u0026 Drama is a conservatoire established in 1949 and is based in the grounds of Cardiff Castle. The University of South Wales\u0027s Cardiff campus, Atrium, is home to the Cardiff School of Creative \u0026 Cultural Industries and is located in the city centre.\nThe total number of higher education students in the city is around 43,900. The city also has two further education colleges: Cardiff and Vale College and St David\u0027s College. The former is the result of a merger, completed in August 2011, between Coleg Glan Hafren and Barry College. Further education is also offered at most high schools in the city.\nCardiff has three state nursery schools , 98 state primary schools , and 19 state secondary schools . There are also several independent schools in the city, including St John\u0027s College, Llandaff Cathedral School, Cardiff Sixth Form College, Kings Monkton School and Howell\u0027s School, a single-sex girls\u0027 school . In 2013 Cardiff Sixth Form College came top of the independent senior schools in the UK, which were based on the percentage of A* and A at Advanced Level. Also in the top 100 were St John\u0027s College and Howell\u0027s School.\nNotable schools include Whitchurch High School , Fitzalan High School , and Ysgol Gyfun Gymraeg Glantaf .\nAs well as academic institutions, Cardiff is also home to other educational and learning organisations such as Techniquest, a hands-on science discovery centre that now has franchises throughout Wales, and is part of the Wales Gene Park in collaboration with Cardiff University, NHS Wales and the Welsh Development Agency . Cardiff is also home to a regional office of the International Baccalaureate Organisation .\r\n\r\n== Landmarks and attractions ==\n\nCardiff has many landmark buildings such as the Principality Stadium, Pierhead Building, the Welsh National Museum and the Senedd building, the home of the Welsh Parliament. Cardiff is also known for Cardiff Castle, St David\u0027s Hall, St John the Baptist Church, Llandaff Cathedral and the Wales Millennium Centre.\nCardiff Castle is a major tourist attraction in the city and is situated in the heart of the city centre. The National History Museum at St Fagans in Cardiff is a large open-air museum housing dozens of buildings from throughout Welsh history that have been moved to the site in Cardiff. The Civic Centre in Cathays Park comprises a collection of Edwardian buildings such as the City Hall, National Museum and Gallery of Wales, Cardiff Crown Court, and buildings forming part of Cardiff University, together with more modern civic buildings. These buildings are laid out around the Queen Alexandra Gardens, a formal park which contains the Welsh National War Memorial and a number of other, smaller memorials.\nIn addition to Cardiff Castle, Castell Coch is a castle in Tongwynlais, in the north of the city. The current castle is an elaborately decorated Victorian folly designed by William Burges for the Marquess and built in the 1870s, as an occasional retreat. However, the Victorian castle stands on the footings of a much older medieval castle possibly built by Ifor Bach, a regional baron with links to Cardiff Castle also. The exterior has become a popular location for film and television productions. It rarely fulfilled its intended role as a retreat for the Butes, who seldom stayed there. For the Marquess, the pleasure had been in its creation, a pleasure lost following Burges\u0027s death in 1881.\nCardiff claims the largest concentration of castles of any city in the world. As well as Cardiff Castle and Castell Coch, there are the remains of two motte-and-bailey castles in Morganstown and Rhiwbina, known as Morganstown Castle Mound and Twmpath Castle or Twmpath Motte respectively. Twmpath being a Welsh word for a small mound), which along with a castle at Whitchurch formed an arc of fortifications which divided the Norman lordship from the Welsh lordship of Senghenydd. Further up the Cefn Cibwr ridge on the boundary with Caerphilly there is also another ruined castle, known as Morgraig Castle . Archaeological evidence suggests this castle was never finished, and it is debated whether the fortification was of Norman or Welsh origin. The concentration of castles indicates the moveable nature of the border between the Norman lordship of Glamorgan, centred at Cardiff, and its Welsh neighbours to the north.\nThere is also the ruined Llandaff Bishop\u0027s Palace, also known as Llandaff Castle, which was the home of the medieval bishops, which was destroyed about 1403–1404 by the Welsh leader Owain Glyndŵr. Now only the ruined gatehouse remains. Not strictly a castle in the historical sense, Saint Fagans Castle is a preserved 17th-century manor house, once the seat of the Earls of Plymouth.\n\nOther major tourist attractions are the Cardiff Bay regeneration sites, which include the recently opened Wales Millennium Centre and the Senedd building, and many other cultural and sites of interest, including the Cardiff Bay Barrage and the famous Coal Exchange. The New Theatre was founded in 1906 and refurbished in the 1980s. Until the opening of the Wales Millennium Centre in 2004, it was the premier venue in Wales for touring theatre and dance companies. Other venues popular for concerts and sporting events include Cardiff International Arena, St David\u0027s Hall and the Principality Stadium. Cardiff Story, a museum documenting the city\u0027s history, has been open to the public since the spring of 2011.\nCardiff has over 1,000 listed buildings, ranging from the more prominent buildings such as the castles, to smaller buildings, houses and structures. Cathedral Road was developed by the 3rd Marquis of Bute and is lined by fine villas, some backing on to Sophia Gardens.\nCardiff has walks of special interest for tourists and ramblers alike, such as the Centenary Walk, which runs for 2\u002B1⁄4 miles within Cardiff city centre. This route passes through many of Cardiff\u0027s landmarks and historic buildings. The Animal Wall, designed by William Burges in 1866, marks the south edge of Bute Park on Castle Street. It bears 15 carved animal statues.\r\n\r\n== Culture and recreation ==\n\nCardiff has many cultural sites varying from the historical Cardiff Castle and out of town Castell Coch to the more modern Wales Millennium Centre and Cardiff Bay. Cardiff was a finalist in the European Capital of Culture 2008. In recent years Cardiff has grown in stature as a tourist destination, with recent accolades including Cardiff being voted the eighth favourite UK city by readers of the Guardian.\nThe city was also listed as one of the top 10 destinations in the UK on the official British tourist boards website Visit Britain, and US travel guide Frommers have listed Cardiff as one of 13 top destinations worldwide for 2008. Annual events in Cardiff that have become regular appearances in Cardiff\u0027s calendar include Sparks in the Park, The Great British Cheese Festival, Pride Cymru , Cardiff Winter Wonderland, Cardiff Festival and Made in Roath.\n\n\n=== Music and performing arts ===\n\nA large number of concerts are held in the city, the larger ones at St David\u0027s Hall, Cardiff International Arena and occasionally the Principality Stadium. A number of festivals are also held in Cardiff, the largest being the Cardiff Big Weekend Festival, held annually in the city centre in the summer and playing host to free musical performances , fairground rides and cultural events such as a Children\u0027s Festival that takes place in the grounds of Cardiff Castle. The annual festival claims to be the UK\u0027s largest free outdoor festival, attracting over 250,000 visitors in 2007.\nCardiff hosted the National Eisteddfod in 1883, 1899, 1938, 1960, 1978, 2008 and 2018. Cardiff is unique in Wales in having two permanent stone circles used by the Gorsedd of Bards during Eisteddfodau. The original circle stands in Gorsedd Gardens in front of the National Museum while its 1978 replacement is situated in Bute Park. Since 1983, Cardiff has hosted the BBC Cardiff Singer of the World competition, a world-renowned event on the opera calendar which is held every two years. The city also hosts smaller events.\nThe Wales Millennium Centre hosts performances of opera, ballet, dance, comedy, musicals and is home to the BBC National Orchestra of Wales. St David\u0027s Hall has regular performances of classical music and ballet as well as music of other genres. The largest of Cardiff\u0027s theatres is the New Theatre, situated in the city centre just off Queen Street. Other such venues include the Sherman Theatre, Chapter Arts Centre and the Gate Arts Centre.\nThe Cardiff music scene is established and wide-ranging: home to the BBC National Orchestra of Wales and the Welsh National Opera; has produced several leading acts; has acted as a springboard for Welsh bands to become famous. Acts hailing from Cardiff include Charlotte Church, Shirley Bassey, Iwan Rheon, the Oppressed, Kids In Glass Houses, Los Campesinos, the Hot Puppies, the School, We\u0027re No Heroes, Budgie and Shakin\u0027 Stevens. Also, artists such as Stereophonics, the Automatic, Manic Street Preachers, Lostprophets, Underworld, Super Furry Animals, Catatonia and Bullet for My Valentine have links with the city and are associated with the Cardiff music scene. In 2010, Cardiff was named the UK\u0027s second \u0022most musical\u0022 city by PRS for Music.\n\n\n=== Visual arts ===\n\nCardiff has held a photomarathon in the city each year since 2004, in which photographers compete to take the best 12 pictures of 12 previously unknown topics in 12 hours. An exhibition of winners and other entries is held in June/July each year.\n\n\n=== Sporting venues ===\nCardiff\u0027s former municipal baths opened in 1862, as Turkish Baths, and were taken over by the City Council in 1873, before closing over a century later. \nSporting venues include the Principality Stadium – the national stadium and home of the Wales national rugby union team – Sophia Gardens for Glamorgan County Cricket Club, Cardiff City Stadium for Cardiff City F.C. and the Wales football team, Cardiff International Sports Stadium, home of Cardiff Amateur Athletic Club, Cardiff Arms Park for Cardiff Blues and Cardiff RFC rugby union teams, and Ice Arena Wales for Cardiff Devils ice hockey team. It hosted the 1958 British Empire and Commonwealth Games and was dubbed European City of Sport for its role in international sporting events in 2009 and again in 2014. The Principality Stadium hosted 11 football matches during the 2012 Summer Olympics, including the opening event and the men\u0027s bronze medal match.\n\n\n=== Recreation ===\n\nCardiff has strong nightlife. Most clubs and bars are situated in the city centre, especially St Mary Street. More recently Cardiff Bay has built up a strong night scene, with many modern bars and restaurants. The Brewery Quarter on St Mary Street is a recently developed venue for bars and restaurant with a central courtyard. Charles Street is also a popular part of the city.\n\nCardiff is known for its extensive parks and other green spaces covering around 10% of the city\u0027s total area. Cardiff\u0027s main park, Bute Park extends northwards from the top of one of Cardiff\u0027s main shopping street ; when combined with the adjacent Llandaff Fields and Pontcanna Fields to the north-west it produces a massive open space skirting the River Taff. Other popular parks include Roath Park in the north, donated to the city by the 3rd Marquess of Bute in 1887, which includes a popular boating lake; Victoria Park, Cardiff\u0027s first official park; and Thompson\u0027s Park, formerly home to an aviary removed in the 1970s. Wild open spaces include Howardian Local Nature Reserve, 32 acres of the lower Rhymney valley in Penylan noted for its orchids, and Forest Farm Country Park, over 150 acres along the River Taff in Whitchurch.\r\n\r\n== Media ==\n\nCardiff is the Welsh base for the main national broadcasters . A locally based television station, Made in Cardiff, is also based in the city centre. Major filming studios in Cardiff include the BBC\u0027s Roath Lock Studios and Pinewood Studios Wales.\nSeveral contemporary television programmes and films are filmed in and/or set in Cardiff such as Casualty, Doctor Who, The Sarah Jane Adventures, Torchwood, Merlin, Class, The Valleys, Upstairs Downstairs, A Discovery of Witches, His Dark Materials, Being Human, The Story of Tracy Beaker, Wizards vs Aliens, Sex Education and Sherlock.\nThe main local newspaper is the South Wales Echo; the national paper is the Western Mail. Both are based in Park Street in the city centre. Capital Times, Echo Extra and the South Wales edition of Metro are also based and distributed in the city.\nThere are several magazines, including Primary Times and a monthly papur bro, and a Welsh-language community newsletter called Y Dinesydd . Radio stations serving the city and based in Cardiff include Capital South Wales, Heart South Wales, BBC Radio Wales, BBC Radio Cymru, Nation Radio Wales, Radio Cardiff, Smooth Wales and Xpress Radio.\nThe Principality Stadium was one of the first six British landmarks to be fully mapped on Google Street View as a 360-degree virtual tour.\r\n\r\n== Sport ==\n\nCardiff hosts many high-profile sporting events at local, national and international level and in recognition of the city\u0027s commitment to sport for all was awarded the title of European Capital of Sport 2014. Organised sports have been held in the city since the early 19th century. national home sporting fixtures are nearly always played in the city. All Wales\u0027s multi-sports agencies and many of the country\u0027s sports governing bodies have their headquarters in Cardiff and the city\u0027s many top quality venues have attracted world-famous sports events, sometimes unrelated to Cardiff or to Wales. In 2008/09, 61% of Cardiff residents regularly participated in sport and active recreation, the highest percentage in ll 22 local authorities in Wales.\nRugby union fans around the world have long been familiar with the old National Stadium, Cardiff Arms Park, and its successor the Principality Stadium, which hosted the FA Cup for six years it took to rebuild Wembley Stadium. In 2009, Cardiff hosted the first Ashes cricket test between England and Australia to be held in Wales. Cardiff hosted eight football matches of the London 2012 Olympics.\n\nCardiff City F.C. played their home games at Ninian Park from 1910 until the end of the 2008–09 season. The club\u0027s new home is the Cardiff City Stadium, which they initially rented to the Cardiff Blues, the city\u0027s professional rugby union team, the Blues returning to the Arms Park in 2012. Cardiff City have played in the English Football League since the 1920–21 season, climbing to Division 1 after one season. Cardiff City are the only non-English team to have won the FA Cup, beating Arsenal in the 1927 final at Wembley Stadium. They were runners up to Portsmouth in the 2008 final, losing 1–0 at the new Wembley Stadium. In the 2013/14 and 2018/19 seasons Cardiff City played in the English Premier League.\nCardiff Metropolitan University F.C. of the Athletic Union of Cardiff Metropolitan University, based in Cyncoed, play in the Cymru Premier, having been promoted from Welsh League Division One in 2016. They were winners of the Welsh League Cup for the 2018–19 season. \n\nCardiff has numerous smaller clubs including Bridgend Street A.F.C., Caerau A.F.C., Cardiff Corinthians F.C., Cardiff Grange Harlequins A.F.C., and Ely Rangers A.F.C., which all play in the Welsh football league system.\n\nIn addition to men\u0027s football teams Cardiff City Ladies of the FA Women\u0027s Premier League Southern Division are based in the city. Teams in the Welsh Premier Women\u0027s Football League are Cardiff Met. Ladies, Cyncoed Ladies and Cardiff City.\nDuring the 1990s, London-based football club Wimbledon FC expressed interest in relocating to Cardiff, having been without a home of their own since exiting Plough Lane stadium in 1991 and sharing with Crystal Palace FC at Selhurst Park. The relocation of the club to Cardiff did not happen; in 2003, the club moved to Milton Keynes and a year later rebranded as Milton Keynes Dons.\nCardiff Arms Park , in central Cardiff, is among the world\u0027s most famous venues—being the scene of three Welsh Grand Slams in the 1970s and six Five Nations titles in nine years—and was the venue for Wales\u0027s games in the 1991 Rugby World Cup. The Arms Park has a sporting history dating back to at least the 1850s, when Cardiff Cricket Club relocated to the site. The ground was donated to Cardiff CC in 1867 by the Marquess of Bute. Cardiff Cricket Club shared the ground with Cardiff Rugby Football Club — forming Cardiff Athletic Club between them — until 1966, when the cricket section moved to Sophia Gardens. Cardiff Athletic Club and the Welsh Rugby Union established two stadia on the site—Cardiff RFC played at their stadium at the northern end of the site, and the Wales national rugby union team played international matches at the National Stadium, Cardiff Arms Park, which opened in 1970. The National Stadium was replaced by the 74,500 capacity Millennium Stadium in 1999—in time for the 1999 Rugby World Cup—and is home stadium to the Wales national rugby and football teams for international matches. In addition to Wales\u0027s Six Nations Championship and other international games, the Principality Stadium held four matches in the 2007 Rugby World Cup and six FA Cup finals while Wembley Stadium was being rebuilt.\n\nCardiff Cricket Club was formed in 1819 and Glamorgan County Cricket Club has competed as a first-class county since 1921. Its headquarters and ground is the SWALEC Stadium, Sophia Gardens, since moving from Cardiff Arms Park in 1966. The Sophia Gardens stadium underwent multimillion-pound improvements since being selected to host the first \u0022England\u0022 v Australia Test match of the 2009 Ashes series. The Hundred franchise team Welsh Fire is also based at the stadium.\nCardiff has a long association with boxing, from \u0027Peerless\u0027 Jim Driscoll — born in Cardiff in 1880 — to more recent, high-profile fights staged in the city. These include the WBC Lennox Lewis vs. Frank Bruno heavyweight championship fight at the Arms Park in 1993, and many of Joe Calzaghe\u0027s fights, between 2003 and 2007.\nCardiff\u0027s professional ice hockey team, the Cardiff Devils, plays in the 3,000-seat Ice Arena Wales in the Cardiff International Sports Village. It plays in the 12-team professional Elite Ice Hockey League. Founded in 1986, it was one of the most successful British teams in the 1990s.\nCardiff\u0027s only American-flag football team is the Hurricanes. It won the British Championship in 2014 after falling short by 2 points in a quarter-final to eventual winners, the London Rebels, the previous year. It is based at Roath Recreational Ground.\n\nThe 1958 Commonwealth Games were hosted by Cardiff. These involved 1,130 athletes from 35 national teams competing in 94 events. One of the venues for those Games—The Wales Empire Swimming Pool—was demolished in 1998 to make way for the Principality Stadium. The GBP32m Cardiff International Pool in Cardiff Bay, opened to the public on 12 January 2008 — part of the GBP1bn International Sports Village — is the only Olympic-standard swimming pool in Wales. When complete, the ISV complex will provide Olympic standard facilities for sports including boxing and fencing, gymnastics, judo, white water events and wrestling as well as a snow dome with real snow for skiing and snowboarding, an arena for public ice skating and ice hockey and a hotel. Some of the sports facilities at the ISV were to be used as training venues for the London 2012 Olympics.\n\nThe Principality Stadium hosts motor-sport events such as the World Rally Championship, as part of Wales Rally GB. The first indoor special stages of the World Rally Championship were held at the Principality Stadium in September 2005 and have been an annual event since. The British Speedway Grand Prix, one of the World Championship events, is held at the Principality Stadium. While the track—a temporary, purpose built, shale oval—is not universally loved, the venue is considered the best of the World Championship\u0027s 11 rounds.\nThe Cardiff International Sports Stadium, opened 19 January 2009, replacing the Cardiff Athletics Stadium, demolished to make way for the Cardiff City Stadium. It has a 4,953 capacity as a multi sport/special event venue, offering certificated international track and field athletics facilities, including an international standard external throws area. The stadium houses the Headquarters of Welsh Athletics, the sport\u0027s governing body for Wales. The city\u0027s indoor track and field athletics sports venue is the National Indoor Athletics Centre, an international athletics and multi sports centre at the University of Wales Institute, Cardiff Campus, Cyncoed.\nThe Cardiff Half Marathon takes place each October and is one of the largest road races in the United Kingdom, attracting over 20,000 participants and many overseas visitors annually. The event is organised by the not-for-profit social enterprise Run 4 Wales, and has grown considerably since its establishment in 2003. It has hosted the World Commonwealth British and Welsh Half Marathon Championships and has held a World Athletics Elite Road Race Label since 2017. The race is also a part of the SuperHalfs, a series of leading international half marathon races which also includes Lisbon, Prague, Berlin, Valencia and Copenhagen.\r\n\r\n== Notable people ==\n\nMany notable people have hailed from Cardiff, ranging from historical figures such as the 12th-century Welsh leader Ifor Bach to more recent figures such as Roald Dahl, Ken Follett, Griff Rhys Jones, Catrin Dafydd, and the former Blue Peter presenter Gethin Jones.\nNotable actors include Ioan Gruffudd , Iwan Rheon and Matthew Rhys .\nAlso notable is Siân Grigg, BAFTA winner and Oscar nominated Hollywood make-up artist.\nThe city has been the birthplace of sports stars such as Tanni Grey-Thompson and Colin Jackson, as well as many Premier League, Football League and international footballers, such as Craig Bellamy, Gareth Bale, Ryan Giggs, Joe Ledley, and former managers of the Wales national football team Terry Yorath and John Toshack. International rugby league players from Cardiff include Frank Whitcombe, Billy Boston, David Willicombe and Colin Dixon. International rugby union players include Sam Warburton, Jamie Roberts, Jamie Robinson, Nicky Robinson, Rhys Patchell, and baseball internationals include George Whitcombe and Ted Peterson.\nSaint Teilo is the patron saint of Cardiff. He was a British Christian monk, bishop, and founder of monasteries and churches. Reputed to be a cousin, friend, and disciple of Saint David, he was Bishop of Llandaff and founder of the first church at Llandaff Cathedral, where his tomb is. His Saint\u0027s Day is 9 February.\nCardiff is also well known for its musicians. Ivor Novello inspired the Ivor Novello Awards. Idloes Owen, founder of the Welsh National Opera, lived in Llandaff. Dame Shirley Bassey was born and raised in Cardiff. Charlotte Church is famous as a crossover classical/pop singer. Shakin\u0027 Stevens was one of the top-selling male artists in the UK during the 1980s. Tigertailz, a popular glam metal act in the 1980s, also hailed from Cardiff. A number of Cardiff-based bands, such as Catatonia and Super Furry Animals, were popular in the 1990s. Drum and bass artist Mr. Traumatik, born and raised in Cardiff, gained popularity in the 2010s.\nTaff Groves, notably born and raised in Cardiff\u0027s Ely and Cathays districts is a former SAS soldier. He gained recognition during the 2013 Westgate shopping mall attack in Nairobi, Kenya, where he helped rescue hundreds of civilians while unarmed [1].\r\n\r\n== Twinning ==\nCardiff is twinned with:\n\nLuhansk, Ukraine\nHordaland county, Norway\nSucre, Bolivia\nNantes, France\nStuttgart, Germany\nXiamen, China\nLima, Peru\r\n\r\n== Namesakes ==\nIn the United States both Cardiff-by-the-Sea in Encinitas, California and Cardiff, Alabama were named after Cardiff in Wales. In New Zealand Cardiff, Taranaki was also named after Cardiff in Wales.\r\n\r\n== Diplomatic presence ==\nA total of 28 countries have a diplomatic presence in Cardiff. Many of these, such as Germany, Italy, Switzerland, Denmark, Canada, Thailand and the Czech Republic, are represented by honorary consulates. The United States Embassy to the UK operates a satellite office.\r\n\r\n== Freedom of the City ==\nThe following people and military units have received the Freedom of the City of Cardiff; they are listed with the date that they received the honour.\n\n\n=== Individuals ===\n\n\n=== Military units ===\nThe Welch Regiment: 10 June 1944\nThe Welsh Guards: 27 April 1957\nThe Royal Regiment of Wales: 11 June 1969\nThe Royal Welch Fusiliers: 7 November 1973\nThe 1st The Queen\u0027s Dragoon Guards: 29 July 1985\nHMS Cardiff, RN: 3 February 1988\nThe Merchant Navy Association : 3 September 2001\n203 Field Hospital RAMC: 21 April 2014\nHMS Dragon, RN: 18 May 2014",
  "location": {
    "lat": 51.48166667,
    "long": -3.17916667
  },
  "imageNames": [
    "71_Bridge_Street_1_Cardiff_city_centre.jpg",
    "A_view_of_the_jubilee_dock_Cardiff_from_the_eastern_side.jpeg",
    "Adeilad_y_Pierhead_Caerdydd.jpg",
    "Amgueddfa_Genedlaethol_Caerdydd.JPG",
    "Aquabushydro1.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1955,
  "categoryId": "lleoedd",
  "id": "prif-ddinas",
  "label": "Cardiff"
}