{
  "wikiSummary": "Rhodri ap Merfyn, commonly known as Rhodri Mawr , was a Welsh king whose legacy has impacted the history of Wales. Rhodri rose to power during a tumultuous era, where the fate of Welsh kingdoms was often determined by the power of their leaders.",
  "wikiArticle": "Rhodri ap Merfyn, commonly known as Rhodri Mawr , was a Welsh king whose legacy has impacted the history of Wales. Rhodri rose to power during a tumultuous era, where the fate of Welsh kingdoms was often determined by the power of their leaders.\r\n\r\n== Early life ==\nRhodri was born in the 9th century on the Isle of Man. Rhodri was the son of Merfyn Frych, who, under enigmatic circumstances, assumed the kingship of Gwynedd following the death of Hywel ap Caradog in 825. Rhodri ascended to the throne of Gwynedd following the passing of his father, Merfyn, in the year 844.\r\n\r\n== Reign ==\nRhodri\u0027s reign unfolded against a tumultuous backdrop, as Wales confronted escalating Viking incursions. Among Rhodri\u0027s earliest-recorded achievements was his defeat and killing of Gorm, a Danish chieftain, in a battle on Anglesey in 856. This victory garnered international acclaim, reaching the ears of Charles the Bald whose realm Gorm had previously harried.\n\nIn that same year, Rhodri finalised his subjugation of Powys following the death of its exiled ruler Cyngen in Rome. In 871, Rhodri expanded his dominion further, into Ceredigion following the death of its King Gwgon.\nDuring the year 873, Rhodri won two more successes against the Vikings by securing victories in the battles of Banolau and Ynegydd on Anglesey.\nIn 877, a Danish force, aided by their client king Ceolwulf, assailed Anglesey, intent on avenging Gorm\u0027s death and securing communication routes with Dublin. They succeeded in defeating Rhodri in the Battle of Sunday and seizing Anglesey, compelling him into exile on Ireland. The subsequent year marked Rhodri\u0027s return from Irish exile, winning a battle against the Vikings to retake Anglesey. However, Rhodri and his son Gwriad later perished in a battle against the Anglo-Saxons of Mercia under King Ceolwulf II of Mercia.\r\n\r\n== Succession ==\nRhodri\u0027s realm remained unified upon his demise, passing to his eldest son Anarawd. However, during Rhodri\u0027s exile, Ceredigion was conquered by Hyfaidd ap Bleddri, the King of Dyfed. Subsequently, Anarawd and Rhodri\u0027s other sons managed to reclaim Ceredigion and eventually extended their rule to the rest of Dyfed. This expansion established a distinct branch within the Merfynion dynasty, with Rhodri\u0027s second eldest son, Cadell, at its helm.\r\n\r\n== Children ==\nAnarawd ap Rhodri\nCadell ap Rhodri\nMeurig ap Rhodri\nMerfyn ap Rhodri\nGwriad ap Rhodri\nTudwal ap Rhodri\nGwyddelig ap Rhodri",
  "includeMainMenu": true,
  "amDdim": false,
  "start": 820,
  "end": 877,
  "categoryId": "arweinwyr",
  "id": "rhodri-mawr",
  "label": "Rhodri the Great"
}