{
  "wikiSummary": "The Roman era in the area of modern Wales began in 48 AD, with a military invasion by the imperial governor of Roman Britain. The conquest was completed by 78 AD, and Roman rule endured until the region was abandoned in 383 AD.\nThe Roman Empire held a military occupation in most of Wales, except for the southern coastal region of South Wales, east of the Gower Peninsula, where there is a legacy of Romanisation in the region, and some southern sites such as Carmarthen, which was the civitas capital of the Demetae tribe. The only town in Wales founded by the Romans, Caerwent, is in South Wales.\nWales was a rich source of mineral wealth, and the Romans used their engineering technology to extract large amounts of gold, copper, and lead, as well as modest amounts of some other metals such as zinc and silver.\nThe Roman campaigns of conquest in Wales are documented in surviving ancient sources, which record in particular the resistance and ultimate conquest of two of the five native tribes, the Silures of the south east, and the Ordovices of central and northern Wales.\nAside from the many Roman-related discoveries at sites along the southern coast, Roman archaeological remains in Wales consist almost entirely of military roads and fortifications.",
  "wikiArticle": "The Roman era in the area of modern Wales began in 48 AD, with a military invasion by the imperial governor of Roman Britain. The conquest was completed by 78 AD, and Roman rule endured until the region was abandoned in 383 AD.\nThe Roman Empire held a military occupation in most of Wales, except for the southern coastal region of South Wales, east of the Gower Peninsula, where there is a legacy of Romanisation in the region, and some southern sites such as Carmarthen, which was the civitas capital of the Demetae tribe. The only town in Wales founded by the Romans, Caerwent, is in South Wales.\nWales was a rich source of mineral wealth, and the Romans used their engineering technology to extract large amounts of gold, copper, and lead, as well as modest amounts of some other metals such as zinc and silver.\nThe Roman campaigns of conquest in Wales are documented in surviving ancient sources, which record in particular the resistance and ultimate conquest of two of the five native tribes, the Silures of the south east, and the Ordovices of central and northern Wales.\nAside from the many Roman-related discoveries at sites along the southern coast, Roman archaeological remains in Wales consist almost entirely of military roads and fortifications.\r\n\r\n== Wales before the Roman conquest ==\nArchaeologists generally agree that the British Isles were mainly inhabited by speakers of Celtic languages before the Roman invasion, organized into many tribes. The area now known as Wales had no political or social unity, and Romans did not treat it as a distinct region.\nNorthern and southern Wales had some notable cultural differences before the Roman invasion, and should not be considered one entity. Southern Wales was advancing along with the rest of Britain throughout the Iron Age, whereas the northern parts of Wales were conservative and slower to advance. Along with their technological advancement, from the fifth to the first century BC, southern Wales became more heavily and densely populated. Southern Wales had more in common with the north than it did with the rest of Britain, and they saw little outside influence until the Roman conquest.\nHill forts are one of the most common sites found throughout Iron-Age Wales, and this is what archaeologists mostly rely on for most of their evidence. Nevertheless, due to the relative lack of archaeological activity, survey groupings of these forts throughout Wales can be uneven or misleading. Modern scholars theorize that Wales before the Roman conquest was similar to the rest of Iron Age Britain; however, this is still debated due to the sparsity of evidence. For the most part, the region\u0027s archaeological legacy consists of burials and hill forts. Wales gradually stopped making pottery, which usually helps archaeologists explore the distant past, throughout the Iron Age. Archaeological assemblages such as the Wilburton complex suggest that there was trade throughout all of Britain including Wales, connecting with Ireland and Northern France.\r\n\r\n== Britain in 47 AD ==\n\nOn the eve of the Roman invasion of Wales, the Roman military under Governor Aulus Plautius was in control of all of southeastern Britain as well as Dumnonia, perhaps including the lowland English Midlands as far as the Dee Estuary and the River Mersey, and having an understanding with the Brigantes to the north. They controlled most of the island\u0027s centres of wealth, as well as much of its trade and resources.\nIn Wales the known tribes included the Ordovices and Deceangli in the north, and the Silures and Demetae in the south. Archaeology combined with ancient Greek and Roman accounts have shown that there was exploitation of natural resources, such as copper, gold, tin, lead and silver at multiple locations in Britain, including in Wales. Apart from this we have little knowledge of the Welsh tribes of this era.\r\n\r\n== Roman invasion and conquest ==\n\nThere is uncertainty regarding which parts of Wales were invaded by the Romans prior to the conquest of Anglesey in AD 60, due to a lack of written source material, with Tacitus as the only written source documenting this period.\nTacitus records that a tribe had attacked a Roman ally in Britain. According to Tacitus, the tribe that was responsible for this incursion was the \u0027Decangi\u0027, which scholars associate with the Welsh Deceangli. The Romans responded swiftly, imposing restrictions upon all of the suspected tribes, then they began to move against the Deceangli. The Roman conquest of this tribe is believed to have been between the years AD 48 or 49.\nShortly following this, the Romans campaigned against the Silures tribe of south-eastern Wales, which must have had previous encounters with the Roman army. Due to the Silures\u0027 ferocity and insubordination, the Romans built a legionary fortress to suppress them. The Silures were led by Caratacus, a king who had fled South-eastern England.  Under Caratacus\u0027 rule, the Welsh fought the Romans in a pitched battle which led to the loss of all the Ordovician territory. This defeat was not crushing, and Caratacus continued to fight the Romans, defeating two auxiliary cohorts. Caratacus fled to the Queen of the Brigantes, Cartimandua, who was loyal to the Romans and handed Caratacus over to Roman forces 51 AD. While dealing with all these problems, in AD 52, the Roman governor, Publius Ostorius Scapula, died. His death gave the Silures a respite before Scapula\u0027s successor, Didius Gallus, arrived. In that time, the Silures defeated a Roman legion led by Gaius Manlius Valens.\nIn AD 54, emperor Claudius died and was succeeded by Nero. This caused the situation in Britain to change, and Rome began to focus more on consolidating their power in Britain instead of expanding their territory. This is evidenced by the archaeological record, which finds vexillation fortresses at the time of Nero\u0027s accession.\nAfter a short period of relative inaction, Quintus Veranius became governor of Britain and decided it was time to conquer the rest of the British Isles. Veranius began to campaign against the Silures, but in AD 58 he died, one year after he was appointed to Britain. Suetonius Paulinus was his successor, and it would seem that Veranius had had some success in his campaigns because Paulinus began to shift north . Paulinus was quite successful in his conquest of northern Wales, and it would seem that by AD 60 he had pushed all the way to the Irish Sea because he was preparing for a conquest of Anglesey.\nAnglesey was swelling with migrants fleeing from the Romans, and it had become a stronghold for the Druids. Despite the Romans initial fear and superstition of Anglesey, they were able to achieve victory and subdue the Welsh tribes. However, this victory was short-lived, and a massive rebellion in the province of Britain led by Boudica erupted in the east and interrupted the consolidation of Wales.\nIt was not until AD 74 that Julius Frontinus resumed the campaigns against Wales. By the end of his term in AD 77, he had subdued most of Wales.\nOnly one tribe was left mostly intact throughout the conquest, the Demetae. This tribe did not oppose Rome, and developed peacefully, isolated from its neighbours and the Roman Empire. The Demetae were the only pre-Roman Welsh tribe to emerge from Roman rule with their tribal name intact.\r\n\r\n== Wales in Roman Society ==\n\n\n=== Mining ===\n\nThe mineral wealth of Britain was well-known prior to the Roman invasion and was one of the expected benefits of conquest. All mineral extractions were state-sponsored and under military control, as mineral rights belonged to the emperor. His agents soon found substantial deposits of gold, copper, and lead in Wales, along with some zinc and silver. Gold had been mined at Dolaucothi before the invasion, but Roman engineering was applied to greatly increase production of gold and other metals. This continued until the process was no longer practical or profitable, and the mine was abandoned.\nModern scholars have made efforts to quantify the value of these extracted metals to the Roman economy, and to determine the point at which the Roman occupation of Britain was \u0022profitable\u0022 to the Empire. While these efforts have not produced definitive results, the benefits to Rome were substantial. The gold production at Dolaucothi alone may have been of economic significance.\n\n\n=== Industrial production ===\n\nThe production of goods for trade and export in Roman Britain was concentrated in the south and east, with virtually none situated in Wales.\nThis was largely due to circumstance, with iron forges located near iron supplies, pewter moulds located near the tin supplies and suitable soil , clusters of pottery kilns located near suitable clayey soil, grain-drying ovens in agricultural areas where sheep were raised , and salt production concentrated in its historical pre-Roman locations. Glass-making sites were located in or near urban centres.\nIn Wales none of the needed materials were available in suitable combination, and the forested, mountainous countryside was not amenable to this kind of industrialisation.\nClusters of tileries, both large and small, were at first operated by the Roman military to meet their own needs, and so there were temporary sites wherever the army went and could find suitable soil. This included a few places in Wales. However, as Roman influence grew, the army was able to obtain tiles from civilian sources which located their kilns in the lowland areas containing good soil, and then shipped the tiles to wherever they were needed.\n\n\n=== Romanization ===\n\nThe Romans occupied the whole of the area now known as Wales, where they built Roman roads and castra, mined gold at Luentinum and conducted commerce, but their interest in the area was limited because of the difficult geography and shortage of flat agricultural land. Most of the Roman remains in Wales are military in nature. Sarn Helen, a major highway, linked the North with South Wales.\nThe area was controlled by Roman legionary bases at Deva Victrix and Isca Augusta , two of the three such bases in Roman Britain, with roads linking these bases to auxiliaries\u0027 forts such as Segontium and Moridunum .\nFurthermore, South-east Wales was the most Romanised part of the country. It is possible that Roman estates in the area survived as recognisable units into the eighth century: the kingdom of Gwent is likely to have been founded by direct descendants of the Silurian ruling class \u0027\nThe best indicators of Romanising acculturation is the presence of urban sites and villas in the countryside. In Wales, this can be said only of the southeasternmost coastal region of South Wales. The only civitates in Wales were at Carmarthen and Caerwent. There were three small urban sites near Caerwent, and these and Roman Monmouth were the only other \u0022urbanised\u0022 sites in Wales.\nIn the southwestern homeland of the Demetae, several sites have been classified as villas in the past, but excavation of these and examination of sites as yet unexcavated suggest that they are pre-Roman family homesteads, sometimes updated through Roman technology , but having a native character quite different from the true Roman-derived villas that are found to the east, such as in Oxfordshire.\nPerhaps surprisingly, the presence of Roman-era Latin inscriptions is not suggestive of full Romanisation. They are most numerous at military sites, and their occurrence elsewhere depended on access to suitable stone and the presence of stonemasons, as well as patronage. The Roman fort complex at Tomen y Mur near the coast of northwestern Wales has produced more inscriptions than either Segontium or Noviomagus Reginorum .\n\n\n=== Hill forts ===\nIn areas of civil control, such as the territories of a civitas, the fortification and occupation of hill forts was banned as a matter of Roman policy. However, further inland and northward, a number of pre-Roman hill forts continued to be used in the Roman Era, while others were abandoned during the Roman Era, and still others were newly occupied. The inference is that local leaders who were willing to accommodate Roman interests were encouraged and allowed to continue, providing local leadership under local law and custom.\r\n\r\n== Religion ==\nThere is virtually no evidence to shed light on the practice of religion in Wales during the Roman era, save the anecdotal account of the strange appearance and bloodthirsty customs of the druids of Anglesey by Tacitus during the conquest of Wales. It is fortunate for Rome\u0027s reputation that Tacitus described the druids as horrible, else it would be a story of the Roman massacre of defenceless, unarmed men and women. The likelihood of partisan propaganda and an appeal to salacious interests combine to suggest that the account merits suspicion.\nThe Welsh region of Britain was not significant to the Romanisation of the island and contains almost no buildings related to religious practice, save where the Roman military was located, and these reflect the practices of non-native soldiers. Any native religious sites would have been constructed of wood that has not survived and so are difficult to locate anywhere in Britain, let alone in mountainous, forest-covered Wales.\nThe time of the arrival of Christianity to Wales is unknown. Archaeology suggests that it came to Roman Britain slowly, gaining adherents among coastal merchants and in the upper classes first, and never becoming widespread outside of the southeast in the Roman Era. There is also evidence of a preference for non-Christian devotion in parts of Britain, such as in the upper regions of the Severn Estuary in the 4th century, from the Forest of Dean east of the River Wye continuously around the coast of the estuary, up to and including Somerset.\n\nIn the De Excidio et Conquestu Britanniae, written c. 540, Gildas provides a story of the martyrdom of Saint Alban at Verulamium, and of Julius and Aaron at Legionum Urbis, the \u0027City of the Legion\u0027, saying that this occurred during a persecution of Christians at a time when \u0027decrees\u0027 against them were issued. Bede repeats the story in his Ecclesiastical History, written c. 731. The otherwise unspecified \u0027City of the Legion\u0027 is arguably Caerleon, Welsh Caerllion, the \u0027Fortress of the Legion\u0027, and the only candidate with a long and continuous military presence that lay within a Romanised region of Britain, with nearby towns and a Roman civitas. Other candidates are Chester and Carlisle, though both were far from the Romanised area of Britain, and had a transitory, more military-oriented history.\nA parenthetical note concerns Saint Patrick, a patron saint of Ireland. He was a Briton born c. 387 in Banna Venta Berniae, whose location is unknown due to transcription errors in surviving manuscripts; his home is a matter of conjecture, with sites near Carlisle favoured by some, while coastal South Wales is favoured by others.\r\n\r\n== Irish settlement ==\n\nBy the middle of the 4th century, the Roman presence in Britain was no longer vigorous. Once-unfortified towns were now being surrounded by defensive walls, including both Carmarthen and Caerwent. Political control finally collapsed, and a number of alien tribes then took advantage of the situation, raiding widely throughout the island, joined by Roman soldiers who had deserted and by elements of the native Britons. Order was restored in 369, but Roman Britain did not recover.\nIt was at this time that Wales received an infusion of settlers from southern Ireland, the Uí Liatháin, Laigin, and possibly Déisi, the last no longer seen as certain, with only the first two verified by reliable sources and place-name evidence. The Irish were concentrated along the southern and western coasts, in Anglesey and Gwynedd , and in the territory of the Demetae.\nThe circumstances of their arrival are unknown, and theories include categorising them as \u0022raiders\u0022, as \u0022invaders\u0022 who established a hegemony, and as \u0022foederati\u0022 invited by the Romans. It might as easily have been the consequence of a depopulation in Wales caused by plague or famine, both of which were usually ignored by ancient chroniclers.\nWhat is known is that their characteristically Irish circular huts are found where they settled; that the inscription stones found in Wales, whether in Latin or ogham or both, are characteristically Irish; that when both Latin and ogham are present on a stone, the name in the Latin text is given in Brittonic form while the same name is given in Irish form in ogham; and that medieval Welsh royal genealogies include Irish-named ancestors who also appear in the native Irish narrative The Expulsion of the Déisi. This phenomenon may however be the result of later influences and again only the presence of the Uí Liatháin and Laigin in Wales has been verified.\r\n\r\n== End of the Roman era ==\n\nHistorical accounts tell of the upheavals in the Roman Empire during the 3rd and 4th centuries, with notice of the withdrawal of troops from Roman Britain in support of the imperial ambitions of Roman generals stationed there. In much of Wales, where Roman troops were the only indication of Roman rule, that rule ended when troops left and did not return. The end came to different regions at different times.\nTradition holds that Roman customs held on for several years in southern Wales, lasting into the late 5th and early 6th century, and that is true in part. Caerwent continued to be occupied after the Roman departure, while Carmarthen was probably abandoned in the late 4th century. In addition, southwestern Wales was the tribal territory of the Demetae, who had never become thoroughly Romanised. The entire region of southwestern Wales had been settled by Irish newcomers in the late 4th century, and it seems far-fetched to suggest that they were ever fully Romanised.\nHowever, in southeast Wales, following the withdrawal of the Roman legions from Britain, the town of Venta Silurum remained occupied by Romano-Britons until at least the early sixth century: Early Christian worship was still established in the town, that might have had a bishop with a monastery in the second half of that century.\nMagnus Maximus\n\nIn Welsh literary tradition, Magnus Maximus is the central figure in the emergence of a free Britain in the post-Roman era. Royal and religious genealogies compiled in the Middle Ages have him as the ancestor of kings and saints. In the Welsh story of Breuddwyd Macsen Wledig , he is Emperor of Rome and marries a wondrous British woman, telling her that she may name her desires, to be received as a wedding portion. She asks that her father be given sovereignty over Britain, thus formalising the transfer of authority from Rome back to the Britons.\n\nHistorically Magnus Maximus was a Roman general who served in Britain in the late 4th century, launching his successful bid for imperial power from Britain in 383. This is the last date for any evidence of a Roman military presence in Wales, the western Pennines, and Deva . Coins dated later than 383 have been excavated along the Wall, suggesting that troops were not stripped from it, as was once thought. In the De Excidio et Conquestu Britanniae written c. 540, Gildas says that Maximus left Britain not only with all of its Roman troops, but also with all of its armed bands, governors, and the flower of its youth, never to return. Having left with the troops and senior administrators, and planning to continue as the ruler of Britain, his practical course was to transfer local authority to local rulers. Welsh legend provides a mythic story that says he did exactly that.\nAfter he became emperor of the Western Roman Empire, Maximus returned to Britain to campaign against the Picts and Scots , probably in support of Rome\u0027s long-standing allies the Damnonii, Votadini, and Novantae . While there he likely made similar arrangements for a formal transfer of authority to local chiefs: the later rulers of Galloway, home to the Novantae, claimed Maximus as the founder of their line, as did the Welsh kings.\nMaximus ruled the Roman West until he was killed in 388. A succession of governors ruled southeastern Britain until 407, but there is nothing to suggest that any Roman effort was made to regain control of the west or north after 383; that year was the definitive end of the Roman era in Wales.\r\n\r\n== Legacy ==\nWendy Davies has argued that the later medieval Welsh approach to property and estates was a Roman legacy, but this issue and others related to legacy are not yet resolved. For example, Leslie Alcock has argued that that approach to property and estates cannot pre-date the 6th century and is thus post-Roman.\nLittle Latin linguistic heritage was left in the Welsh language, only a number of borrowings from the Latin lexicon. With the absence of early written Welsh sources there is no way of knowing when these borrowings were incorporated into Welsh; they may date from a later post-Roman era when the language of the literate was still Latin. Borrowings include a few common words and word forms. For example, Welsh ffenestr is from Latin fenestra, \u0027window\u0027; llyfr is from liber, \u0027book\u0027; ysgrif is from scribo, \u0027scribe\u0027; and the suffix -wys found in Welsh folk names is derived from the Latin suffix -ēnsēs. There are a few military terms, such as caer from Latin castra, \u0027fortress\u0027. Eglwys, meaning \u0027church\u0027, is ultimately derived from the Greek klēros.\nWelsh kings later used the authority of Magnus Maximus as the basis of their inherited political legitimacy. While imperial Roman entries in Welsh royal genealogies lack any historical foundation, they serve to illustrate the belief that legitimate royal authority began with Magnus Maximus. According to The Dream of Emperor Maximus, Maximus married a Briton, and their supposed children are given in genealogies as the ancestors of kings. Tracing ancestries back further, Roman emperors are listed as the sons of earlier Roman emperors, thus incorporating many famous Romans into the royal genealogies.\nThe kings of medieval Gwynedd trace their origins to the northern British kingdom of Manaw Gododdin , and they also claim a connection to Roman authority in their genealogies . This claim might have been an invention intended to rival the legitimacy of kings claiming descent from the historical Maximus.\nGwyn A. Williams argues that even at the time of the construction of Offa\u0027s Dyke the people to its west saw themselves as \u0022Roman\u0022, citing the number of Latin inscriptions still being made into the 8th century.",
  "imageNames": [
    "Aerial_view_of_Caerleon_Roman_amphitheatre.jpg",
    "Atlas_Van_der_Hagen-KW1049B11_031-WALLIA_PRINCIPATUS_Vulgo_WALES..jpeg",
    "Britain.Deisi.Laigin.jpg",
    "British.coinage.Roman.invasion.jpg",
    "Pillar_of_Eliseg.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 47,
  "end": 410,
  "categoryId": "lleoedd",
  "id": "rhufeiniaid",
  "label": "Romans"
}