{
  "wikiSummary": "S4C is a Welsh language free-to-air public broadcast television channel. Launched on 1 November 1982, it was the first television channel to be aimed specifically at a Welsh-speaking audience. S4C\u0027s headquarters are based in Carmarthen, at the University of Wales Trinity Saint David\u0027s creative and digital centre, Yr Egin. It also has regional offices in Caernarfon and Cardiff. As of 2024, S4C had an average of 118 employees. S4C is the fourth-oldest terrestrial television channel in Wales after BBC One, ITV and BBC Two.\nAs with Channel 4 , S4C commissions all of its programmes from independent producers. BBC Cymru Wales produces programmes for S4C as part of its public service remit, including the news service Newyddion. From its launch until 2010, S4C also carried English-language programming acquired from Channel 4, which could not be received over-the-air in most of Wales; these programmes aired in non-peak hours and did not always air in pattern with Channel 4\u0027s scheduling.\nS4C has been described by Elin Haf Gruffydd Jones as a \u0022trailblazer\u0022 in European broadcasting for minority languages, going on air less than two months before Euskal Telebista , TV3 Catalonia and Televisión de Galicia , the first Spanish regional television stations to go on air, symbolically, in non-Castillan Spanish areas, and far ahead of other Celtic-language services, Ireland\u0027s TG4  , the ill-fated Scottish Gaelic TeleG and BBC Alba . Unlike similar broadcasters in Spain who have multichannel offers impulsed mostly by digital terrestrial television, S4C still broadcasts on a single channel after the shutdown of S4C2.\nOn digital terrestrial television, S4C has broadcast exclusively in Welsh since the platform\u0027s launch in 1998, with the existing bilingual schedule continuing on analogue television. After the completion of the digital switchover in Wales on 31 March 2010, Channel 4 became available on Freeview, and S4C ceased its carriage of English-language programmes. S4C offers translated, English-language subtitles for its Welsh programming. To this day, S4C remains the only Welsh-language television broadcaster in the country.",
  "wikiArticle": "S4C is a Welsh language free-to-air public broadcast television channel. Launched on 1 November 1982, it was the first television channel to be aimed specifically at a Welsh-speaking audience. S4C\u0027s headquarters are based in Carmarthen, at the University of Wales Trinity Saint David\u0027s creative and digital centre, Yr Egin. It also has regional offices in Caernarfon and Cardiff. As of 2024, S4C had an average of 118 employees. S4C is the fourth-oldest terrestrial television channel in Wales after BBC One, ITV and BBC Two.\nAs with Channel 4 , S4C commissions all of its programmes from independent producers. BBC Cymru Wales produces programmes for S4C as part of its public service remit, including the news service Newyddion. From its launch until 2010, S4C also carried English-language programming acquired from Channel 4, which could not be received over-the-air in most of Wales; these programmes aired in non-peak hours and did not always air in pattern with Channel 4\u0027s scheduling.\nS4C has been described by Elin Haf Gruffydd Jones as a \u0022trailblazer\u0022 in European broadcasting for minority languages, going on air less than two months before Euskal Telebista , TV3 Catalonia and Televisión de Galicia , the first Spanish regional television stations to go on air, symbolically, in non-Castillan Spanish areas, and far ahead of other Celtic-language services, Ireland\u0027s TG4  , the ill-fated Scottish Gaelic TeleG and BBC Alba . Unlike similar broadcasters in Spain who have multichannel offers impulsed mostly by digital terrestrial television, S4C still broadcasts on a single channel after the shutdown of S4C2.\nOn digital terrestrial television, S4C has broadcast exclusively in Welsh since the platform\u0027s launch in 1998, with the existing bilingual schedule continuing on analogue television. After the completion of the digital switchover in Wales on 31 March 2010, Channel 4 became available on Freeview, and S4C ceased its carriage of English-language programmes. S4C offers translated, English-language subtitles for its Welsh programming. To this day, S4C remains the only Welsh-language television broadcaster in the country.\r\n\r\n== History ==\n\n\n=== Pre-launch ===\nBefore the launch of S4C on Monday 1 November 1982, Welsh speakers had been served by occasional programmes in Welsh, broadcast as regional opt-outs on BBC Cymru Wales and HTV Cymru Wales , as well as its predecessors usually at off-peak or inconvenient times. This was unsatisfactory for Welsh speakers, who saw the arrangement as a sop, and at the same time an annoyance for non-Welsh speakers, who found the English-language programmes seen in the rest of the UK often rescheduled or not transmitted at all.\nOn 14 September 1962, the ITV network created a licence area for North and West Wales, which was awarded to Wales Limited. This traded as Teledu Cymru and provided significant levels of Welsh-language programming. However, problems with transmission infrastructure and poor market research led to financial difficulties within two years, and after going bankrupt, the station was taken over by its neighbour Television Wales and the West.\nDuring the 1970s, coinciding with the push for a fourth national television channel in the UK, Welsh-language activists had campaigned for a television service in the language, which already had its own radio station, BBC Radio Cymru. Both the Conservative and Labour parties promised a Welsh-language fourth channel, if elected to government in the 1979 general election. Shortly after the Conservatives won a majority in the election, the new Home Secretary, William Whitelaw, decided against a Welsh fourth channel, and suggested that, except for an occasional opt-out, the service should be the same as that offered in the rest of the UK. This led to acts of civil disobedience, including refusals to pay the television licence fee, thereby running the risk of prosecution or even a prison sentence, and sit-ins in BBC and HTV studios. Some took more extreme measures, including attacking television transmitters in Welsh-speaking areas. \nBy the time of the Annan report , it was suggested that the fourth channel should be given to the Open Broadcasting Authority , which wouldn\u0027t start operating until the early 1980s, with Siberry suggesting the channel to be a BBC-HTV joint venture before being handed over to the OBA. Siberry on the other hand recommended a service broadcasting content in Welsh for 25 hours a week, double the planned hours another group had suggested. The transfer of the channel to the OBA when it was operational was deemed \u0022problematic\u0022, moving away from the concept of the creation of a Welsh-language channel and a separate Welsh Broadcasting Authority. The Welsh Language Society considered that \u0022the aim of the Report seemed to be find a way of keeping Welsh language broadcasting within the grasp of British infrastructure\u0022.\nThe government set up a Welsh Language Television Council, with members from the BBC, the IBA, ITV and the OBA, with an OBA member acting as a chairman. This was proven to be a significant step for the campaign, creating an organisation overseeing broadcasting in Wales. By 1980, when the initial plans fell, there were plans to move Welsh-language programming to BBC2 Cymru Wales. The BBC thought the idea was unviable, as its schedule was not designed to receive a consistent series of opt-out slots for regions and nations, and the only programme with a fixed starting slot started at 9pm. This meant that there was no set time to leave the opt-out programming and easily rejoin the BBC2 network. This would also lead to the loss of certain programmes, including sporting events, and a dedicated teatime children\u0027s slot would disrupt the sport output the channel had at the time, if available in the timeslot.\nOn 17 September 1980, the former president of Plaid Cymru, Gwynfor Evans, threatened to go on hunger strike if the Conservative government of Margaret Thatcher did not honour its commitment to provide a Welsh-language television service.\n\n\n=== Early years ===\nThe name S4C was the first thing to be decided at a meeting held in Gregynog on 31 January and 1 February 1981. No other names were considered for the new service. By year\u0027s end, when the IBA was adapting transmitters to enable the carriage of Channel 4 and S4C, no transmitters in northern Wales were converted, meaning that the population in an area with a significantly large Welsh-speaking population was to be deprived of the new service. Some transmitters were not scheduled to be adapted until 1985 at latest.\nS4C started broadcasting on 1 November 1982, broadcasting around 22 hours a week of programmes, mostly during prime time with a teatime slot for children; with English language programmes from Channel 4, rescheduled to fit around the Welsh programmes. The first night of the channel started at 6pm with a pre-recorded bilingual preview programme fronted by Owen Edwards, which also featured the first episode of SuperTed and excerpts of Channel 4\u0027s launch programme Preview, in anticipation for the latter\u0027s launch the following day. The launch programme was accompanied by Robin Jones, Siân Thomas and Rowena Jones-Thomas. SuperTed opened the floodgates for the development of animation in Wales, with or without S4C\u0027s support.\nS4C\u0027s bilingual nature rejected that the Welsh language had to be directly translated to English, as the English and Welsh viewing demographics differed heavily. Over time, the price per hour of the independent producers increased.\nOwen Edwards retired from his post at S4C in 1989, having just been diagnosed with Parkinson\u0027s disease.\n\n\n=== Later history ===\nTo prepare for the then-upcoming digital switchover in Wales, S4C announced in 2004 that S4C Digidol would start airing three hours of uninterrupted children\u0027s programmes a day, increase the amount of current affairs programmes and continue its sustainability.\nS4C faced an annus horribilis in 2010. Future prospects for the channel were seen with little optimism, owing to the change in the DCMS funding method, with S4C receiving £100 million, attached to the Retail Price Index. In 2013, it was announced that the DCMS would cut S4C\u0027s funding by around 93%. The funding hasn\u0027t exceeded the £100 million benchmark since then, with S4C reporting £74.5 million from the license fee in the 2020–21 fiscal year, and £6.851 from the DCMS. In 2022, the DCMS stopped funding S4C, freezing license fee contributions until 2024. This was considered to be an \u0022existential threat\u0022 to the Welsh language from Professor Richard Wyn Jones.\nAs with other public broadcasters, S4C is facing the challenge of adapting to an increasingly mobile generation of viewers, coupled with competition from streaming services.\n\n\n=== Relocation ===\n\nIn September 2013, S4C began a study into the possible relocation of its headquarters. S4C\u0027s former headquarters, which opened in 1991, were located at Parc Ty Glas Industrial Estate, Llanishen, following a move from Cathedral Road and Sophia Close in Pontcanna, Cardiff. In January 2013, a new multi-use media centre was opened on its Llanishen site. In March 2014, it was announced that Carmarthen was the winner with a bid led by the University of Wales Trinity Saint David . The university owns the land where the Canolfan S4C Yr Egin would be built. The building would also be home to other companies in the creative industries. There was a strong bid for relocation to Caernarfon, where the channel had a pre-existing office, but there was disappointment when that the bid was unsuccessful. In 2016, it was revealed that S4C was paying £3 million upfront rent to UWTSD, and that it would pay rent over the next 20 years. Concern was expressed about the arrangement and the lack of transparency around commercial payments between two publicly funded bodies. UWTSD applied for funding for the building work and received £3m from the Welsh Government and a further £3m from the Swansea Bay city deal.\n\nIn June 2018, it was revealed that more staff would be leaving the channel than moving to work in Carmarthen. S4C started relocating to the new building from September 2018, and 54 jobs moved to the new HQ. An office in Cardiff was retained for technical purposes until full changeover to the new BBC Wales Headquarters, with 70 staff there. A significant percentage of the technical posts were to transfer to the BBC. In September 2018, S4C committed to ten years of lease on its Caernarfon office at Doc Fictoria , which has 12 full-time staff, and was opened in 2008. In January 2021 S4C\u0027s Presentation, Library, Promotion and Commercial departments moved to BBC Wales headquarters in Central Square, Cardiff. The first programmes were broadcast from there on 27 January 2021, beginning with the channel\u0027s children\u0027s service, Cyw, at 6:00 a.m. Liz Scourfield\u0027s first live presentation aired later that morning, before the news bulletin at 12:00.\r\n\r\n== Programming ==\nS4C\u0027s remit is to provide a service which features a wide range of programmes in the Welsh language. Like Channel 4, S4C does not produce programmes of its own; instead, it commissions programmes from BBC Cymru Wales and independent producers , and much like Channel 4 during its heyday, it has developed a reputation for commissioning animation, such as SuperTed, Wil Cwac Cwac , Fireman Sam , Rocky Hollow, The Blobs , Gogs, Shakespeare: The Animated Tales, Animated Tales of the World and the 1992–1996 French co-production Natalie.\nBBC Cymru Wales fulfils its public service requirement by producing programmes in Welsh, including Newyddion, S4C\u0027s news bulletin, and a soap opera, Pobol y Cwm, and providing them to S4C free of charge. It has also provided Welsh-language versions of English-language programmes, such as the original Teletubbies. On the analogue service, S4C showed programmes produced for Channel 4 in the rest of the United Kingdom – either simultaneously or time-shifted – outside of peak hours. These programmes were provided to S4C by Channel 4, free of charge.\nTo make content more accessible to English speakers, all Welsh-language programming carries English subtitles. Originally these were on Sbectel teletext page 888, with Welsh subtitles on page 889, with both subtitle languages now also available on digital television platforms. For speakers of English who are learning Welsh, certain programmes, particularly children\u0027s programmes Planed Plant Bach and Planed Plant , carry subtitles featuring Welsh subtitles with additional English translations in brackets next to more difficult Welsh-language words. TV films produced for S4C have received some good foreign reviews; Hedd Wyn was nominated for the Best Foreign Language Oscar in 1994 and Solomon \u0026 Gaenor was nominated in 2000.\nThe S4C analogue signal also spilled over on to the east coast of Ireland. In the past it was rebroadcast in a number of areas there on UHF terrestrial signals by so-called \u0027deflectors\u0027. Up until the 1990s, S4C was also carried by some Irish cable and MMDS providers before being replaced by Channel 4. The S4C channels continue to be available in the Republic of Ireland via the Freesat satellite service.\nUp until 2009, S4C ran its own teletext service, Sbectel .\nIn 2010 when the analogue signal for S4C was switched off all Channel 4 programmes stopped broadcasting on the channel and were replaced by its own programmes and some from the BBC Cymru Wales catalogue.\n\n\n=== Distribution ===\nS4C\u0027s self-owned programmes are distributed internationally through S4C International .\nS4C formerly owned a selection of animated programmes, but on 2 October 2017, Hoho Entertainment acquired the broadcaster\u0027s animation back catalogue.\r\n\r\n== Viewing figures ==\n6.3 million people throughout the UK watched S4C on television at some time during 2022–2023. The number of people who watched S4C on TV every week throughout the UK decreased from 602,000 in 2021–2022 to 509,000 in 2022–2023. On an average week in 2022–2023, approximately 324,000 people in Wales watched S4C on TV – 8% higher than in 2021–2022 and the highest for five years. 150,000 Welsh speakers in Wales watched S4C on television each week during this period, which was 14% higher than in 2021–2022 and also the highest for five years. 20,600 was the average TV audience in the peak hours during 2022–2023.\nThe BARB rolling four-week viewing figures for January 2022 were 0.05% across the UK. If scaled up for Wales alone, this would be just a 1.0% audience share.\nViewing sessions of S4C content on S4C Clic and BBC iPlayer increased from 11.0 million in 2020–2021 to 11.3 million in 2021–2022. There were also 209 million impressions of S4C content on Facebook, Twitter and Instagram within that period.\nThe programme that enjoyed the channel\u0027s highest viewing figures in 2022-2023 was Sgorio\u0027s coverage of Wales\u0027 UEFA Nations League match against Belgium in September 2022, which drew 456,000 viewers.\r\n\r\n== Digital channels ==\nWhen digital terrestrial television launched in 1998, S4C added a second, full-time Welsh-language channel called S4C Digidol on 1 November 1998. Following the switch-off of analogue terrestrial signals on 31 March 2010, Wales became the first fully digital region in the UK, with both S4C and Channel 4 becoming available to all homes. As a result, S4C now broadcasts solely in the Welsh language and, as well as on Freeview in Wales, is available throughout Britain, Ireland and the rest of western Europe on Freesat and Sky. A review commissioned by the Department for Culture, Media and Sport in 2004 suggested that \u0022S4C should operate a single core service after digital switchover\u0022.\n\nIn addition, S4C also operated a sister channel, S4C2 until 2010. It formerly broadcast coverage of the National Assembly for Wales when in session. The programme content was provided by the BBC who, from January 2010, now make it available online and via BBC Parliament. Like the main channel, S4C2 was available within Wales on Freeview and throughout the UK and Ireland on Freesat and Sky. S4C2 had two audio feeds, allowing viewers to select between an untranslated version and an English-only version where all Welsh spoken is translated into English. Delayed coverage of Assembly proceedings is now broadcast overnight on S4C\u0027s main channel on Tuesdays, Wednesdays and Thursdays. In addition to the analogue TV signal transmitted throughout Wales, S4C, along with United News \u0026 Media, owned the company S4C Digital Networks . SDN was awarded the UK-wide contract to provide half a digital multiplex worth of programming. The other half continues to belong to the broadcaster Channel 5.\nOn 27 April 2005, S4C sold its share of SDN to ITV plc for approximately £34 million, though it still has the half-multiplex as of right in Wales. ITV already owned some of SDN due to the consolidation of the ITV industry: Granada bought UNM\u0027s stake in SDN, and this was then incorporated into the united ITV plc. In January 2007, S4C announced plans to launch a Welsh-language children\u0027s service. The new service, in the form of a programming block, launched on 23 June 2008. Under the name Cyw , it brings together a wide range of programmes for nursery-age children, and S4C plans eventually to extend the service to include the Stwnsh strand for older children and a third service for teenagers and young people. The service currently airs on weekdays from 7 am to 1.30 pm on S4C.\nS4C launched a high-definition simulcast of S4C called \u0027Clirlun\u0027 on 19 July 2010 to coincide with terrestrial digital switchover in Wales. Clirlun was broadcast on Freeview channel 53 only, and not via other platforms. However, following funding cuts and a review of core services it was announced on 11 July 2012 that Clirlun would close before the end of the year. Clirlun closed at midnight on the evening of 1 December 2012, with Channel 4 HD taking over its transmission capacity with effect from the next day, 2 December 2012.\nIt was announced on 20 May 2016 that S4C would relaunch a high definition service S4C HD on Freesat and Sky in Wales and across the UK from 7 June onwards. Following the 2016 relaunch of S4C HD, the channel returned to Freeview in HD from 7pm on Wednesday 19 January 2022. It will broadcast for peak viewing hours only, from 7pm on weekday evenings and from 2pm on weekends, sharing capacity with the HD version of the BBC\u0027s children\u0027s service CBBC.\nIn December 2014, S4C became available on the BBC iPlayer website, both live and on demand, initially as part of an 18-month trial.\r\n\r\n== Presentation ==\n\n\n=== 1982–1987 ===\n\nS4C launched on 1 November 1982 , its on-air appearance has always been a representation of Welsh society and people, but this representation has changed several times. Initial idents featured clips from the natural landscapes of Wales with a basic logo animation and a synthesizer fanfare, with the logo forming as WALES4CYMRU. The logo was designed by Martin Lambie-Nairn, who also designed Channel 4\u0027s logo.\n\n\n=== 1987–1993 ===\n\nOn 25 May 1987, the ident changed to a computer-generated ident featuring an animation of the streamlined S4C logo and the colours of the logo was blue, green, and red. The font used for this logo was a modified Bodoni MT. The new identity improved the channel\u0027s corporate image, removing the complex WALES4CYMRU branding. On 7 September 1990, the new ident was introduced, depicting a piece of Welsh slate with colours blue, green, and red washing over the letters S4C until 31 May 1993.\n\n\n=== 1993–2007 ===\n\nOn 1 June 1993, S4C introduced a new series of idents, which depicted inanimate objects as having characteristics of dragons , as a reference to the red dragon on the flag of Wales. In June 1995, the channel introduced a new logo replaces the original serif logo, featuring a tilde representing a dragon with a flame next to the \u0022C\u0022 as if were breathing fire. The addition of such a symbol would reflect \u0022Welsh heritage and culture\u0022 and that the flame was \u0022cheap to reproduce\u0022. The symbol worked both in red and black and white settings, something the previous logo didn\u0027t. The idents were designed, created, and directed by Charlotte Castle, Brian Eley, and Martin Lambie-Nairn.\n\n\n=== 2007–2014 ===\n\nOn 18 January 2007, S4C announced that their digital channels would be refreshed with a new corporate logo and brand. The new branding was implemented online on 17 January, with S4C\u0027s television channels adopting it the next day. The new branding, developed by the London-based firm Proud Creative, was intended to portray S4C as a more \u0022contemporary\u0022 multi-platform broadcaster, and downplayed \u0022traditional\u0022 Welsh imagery such as dragons. Its idents were filmed around various parts of the country, and themed around magnetism—representing the \u0022uncontrollable attraction\u0022 of Welsh people and their \u0022emotional affinity to the homeland, whether near or far\u0022. The magnetism-themed idents were later accompanied by a new set developed in collaboration with the agency Minivegas, consisting of live-action scenes with dynamic, animated elements that can react to the voice of the continuity announcer.\n\n\n=== 2014–present ===\nA new S4C logo and brand developed by Sugar Creative was introduced on 10 April 2014; the new design was developed around the concept of providing \u0022context\u0022 to S4C\u0027s target audience and programming. The design revolves heavily around a trapezium shape used within the channel\u0027s new logo, which is prominently used within aspects of the channel\u0027s overall marketing and branding.\r\n\r\n== Criticisms ==\nS4C has faced criticism for poor viewing figures since its launch. Leaked internal reports in March 2010 showed that \u0027over the 20-day period from 15 February to last Saturday, 6 March, as many as 196 of the 890 programmes put out by S4C were rated as having zero viewers\u0027. The story was widely reported across the UK and was referenced in Parliament by the then Culture Secretary, Jeremy Hunt. In response, an S4C spokesperson stated that 90% of those programmes were aimed at pre-school children, and that BARB only takes into account viewers aged four years and over. The remaining 10% consisted of repeats and daytime news bulletins which did not attract the minimum 1,000 viewers necessary to register on a UK-wide analysis.\nOn 28 July 2010, S4C\u0027s chief executive, Iona Jones, left her post without explanation. Assembly members and Members of Parliament requested an independent investigation into the circumstances leading up to her departure. The S4C Authority refused to comment further and commissioned a review into how the broadcaster was governed in August 2010. On 3 February 2011, it was announced that issues between Iona Jones and S4C had been settled. Eight days later, the Shortridge Report on corporate governance was made public.\r\n\r\n== Chief Executives ==\n1981–1989: Owen Edwards\n1989–1994: Geraint Stanley Jones\n1994–2005: Huw Jones\n2005–2010: Iona Jones\n2010–2012: Arwel Ellis Owen 2012–2017: Ian Jones\n2017–2022: Owen Evans\n2022—2023: Siân Doyle\n2024: Sioned Wiliam 2024–present: Geraint Evans\r\n\r\n== Funding and regulation ==\nFrom its inception, S4C was in part publicly financed: funding came both from its advertising revenue and a fixed annual grant from the Department for Culture, Media and Sport , receiving £102m in 2010 and then £90m in 2011 after the Conservative Party won the general elections in 2010 which consequently made considerable cuts to its funding. Additionally, some Welsh-language programming was produced by BBC Wales as part of the BBC\u0027s public service remit, and provided to S4C free of charge. There is an agreement in place until 2022 for 10 hours a week of programming to be provided to S4C, which is valued at £19.4m annually.\nFrom 2013, responsibility for funding S4C began to transfer to the BBC, with the DCMS reducing its funding by 94% by 2015. The BBC was to provide around £76m of funding to S4C by this date, resulting in a cut of around 25% to S4C\u0027s annual budget. In 2016, it was agreed that the BBC would provide £74.5m a year funding to S4C from the licence fee until 2022. The UK government announced in 2018 that it would continue providing £6.72m until 2020, with the aim of S4C being funded wholly from the licence fee from 2022. This would see S4C\u0027s funding being decided as part of the licence fee settlement, for 10-year periods.\nPrior to 2011, S4C received ~£102m , with the new allocated funds of 2022 , the loss in 2022 alone compared with 2010 is estimated to be ~£40.8m and an overall loss of ~£450m between 2011 and 2022.\nIn addition to public funding, S4C generates around 2% of its income through commercial sources, such as advertising.\nS4C was controlled from its creation by the S4C Authority , an independent body unconnected to Ofcom. Following an independent review of S4C, the S4C Authority was replaced with a unitary board, initially in shadow form from 2018, and then formally from 2024. Ofcom are the regulator for S4C\u0027s content, as they are with other UK television channels such as ITV and Channel 4.\r\n\r\n== Catch-up service ==\n\nS4C maintains its own catch-up service called Clic. Clic is a free online video on demand service which offers live-streaming, signed programming, a 35-day catch-up service, and archive programming. Clic is available across the UK but also contains a limited selection of worldwide programming. Clic\u0027s catch-up service is split into seven categories: Drama, Entertainment, Factual and Arts, Music, Sport, and two Children\u0027s categories,  Cyw and Stwnsh . A Clic app was released for Apple\u0027s iOS devices on 18 August 2011.\nIn late 2014, S4C\u0027s programmes and live-streaming also became available to view on the BBC\u0027s catch-up service, BBC iPlayer. It contains no advertisements, with commercial breaks instead displaying a static screen saying \u0027Programmes will continue after the break\u0027. Both services offer English and Welsh subtitles to some shows.\nThere were 8.2 million viewing sessions to S4C content on Clic and BBC iPlayer in 2017–2018. This was an increase of 600,000 from the 7.6 million viewing sessions on those platforms in 2016–2017. In the 2020–2021 period, the viewing session number increased to 11 million. Viewing figures on Clic and iPlayer was at an all-time high in 2022–23. 596,000 hours of S4C content was viewed on Clic during that year. A further 2,680,000 hours of content was viewed on the iPlayer.",
  "imageNames": [
    "BBC_Cymru_Wales_geograph_6226511_cropped.jpg",
    "CCTV_cameras_on_a_pole_Cathedral_Road_Cardiff_-_geograph.org.uk_-_4088227.jpg",
    "Canolfan_S4C_Yr_Egin_cropped.jpg",
    "Doc_Fictoria_-_Caernarfon_Marina_geograph_7115219.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1982,
  "categoryId": "modern",
  "id": "s4c",
  "label": "S4C"
}