{
  "wikiSummary": "St Fagans National Museum of History , commonly referred to as St Fagans after the village where it is located, is an open-air museum in St Fagans, Cardiff, Wales, chronicling the historical lifestyle, culture, and architecture of the Welsh people. The museum is part of the wider network of Amgueddfa Cymru – Museum Wales.\nIt consists of more than forty re-erected buildings from various locations in Wales, and is set in the grounds of St Fagans Castle, a Grade I listed Elizabethan manor house. In 2011 Which? magazine named the museum the United Kingdom\u0027s favourite visitor attraction.\nA six-year, £30-million revamp was completed in 2018 and the museum was named the Art Fund Museum of the Year in 2019.",
  "wikiArticle": "St Fagans National Museum of History , commonly referred to as St Fagans after the village where it is located, is an open-air museum in St Fagans, Cardiff, Wales, chronicling the historical lifestyle, culture, and architecture of the Welsh people. The museum is part of the wider network of Amgueddfa Cymru – Museum Wales.\nIt consists of more than forty re-erected buildings from various locations in Wales, and is set in the grounds of St Fagans Castle, a Grade I listed Elizabethan manor house. In 2011 Which? magazine named the museum the United Kingdom\u0027s favourite visitor attraction.\nA six-year, £30-million revamp was completed in 2018 and the museum was named the Art Fund Museum of the Year in 2019.\r\n\r\n== History ==\nThe museum was founded in 1946 following the donation of the castle and lands by the Earl of Plymouth. It opened its doors to the public in 1948, under the name of the Welsh Folk Museum. The museum\u0027s name in Welsh has remained unchanged since that date, whereas the English title was revised to Museum of Welsh Life, thereafter St Fagans National History Museum, and again to its current title.\nThe brainchild of Iorwerth Peate, the museum was modelled on Skansen, the outdoor museum of vernacular Swedish architecture in Stockholm. Most structures re-erected in Skansen were built of wood and are thus easily taken apart and reassembled, but a comparable museum in Wales was going to be more ambitious, as much of the vernacular architecture of Wales is made of masonry.\n\n\n=== 2017 refurbishment ===\nA redeveloped main reception building was opened in July 2017. The six-year, £30-million redevelopment of the site, which was funded by a number of sources, notably the Welsh Government and the National Lottery, was completed in October 2018.\nThe £30-million redevelopment project provided many benefits, including three new galleries showcasing Wales’ history, improvements to buildings such as the Iron Age farmstead, Bryn Eryr, and Medieval Prince\u0027s court and Llys Llywelyn, as well as a refurbished main entrance building and a new restaurant, play area and learning spaces. One of the new buildings, the Gweithdy , features Stone Age tools and stick chairs.\nIn June 2019, St Fagans was named UK\u0027s Museum of the Year 2019 by the Art Fund, which commended the facility\u0027s \u0022exceptional imagination, innovation and achievement\u0022.\r\n\r\n== Buildings and exhibits ==\n\nThe museum comprises more than forty buildings representing the architecture of Wales, including a nonconformist chapel , a village schoolhouse, a toll road tollbooth , a cockpit , a pigsty , and a tannery .\nThe museum holds displays of traditional crafts, with a working blacksmith forge, a pottery, a weaver, a miller, and a clog maker. It also includes two working water mills: one flour mill and one wool mill. Part of the site includes a small working farm which concentrates on preserving local Welsh native breeds of livestock. Produce from the museum\u0027s bakery and flour mill is available for sale.\nThe medieval parish church of Saint Teilo, formerly at Llandeilo Tal-y-bont in west Glamorgan , was opened in October 2007 by the Archbishop of Canterbury, Rowan Williams, and still serves as a place of worship for Christmas, Easter, and Harvest Thanksgiving. A Tudor merchant\u0027s house from Haverfordwest was opened in 2012. A relocation of the historic Vulcan public house from Newtown in Cardiff to St Fagans was completed in May 2024.\nAlthough the museum was intended to preserve aspects of Welsh rural life, it now includes several buildings that depict the industrial working life that succeeded it, that being almost extinct in Wales. There is a row of workers\u0027 cottages, depicting furnishing from 1800 to 1985, from Rhyd-y-car near Merthyr Tydfil , as well as the pristine Oakdale Workmen\u0027s Institute. A post-war prefabricated bungalow represents later domestic lifestyles.\nFrom 1996 to 2012, the museum hosted the Everyman Summer Theatre Festival when it re-located from Dyffryn Gardens. This festival, which includes a Shakespeare play, a musical, and a children\u0027s show, has become part of the Welsh theatrical calendar since its founding at Dyffryn in 1983.\nScenes from the Doctor Who episodes \u0022Human Nature\u0022 and \u0022The Family of Blood\u0022 were filmed at the museum.\nBased on archaeological findings, a reconstruction of Llys Rhosyr, a thirteenth-century court of the princes of Gwynedd, was completed and opened to the public in October 2018. Called Llys Llewelyn , it was opened with the intention that schoolchildren would be able to stay in the buildings overnight, from spring 2019.\nThe Gweithdy , a sustainable building designed by Feilden Clegg Bradley Studios, was first opened in July 2017; a café was later added. The new gallery was opened in October 2018, housing improved facilities for visitors while supporting the study of collections and hosting demonstrations and workshops by traditional craftsmen.\n\n\n=== List of structures ===\n\n\n=== Minor exhibits ===\r\n\r\n== Future developments ==\nThe rebuilding of the Victorian police station from Taff\u0027s Well, Rhondda Cynon Taf.\nIn 2012 it was announced that Raglan railway station would be rebuilt at the museum.",
  "location": {
    "lat": 51.4869,
    "long": -3.2725
  },
  "imageNames": [
    "Abernodwydd_Farmhouse_St_Fagans_Museum_of_Welsh_Life.jpg",
    "Anderson_shelter_at_St_Fagans.jpg",
    "Barn_National_History_Museum_of_Wales.jpg",
    "Boat-house_and_Net-house_National_History_Museum_St_Fagans_1458922_geograph.org.uk.jpg",
    "Bryn_Eryr_Farmstead_St_Fagans_National_History_Museum_geograph_5111620.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1948,
  "categoryId": "lleoedd",
  "id": "sain-ffagan",
  "label": "St Fagans"
}