{
  "wikiSummary": "Saint Dwynwen , sometimes known as Dwyn or Donwen, is the Welsh patron saint of lovers. She is celebrated throughout Wales on 25 January.",
  "wikiArticle": "Saint Dwynwen , sometimes known as Dwyn or Donwen, is the Welsh patron saint of lovers. She is celebrated throughout Wales on 25 January.\r\n\r\n== History and legend ==\n\nThe original tale of Dwynwen has become mixed with elements of folklore and Celtic stories, resulting in multiple versions. She is believed to have been a daughter of King Brychan Brycheiniog, who lived in the 5th century; her mother may have been Rigrawst. Dwynwen is said to have resided in Anglesey.\nIn one well-known version of the legend, a young man named Maelon Dafodrill falls in love with Dwynwen, but she rejects him; in another, she cannot marry him because her father has already promised her to another. Distraught, Dwynwen prays to fall out of love with Maelon. An angel appears with a potion: Maelon turns to ice. God then grants her three requests: that Maelon be released from his icy fate; that God, through Dwynwen, watch over all true lovers; and that she herself remain unmarried. As a mark of thanks, she retreats to the solitude of Ynys Llanddwyn off Anglesey, becoming a hermit until her death around AD 460 .\nTradition also credits Dwynwen with studying the healing properties of local herbs, curing ailments of those who sought her help from across Wales.\r\n\r\n== Ynys Llanddwyn ==\n\nFollowing her retreat from court life, Dwynwen withdrew to the small tidal island of Ynys Llanddwyn—off the southwest coast of Anglesey, near Newborough. There, she established a church known as Llanddwyn , whose ruins remain visible today.\r\n\r\n== Veneration ==\n\nSt Dwynwen\u0027s Church on Ynys Llanddwyn evolved into a major shrine during the Middle Ages. A holy well on the island, associated with Dwynwen, became a site of pilgrimage, where the movements of sacred fish within its waters were thought to forecast lovers\u0027 fortunes. Welsh poets Dafydd ap Gwilym and Dafydd Trefor recorded the saint\u0027s popularity by referencing the pilgrimages to Ynys Llanddwyn.\nAfter the Reformation, activity at the shrine was suppressed. The area fell into disrepair, exacerbated by drifting sand. Pilgrims looking for a holy site increasingly turned to Saint Elian\u0027s Well nearby, though some continued to honour Dwynwen at her ruined church. In the late 19th century, the Oxford Movement—which revived some traditional devotional practices within Anglicanism—brought renewed attention to the site. Around 1879 , a plain cross approximately 14 feet high was erected on the island to commemorate Dwynwen.\nIn 1903, the Hon. F. G. Wynn of Glynllivon, son of the 3rd Baron Newborough, erected a more elaborate Celtic cross on Ynys Llanddwyn, again honouring the saint. Today, the site is part of a nature reserve and remains a popular spot for visitors.\nDwynwen is venerated in the Eastern Orthodox Church.\n\n\n=== Patronage ===\nBesides being recognised as the patron saint of Welsh lovers, Dwynwen is also considered a patron of sick animals.\r\n\r\n== Dydd Santes Dwynwen ==\nDydd Santes Dwynwen is considered the Welsh equivalent of Valentine\u0027s Day and is celebrated on 25 January, in honour of Dwynwen, the Welsh patron saint of lovers.\nCalendars from the fifteenth century and later assign her feast day to 25 January. However, the 17th-century hagiographer Nicolas Roscarrok placed \\\u0022St Dwin\\\u0022 on 13 July, suggesting that Dwin and Dwynwen were variants of the same saint. In his records, 25 January commemorates \\\u0022Dwinwent\\\u0022 or \\\u0022Damwent\\\u0022.\nWhile she is not officially recognised in the modern calendars of the Catholic or Anglican Churches, Dwynwen is commemorated by some Orthodox communities and listed on Eastern Orthodox and certain traditional Catholic liturgical websites. She does not appear in the 2004 edition of the Roman Martyrology, the official Catholic calendar for Wales, nor in the 1995 revision of the Church in Wales calendar.\n\n\n=== Present day ===\nDuring the 1960s, a Bangor University student, Vera Williams, sought to revive St Dwynwen\u0027s Day by designing Welsh \\\u0022Valentine\u0027s\\\u0022 cards. Local press and businesses embraced the idea, and by 2004, the celebration of 25 January as a feast for Welsh lovers was well established—Gwynedd Council even promoted it.\nSt Dwynwen\u0027s Day celebrations have grown in popularity, with events like concerts, parties, and the exchange of greeting cards becoming increasingly common. Though overshadowed by Valentine\u0027s Day, its recognition continues to spread. A major boost came in 2003 when the Welsh Language Board partnered with the supermarket Tesco to distribute 50,000 free St Dwynwen\u0027s Day cards across Wales. One of these cards contained a specially marked heart, entitling the finder to a prize. The board also encouraged alternative celebrations, such as hosting love-themed gigs, singles nights, romantic dinners, or composing love poetry in pubs. Traditional Welsh lovespoon-carving presentations also form part of the celebrations.\r\n\r\n== Legacy ==\nDwynwen\u0027s name endures in several place names, including Ynys Llanddwyn and Porthddwyn on Anglesey in Wales, and the church of \\\u0022Sen Adhwynn\\\u0022 in Advent, Cornwall.\nWelsh composer Joseph Parry wrote the music for \\\u0022Dwynwen\\\u0022, a chorus penned by Benjamin Williams for the 1896 Llandudno National Eisteddfod.",
  "imageNames": [
    "DwynwenCross1.jpg",
    "LlanddwynRuins.jpg",
    "Ruins_at_Llanddwyn_Anglesey.jpg",
    "StdwynwensChurchLlanddwyn.JPG"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 460,
  "categoryId": "crefydd",
  "id": "santes-dwynwen",
  "label": "Saint Dwynwen"
}