{
  "wikiSummary": "The 1984–1985 United Kingdom miners\u0027 strike was a major industrial action within the British coal industry  in an attempt to prevent closures of pits that were uneconomic in the coal industry, which had been nationalised in 1947. It was led by Arthur Scargill of the National Union of Mineworkers against the National Coal Board , a government agency. Opposition to the strike was led by the Conservative government of Prime Minister Margaret Thatcher, who wanted to reduce the power of the trade unions.\nThe NUM was divided over the action, which began in Yorkshire, and spread to many other coalfields nationally. More than a fifth of mineworkers, especially in the Nottingham area, continued working from the very beginning of the dispute; by late 1984 miners increasingly returned to work. Few major trade unions supported the NUM officially, though many of their ordinary members set up support groups raising money and collecting food for miners and their families.  The absence of a national ballot by the NUM to support the national strike weakened wider official support from other trade unions. Violent confrontations between flying pickets and police characterised the year-long strike, which ended in a decisive victory for the Conservative government and allowed the closure of most of Britain\u0027s collieries . Many observers regard the strike as \u0022the most bitter industrial dispute in British history\u0022.  The number of person-days of work lost to the strike was over 26 million, making it the largest since the 1926 General Strike. The journalist Seumas Milne said of the strike that \u0022it has no real parallel – in size, duration and impact – anywhere in the world\u0022.\nThe NCB was encouraged to gear itself towards reduced subsidies in the early 1980s. After a strike was narrowly averted in February 1981, pit closures and pay restraint led to unofficial strikes. The main strike started on 6 March 1984 with a walkout at Cortonwood Colliery, which led to the NUM\u0027s Yorkshire Area\u0027s sanctioning of a strike on the grounds of a ballot result from 1981 in the Yorkshire Area, which was later challenged in court. The NUM President, Arthur Scargill, made the strike official across Britain on 12 March 1984, but the lack of a national ballot beforehand caused controversy. The NUM strategy was to cause a severe energy shortage of the sort that had won victory in the 1972 strike. The government strategy, designed by Margaret Thatcher, was threefold: to build up ample coal stocks, to keep as many miners at work as possible, and to use police to break up attacks by pickets on working miners. The critical element was the NUM\u0027s failure to hold a national strike ballot.\nThe strike was ruled illegal in September 1984, as no national ballot of NUM members had been held. It ended on 3 March 1985. It was a defining moment in British industrial relations, the NUM\u0027s defeat significantly weakening the trade union movement. It was a major victory for Thatcher and the Conservative Party, with the Thatcher government able to consolidate their economic programme. The number of strikes fell sharply in 1985 as a result of the \u0022demonstration effect\u0022 and trade union power in general diminished. Three deaths resulted from events related to the strike.\nThe much-reduced coal industry was privatised in December 1994, ultimately becoming UK Coal. In 1983, Britain had 175 working pits, all of which had closed by the end of 2015. Poverty increased in former coal mining areas, and in 1994 Grimethorpe in South Yorkshire was the poorest settlement in the country.",
  "wikiArticle": "The 1984–1985 United Kingdom miners\u0027 strike was a major industrial action within the British coal industry  in an attempt to prevent closures of pits that were uneconomic in the coal industry, which had been nationalised in 1947. It was led by Arthur Scargill of the National Union of Mineworkers against the National Coal Board , a government agency. Opposition to the strike was led by the Conservative government of Prime Minister Margaret Thatcher, who wanted to reduce the power of the trade unions.\nThe NUM was divided over the action, which began in Yorkshire, and spread to many other coalfields nationally. More than a fifth of mineworkers, especially in the Nottingham area, continued working from the very beginning of the dispute; by late 1984 miners increasingly returned to work. Few major trade unions supported the NUM officially, though many of their ordinary members set up support groups raising money and collecting food for miners and their families.  The absence of a national ballot by the NUM to support the national strike weakened wider official support from other trade unions. Violent confrontations between flying pickets and police characterised the year-long strike, which ended in a decisive victory for the Conservative government and allowed the closure of most of Britain\u0027s collieries . Many observers regard the strike as \u0022the most bitter industrial dispute in British history\u0022.  The number of person-days of work lost to the strike was over 26 million, making it the largest since the 1926 General Strike. The journalist Seumas Milne said of the strike that \u0022it has no real parallel – in size, duration and impact – anywhere in the world\u0022.\nThe NCB was encouraged to gear itself towards reduced subsidies in the early 1980s. After a strike was narrowly averted in February 1981, pit closures and pay restraint led to unofficial strikes. The main strike started on 6 March 1984 with a walkout at Cortonwood Colliery, which led to the NUM\u0027s Yorkshire Area\u0027s sanctioning of a strike on the grounds of a ballot result from 1981 in the Yorkshire Area, which was later challenged in court. The NUM President, Arthur Scargill, made the strike official across Britain on 12 March 1984, but the lack of a national ballot beforehand caused controversy. The NUM strategy was to cause a severe energy shortage of the sort that had won victory in the 1972 strike. The government strategy, designed by Margaret Thatcher, was threefold: to build up ample coal stocks, to keep as many miners at work as possible, and to use police to break up attacks by pickets on working miners. The critical element was the NUM\u0027s failure to hold a national strike ballot.\nThe strike was ruled illegal in September 1984, as no national ballot of NUM members had been held. It ended on 3 March 1985. It was a defining moment in British industrial relations, the NUM\u0027s defeat significantly weakening the trade union movement. It was a major victory for Thatcher and the Conservative Party, with the Thatcher government able to consolidate their economic programme. The number of strikes fell sharply in 1985 as a result of the \u0022demonstration effect\u0022 and trade union power in general diminished. Three deaths resulted from events related to the strike.\nThe much-reduced coal industry was privatised in December 1994, ultimately becoming UK Coal. In 1983, Britain had 175 working pits, all of which had closed by the end of 2015. Poverty increased in former coal mining areas, and in 1994 Grimethorpe in South Yorkshire was the poorest settlement in the country.\r\n\r\n== Background ==\n\nWhile more than 1,000 collieries were working in the UK during the first half of the 20th century, by 1984 only 173 were still operating and employment had dropped from its peak of 1 million in 1922, down to 231,000 for the decade to 1982. This long-term decline in coal employment was common across the developed world; in the United States, employment in the coal-mining industry continued to fall from 180,000 in 1985 to 70,000 in the year 2000.\nCoal mining, nationalised by Clement Attlee\u0027s Labour government in 1947, was managed by the National Coal Board under Ian MacGregor in 1984. As in most of Europe, the industry was heavily subsidised. In 1982–1983, the operating loss per tonne was £3.05, and international market prices for coal were about 25% cheaper than that charged by the NCB.\nBy 1984, the richest seams of coal had been increasingly worked out and the remaining coal was more difficult and more expensive to reach. The solution was mechanisation and greater efficiency per worker, making many miners redundant due to overcapacity of production. The industry was restructured between 1958 and 1967 in cooperation with the unions, with a halving of the workforce; offset by government and industry initiatives to provide alternative employment. Stabilisation occurred between 1968 and 1977, when closures were minimised with the support of the unions even though the broader economy slowed. The accelerated contraction imposed by Thatcher after 1979 was strenuously opposed by the unions. In the post-war consensus, policy allowed for closures only where agreed to by the workers, who in turn received guaranteed economic security. Consensus did not apply when closures were enforced and redundant miners had severely limited employment alternatives.\nThe NUM\u0027s strike in 1974 played a major role in bringing down Edward Heath\u0027s Conservative government. The party\u0027s response was the Ridley Plan, an internal report that was leaked to The Economist magazine and appeared in its 27 May 1978 issue. Ridley described how a future Conservative government could resist and defeat a major strike in a nationalised industry. In Ridley\u0027s opinion, trade union power in the UK was interfering with market forces, pushing up inflation, and the unions\u0027 undue political power had to be curbed to restore the UK\u0027s economy.\n\n\n=== National Union of Mineworkers ===\n\nThe mining industry was effectively a closed shop. Although not official policy, employment of non-unionised labour would have led to a mass walkout of mineworkers.\nThe National Union of Mineworkers came into being in 1945 and in 1947 most collieries in Britain were nationalised . Demand for coal was high in the years following the Second World War, and Polish refugees were drafted to work in the pits. Over time, coal\u0027s share in the energy market declined relative to oil and nuclear. Large-scale closures of collieries occurred in the 1960s, which led to migration of miners from the run-down coalfields to Yorkshire and the Midlands coalfields. After a period of inaction from the NUM leadership over employment cuts, there was an unofficial strike in 1969, after which many more militant candidates were elected to NUM leadership. The threshold for endorsement of strike action in a national ballot was reduced from two-thirds in favour to 55% in 1971. There was then success in the national strike in 1972, an overtime ban, and the subsequent strike in 1974 . The NUM\u0027s success in bringing down the Heath government demonstrated its power, but it caused resentment at their demand to be treated as a special case in wage negotiations.\nThe NUM had a decentralised regional structure and certain regions were seen as more militant than others. Scotland, South Wales and Kent were militant and had some communist officials, whereas the Midlands were much less militant. The only nationally coordinated actions in the 1984–1985 strike were the mass pickets at Orgreave.\nIn the more militant mining areas, strikebreakers were reviled and never forgiven for betraying the community. In 1984, some pit villages had no other industries for many miles around. In South Wales, miners showed a high degree of solidarity, as they came from isolated villages where most workers were employed in the pits, had similar lifestyles, and had an evangelical religious style based on Methodism that led to an ideology of egalitarianism. The dominance of mining in these local economies led Oxford professor Andrew Glyn to conclude that no pit closure could be beneficial for government revenue.\nFrom 1981, the NUM was led by Arthur Scargill, a militant trade unionist and socialist, with strong leanings towards communism. Scargill was a vocal opponent of Thatcher\u0027s government. In March 1983, he stated \u0022The policies of this government are clear – to destroy the coal industry and the NUM\u0022. Scargill wrote in the NUM journal The Miner: \u0022Waiting in the wings, wishing to chop us to pieces, is Yankee steel butcher MacGregor. This 70-year-old multi-millionaire import, who massacred half the steel workforce in less than three years, is almost certainly brought in to wield the axe on pits. It\u0027s now or never for Britain\u0027s mineworkers. This is the final chance – while we still have the strength – to save our industry\u0022. On 12 May 1983, in response to being questioned on how he would respond if the Conservatives were re-elected in the general election, Scargill replied: \u0022My attitude would be the same as the attitude of the working class in Germany when the Nazis came to power. It does not mean that because at some stage you elect a government that you tolerate its existence. You oppose it\u0022. He also said he would oppose a second-term Thatcher government \u0022as vigorously as I possibly can\u0022. After the election, Scargill called for extra-parliamentary action against the Conservative government in a speech to the NUM conference in Perth on 4 July 1983:\n\n\u0022A fight back against this Government\u0027s policies will inevitably take place outside rather than inside Parliament. When I talk about \u0027extra-parliamentary action\u0027 there is a great outcry in the press and from leading Tories about my refusal to accept the democratic will of the people. I am not prepared to accept policies elected by a minority of the British electorate. I am not prepared quietly to accept the destruction of the coal industry, nor am I willing to see our social services decimated. This totally undemocratic Government can now easily push through whatever laws it chooses. Faced with possible parliamentary destruction of all that is good and compassionate in our society, extra-parliamentary action will be the only course open to the working class and the Labour movement.\u0022\nScargill also rejected the idea that pits that did not make a profit were \u0022uneconomic\u0022: he claimed there was no such thing as an uneconomic pit and argued that no pits should close except due to geological exhaustion or safety.\n\n\n=== National Association of Colliery Overmen, Deputies and Shotfirers ===\nNo mining could legally be done without being overseen by an overman or deputy. Their union, the National Association of Colliery Overmen, Deputies and Shotfirers with 17,000 members in 1984, was less willing to take industrial action. Its constitution required a two-thirds majority for a national strike. During the 1972 strike, violent confrontations between striking NUM and non-striking NACODS members led to an agreement that NACODS members could stay off work without loss of pay if they were faced with aggressive picketing. Thus solidarity with striking NUM members could be shown by claims of violence preventing the crossing of picket lines even without a NACODS union vote for strike action. Initially the threshold for striking was not met; although a majority had voted for strike action, it was not enough. However, later during the strike 82% did vote for strike action.\r\n\r\n== Sequence of events ==\n\n\n=== Calls for action ===\nIn January 1981, the Yorkshire area of the NUM held a successful ballot to approve strike action over any pit threatened with closure on economic grounds.  This led to a two-week local strike over the closure of Orgreave Colliery, but the ballot result was later invoked to justify strikes over other closures, including Cortonwood in 1984.  In February 1981, the government announced plans to close 23 pits across the country but the threat of a national strike was enough to force a back down. Coal stocks would last only six weeks, after which Britain would shut down and people would demand concessions. Thatcher realised she needed at least a six-month supply of coal to win a strike.  In 1982, NUM members accepted a 9.3% pay rise, rejecting their leaders\u0027 call for a strike.\nMost pits proposed for closure in 1981 were closed on a case-by-case basis by the colliery review procedure, and the NCB cut employment by 41,000 between March 1981 and March 1984. The effect of closures was lessened by transfers to other pits and the opening up of the Selby Coalfield where working conditions and wages were relatively favourable. Localised strikes occurred at Kinneil Colliery in Scotland and Lewis Merthyr Colliery in Wales.  The industry\u0027s Select Committee heard that 36,040 of the 39,685 redundancies between 1973 and 1982 were of men aged 55 and over, and redundancy pay was increased substantially in 1981 and 1983.\nThe NUM balloted its members for national strikes in January 1982, October 1982 and March 1983 regarding pit closures and restrained wages and each time a minority voted in favour, well short of the required 55% majority. In protest at a pay offer of 5.2%, the NUM instituted an overtime ban in November 1983, which remained in place at the onset of the strike.\n\n\n=== Thatcher\u0027s strategy ===\n\nThatcher expected Scargill to force a confrontation, and in response she set up a defence in depth. She believed that the excessive costs of increasingly inefficient collieries had to end in order to grow the economy. She planned to close inefficient pits and depend more on imported coal, oil, gas and nuclear. She appointed hardliners to key positions, set up a high level planning committee, and allocated funds from the highly profitable electrical supply system to stockpile at least six months\u0027 worth of coal. Thatcher\u0027s team set up mobile police units so that forces from outside the strike areas could neutralise efforts by flying pickets to stop the transport of coal to power stations. It used the National Recording Centre , set up in 1972 by the Association of Chief Police Officers for England and Wales linking 43 police forces to enable police forces to travel to assist in major disturbances. Scargill played into her hands by ignoring the buildup of coal stocks and calling the strike at the end of winter when demand for coal was declining.\nIn 1983, Thatcher appointed Ian MacGregor to head the National Coal Board. He had turned the British Steel Corporation from one of the least efficient steel-makers in Europe to one of the most efficient, bringing the company into near profit. Success was achieved at the expense of halving the workforce in two years and he had overseen a 14-week national strike in 1980. His tough reputation raised expectations that coal jobs would be cut on a similar scale and confrontations between MacGregor and Scargill seemed inevitable.\n\n\n=== Debate over a national ballot ===\nOn 19 April 1984 a Special National Delegate Conference was held where there was a vote on whether to hold a national ballot or not. The NUM delegates voted 69–54 not to have a national ballot, a position argued for by Arthur Scargill. Scargill states: \u0022Our special conference was held on 19 April. McGahey, Heathfield and I were aware from feedback that a slight majority of areas favoured the demand for a national strike ballot; therefore, we were expecting and had prepared for that course of action with posters, ballot papers and leaflets. A major campaign was ready to go for a \u0022Yes\u0022 vote in a national strike ballot.\u0022 McGahey said: \u0022We shall not be constitutionalised out of a strike...Area by area will decide and there will be a domino effect\u0022.\nWithout a national ballot, most miners in Nottinghamshire, Leicestershire, South Derbyshire, North Wales and the West Midlands kept on working during the strike, along with a sizeable minority in Lancashire. The police provided protection for working miners from aggressive picketing.\n\n\n=== Pit closures announced ===\n\nOn 6 March 1984, the NCB announced that the agreement reached after the 1974 strike was obsolete, and that to reduce government subsidies, 20 collieries would close with a loss of 20,000 jobs. Many communities in Northern England, Scotland and Wales would lose their primary source of employment.\nScargill said the government had a long-term strategy to close more than 70 pits. The government denied the claim and MacGregor wrote to every NUM member claiming Scargill was deceiving them and there were no plans to close any more pits than had already been announced. Cabinet papers released in 2014 indicate that MacGregor wished to close 75 pits over a three-year period. Meanwhile, the Thatcher government had prepared against a repeat of the effective 1974 industrial action by stockpiling coal, converting some power stations to burn heavy fuel oil, and recruiting fleets of road hauliers to transport coal in case sympathetic railwaymen went on strike to support the miners.\n\n\n=== Action begins ===\nSensitive to the impact of proposed closures, miners in various coalfields began strike action. In  Yorkshire, miners at Manvers, Cadeby, Silverwood, Kiveton Park and Yorkshire Main were on unofficial strike for other issues before official action was called. More than 6,000 miners were on strike from 5 March at Cortonwood and Bullcliffe Wood, near Wakefield. Neither pit\u0027s reserves were exhausted. Bullcliffe Wood had been under threat, but Cortonwood had been considered safe. Action was prompted on 5 March by the NCB\u0027s announcement that five pits would be subject to \u0022accelerated closure\u0022 in just five weeks; the other three were Herrington in County Durham, Snowdown in Kent and Polmaise in Scotland. The next day, pickets from Yorkshire appeared at pits in Nottinghamshire and Harworth Colliery closed after a mass influx of pickets amid claims that Nottinghamshire was \u0022scabland in 1926\u0022. On 12 March 1984, Scargill declared the NUM\u0027s support for the regional strikes in Yorkshire and Scotland, and called for action from NUM members in all other areas but decided not to hold a nationwide vote which was used by his opponents to delegitimise the strike.\n\n\n=== Picketing ===\n\nThe strike was almost universally observed in South Wales, Yorkshire, Scotland, North East England and Kent, but there was less support across the Midlands and in North Wales. Nottinghamshire became a target for aggressive and sometimes violent picketing as Scargill\u0027s pickets tried to stop local miners from working. Lancashire miners were reluctant to strike, but most refused to cross picket lines formed by the Yorkshire NUM. Picketing in Lancashire was less aggressive and is credited with a more sympathetic response from the local miners.\nOn 14 March 1984 David Gareth Jones, a South Kirkby miner from Acton Hall Colliery was killed whilst picketing at Ollerton Colliery. The \u0027Battle of Orgreave\u0027 took place on 18 June 1984 at the Orgreave Coking Plant near Rotherham, which striking miners were attempting to blockade. The confrontation, between about 5,000 miners and the same number of police, broke into violence after police on horseback charged with truncheons drawn – 51 picketers and 72 policemen were injured. Other less well known, but bloody, battles between pickets and police took place, for example, in Maltby, South Yorkshire.\nDuring the strike, 11,291 people were arrested, mostly for breach of the peace or obstructing roads whilst picketing, of whom 8,392 were charged and between 150 and 200 were imprisoned. At least 9,000 mineworkers were dismissed after being arrested whilst picketing even when no charges were brought.\nAfter the 1980 steel strike, many hauliers blacklisted drivers who refused to cross picket lines to prevent them obtaining work, and so more drivers crossed picket lines in 1984–1985 than in previous disputes.  Picketing failed to have the widespread impact of earlier stoppages that led to blackouts and power cuts in the 1970s and electricity companies maintained supplies throughout the winter, the time of biggest demand.\nFrom September, some miners returned to work even where the strike had been universally observed. It led to an escalation of tension, and riots in Easington in Durham and Brampton Bierlow in Yorkshire.\n\n\n=== Strike ballots by NACODS ===\nIn April 1984, NACODS voted to strike but was short of the two-thirds majority that their constitution required. In areas where the strike was observed, most NACODS members did not cross picket lines and, under an agreement from the 1972 strike, stayed off work on full pay. When the number of strikebreakers increased in August, Merrick Spanton, the NCB personnel director, said he expected NACODS members to cross picket lines to supervise their work threatening the 1972 agreement which led to a second ballot. MacGregor suggested that deputies could be replaced by outsiders as Ronald Reagan had done during the 1981 airline strike. In September, for the first time, NACODS voted to strike with a vote of 81% in favour. The government then made concessions over the review procedure for unprofitable collieries, much to the anger of MacGregor, and a deal negotiated by North Yorkshire NCB Director Michael Eaton persuaded NACODS to call off the strike action.\nThe results of the review procedure were not binding on the NCB, and the NUM rejected the agreement.  Reviews for Cadeby in Yorkshire and Bates in Northumberland concluded that the pits could stay open but the NCB overruled and closed them.  The abandonment of strike plans when most of their demands had not been met led to conspiracy theories on the motives of NACODS leaders.\nMacGregor later admitted that if NACODS had gone ahead with a strike, a compromise would probably have been forced on the NCB. Files later made public showed that the government had an informant inside the Trades Union Congress , passing information about negotiations.\nIn 2009, Scargill wrote that the settlement agreed with NACODS and the NCB would have ended the strike and said, \u0022The monumental betrayal by NACODS has never been explained in a way that makes sense.\u0022\n\n\n=== Court judgments on legality of strike ===\nIn the first month of the strike, the NCB secured a court injunction to restrict picketing in Nottinghamshire, but the Energy Minister, Peter Walker forbade MacGregor from invoking it as the government considered it would antagonise the miners and unite them behind the NUM. Legal challenges were brought by groups of working miners, who subsequently organised as the Working Miners\u0027 Committee. David Hart, a farmer and property developer with libertarian political beliefs, did much to organise and fund working miners. On 25 May, a writ issued in the High Court by Colin Clark from Pye Hill Colliery, sponsored by Hart, was successful in forbidding the Nottinghamshire area from instructing that the strike was official and to be obeyed. Similar actions were successful in Lancashire and South Wales.\nIn September, Lord Justice Nicholls heard two cases, in the first, North Derbyshire miners argued that the strike was illegal both at area level, as a majority of its miners had voted against, and at national level, as there had been no ballot. In the second, two miners from Manton Colliery, in the Yorkshire area but geographically in North Nottinghamshire, argued that the area-level strike in Yorkshire was illegal. Miners at Manton had overwhelmingly voted against the strike, but police had advised that their safety could not be guaranteed. The NUM was not represented at the hearing. The High Court ruled that the NUM had breached its constitution by calling a strike without holding a ballot. Although Nicholls did not order the NUM to hold a ballot, he forbade the union from disciplining members who crossed picket lines.\nThe strike in Yorkshire relied on a ballot from January 1981, in which 85.6% of the members voted to strike if any pit was threatened with closure on economic grounds. The motion was passed with regard to the closure of Orgreave Colliery, which prompted a two-week strike. The NUM executive approved the decision in Yorkshire to invoke the ballot result as binding on 8 March 1984. Nicholls ruled that the 1981 ballot result was \u0022too remote in time [with]... too much change in the branch membership of the Area since then for that ballot to be capable of justifying a call to strike action two and a half years later.\u0022 He ruled that the Yorkshire area could not refer to the strike as \u0022official\u0022, although he did not condemn the strike as \u0022illegal\u0022 as he did in the case of the national strike and the North Derbyshire strike.\nScargill referred to the ruling as \u0022another attempt by an unelected judge to interfere in the union\u0027s affairs.\u0022 He was fined £1,000 , and the NUM was fined £200,000. When the union refused to pay, an order was made to sequester the union\u0027s assets, but they had been transferred abroad. In October 1984, the NUM executive voted to cooperate with the court to recover the funds, despite opposition from Scargill, who stated in court that he was only apologising for his contempt of court because the executive voted for him to do so. By the end of January 1985, around £5 million of NUM assets had been recovered.\nA Court of Session decision in Edinburgh ruled that Scottish miners had acted within their rights by taking local ballots on a show of hands and so union funds in Scotland could not be sequestered. \u0022During the strike, the one area they couldn\u0027t touch was Scotland. They were sequestering the NUM funds, except in Scotland, because the judges deemed that the Scottish area had acted within the rules of the Union\u0022 – David Hamilton MP, Midlothian.\nScargill claims \u0022It was essential to present a united response to the NCB and we agreed that, if the coal board planned to force pit closures on an area by area basis, then we must respond at least initially on that same basis. The NUM\u0027s rules permitted areas to take official strike action if authorised by our national executive committee in accordance with Rule 41.\u0022\n\n\n=== Breakaway union ===\nThe Nottinghamshire NUM supported the strike, but most of its members continued to work and many considered the strike unconstitutional given their majority vote against a strike and absence of a ballot for a national strike.  As many working miners felt the NUM was not doing enough to protect them from intimidation from pickets, a demonstration was organised on May Day in Mansfield, in which the representative Ray Chadburn was shouted down, and fighting ensued between protesters for and against the strike.\nIn NUM elections in summer 1984, members in Nottinghamshire voted out most of the leaders who had supported the strike, so that 27 of 31 newly elected were opposed to the strike.  The Nottinghamshire NUM then opposed the strike openly and stopped payments to local strikers.  The national NUM attempted to introduce \u0022Rule 51\u0022, to discipline area leaders who were working against national policy.  The action was nicknamed the \u0022star chamber court\u0022 by working miners .  It was prevented by an injunction from the High Court.\nWorking miners in Nottinghamshire and South Derbyshire set up a new union: the Union of Democratic Mineworkers .  It attracted members from many isolated pits in England – including Agecroft and Parsonage in Lancashire, Chase Terrace and Trenton Workshops in Staffordshire, and Daw Mill in Warwickshire.\nAlthough most Leicestershire miners continued working, they voted to stay in the NUM.  Unlike Nottinghamshire, the leadership in Leicestershire never attempted to enforce the strike,  and an official, Jack Jones, had publicly criticised Scargill.  At some pits in Nottinghamshire – Ollerton, Welbeck and Clipstone – roughly half the workforce stayed in the NUM.\nThe TUC neither recognised nor condemned the new union. The UDM was eventually de facto recognised when the NCB included it in wage negotiations. MacGregor strongly encouraged the UDM. He announced that NUM membership was no longer a prerequisite for mineworkers\u0027 employment, ending the closed shop.\n\n\n=== The formal end ===\nThe number of strikebreakers, sometimes referred to pejoratively as scabs, increased from the start of January, as the strikers struggled to pay for food as union pay ran out. They were not treated with the same contempt by strikers as those who had returned to work earlier, but in some collieries, fights broke out between hunger scabs who had been active pickets, and those who had broken the strike earlier.\nThe strike ended on 3 March 1985, nearly a year after it had begun. The South Wales area called for a return to work on condition that men sacked during the strike would be reinstated, but the NCB rejected the proposal when its bargaining position was improved by miners returning to work. Only the Yorkshire and Kent regions voted against ending the strike. One of the few concessions made by the NCB was to postpone the closure of the five pits: Cortonwood, Bullcliffe Wood, Herrington, Polmaise and Snowdown.\nThe issue of sacked miners was important in Kent, where several men had been sacked for a sit-in at Betteshanger Colliery. Kent NUM leader Jack Collins said after the decision to go back without any agreement of amnesty for the sacked men, \u0022The people who have decided to go back to work and leave men on the sidelines are traitors to the trade-union movement.\u0022 The Kent NUM continued picketing across the country, delaying the return to work at many pits for two weeks. Some sources claim that the Scottish NUM continued the strike alongside Kent.\nAt several pits, miners\u0027 wives groups organised the distribution of carnations, the flower that symbolises the hero, at the pit gates on the day the miners went back. Many pits marched back to work behind brass bands, in processions dubbed \u0022loyalty parades\u0022. Scargill led a procession accompanied by a Scots piper, back to work at Barrow Colliery in Worsborough but then it was stopped by a picket of Kent miners. Scargill said, \u0022I never cross a picket line,\u0022 and turned the procession away.\r\n\r\n== Issues ==\n\n\n=== Ballots ===\nThe role of ballots in NUM policy had been disputed over a number of years, and a series of legal disputes in 1977 left their status unclear. In 1977, the implementation of an incentive scheme proved controversial, as different areas would receive different pay rates. After the NUM\u0027s National Executive Conference rejected the scheme, NUM leader Joe Gormley arranged a national ballot. The Kent area who opposed the scheme sought a court injunction to prevent it, but Lord Denning ruled that \u0022the conference might not have spoken with the true voice of all the members and in his view a ballot was a reasonable and democratic proposal\u0022. The scheme was rejected by 110,634 votes to 87,901. The Nottinghamshire, South Derbyshire and Leicestershire areas resolved to adopt the incentive scheme as their members would benefit from increased pay. The Yorkshire, Kent and South Wales areas sought an injunction to prevent these actions on the grounds of the ballot result. Mr. Justice Watkins ruled that, \u0022The result of a ballot, nationally conducted, is not binding upon the National Executive Committee in using its powers in between conferences. It may serve to persuade the committee to take one action or another, or to refrain from action, but it has no great force or significance.\u0022\nScargill did not call a ballot for national strike action, perhaps due to uncertainty over the outcome. Instead, he started the strike by allowing each region to call its own strikes, imitating Gormley\u0027s strategy over wage reforms; it was argued that \u0027safe\u0027 regions should not be allowed to ballot other regions out of jobs. The decision was upheld by  a vote by the NUM executive five weeks into the strike.\nThe NUM had held three ballots on national strikes: 55% voted against in January 1982, and 61% voted against in October 1982 and March 1983.  Before the March 1983 vote, the Kent area, one of the most militant, argued for national strikes to be called by conferences of delegates rather than by ballot, but the proposal was rejected.  As the strike began in 1984 with unofficial action in Yorkshire, there was pressure from strikers to make it official, and NUM executives who insisted on a ballot were attacked by pickets at an executive meeting in Sheffield in April.  In contrast, a sit-in down the pit was held by supporters of a ballot at Hem Heath in Staffordshire.  Although the Yorkshire area had a policy of opposing a national ballot, there was support for a ballot expressed by Yorkshire branches at Glasshoughton, Grimethorpe, Shireoaks and Kinsley.\nTwo polls by MORI in April 1984 found that the majority of miners supported a strike.  Ken Livingstone wrote in his memoirs that Scargill had interpreted a Daily Mail poll that suggested a comfortable majority of miners favoured a national strike to be a trick and that he would actually lose a national ballot.\nIn ballots in South Wales on 10 March 1984, only 10 of the 28 pits voted in favour of striking, but the arrival of pickets from Yorkshire the next day led to virtually all miners in South Wales going on strike in solidarity.  The initial vote against strike action by most lodges in South Wales was interpreted as an act of retaliation for a lack of support from Yorkshire in years when numerous pits in Wales were closing, especially following the closure of the Lewis Merthyr colliery in March 1983 and only 54% of Yorkshire miners voting for a national strike that month, a full 14% below the vote for a national strike in both South Wales and Kent.\nArea ballots on 15 and 16 March 1984 saw verdicts against a strike in Cumberland, Midlands, North Derbyshire , South Derbyshire, Lancashire, Leicestershire , Nottinghamshire and North Wales.  The Northumberland NUM voted by a small majority in favour, but below the 55% needed for official approval. NUM leaders in Lancashire argued that, as 41% had voted in favour of a strike, all its members should strike \u0022in order to maintain unity\u0022.\nThe Conservative government under Thatcher enforced a law that required unions to ballot members on strike action. On 19 July 1984, Thatcher said in the House of Commons that giving in to the miners would be surrendering the rule of parliamentary democracy to the rule of the mob. She referred to union leaders as \u0022the enemy within\u0022 and claimed they did not share the values of other British people; advocates of the strike misinterpreted the quote to suggest that Thatcher had used it as a reference to all miners.\nThatcher on 19 July 1984 delivered a speech in which she spoke to backbench MPs and compared the Falklands War to the strike:\n\nWe had to fight the enemy without in the Falklands. We always have to be aware of the enemy within, which is much more difficult to fight and more dangerous to liberty.\nShe claimed that the miners\u0027 leader was making the country witness an attempt at preventing democracy.\nOn the day after the Orgreave picket of 18 June, which saw five thousand pickets clash violently with police, she remarked:\n\nI must tell you... that what we have got is an attempt to substitute the rule of the mob for the rule of law, and it must not succeed. [cheering] It must not succeed. There are those who are using violence and intimidation to impose their will on others who do not want it.... The rule of law must prevail over the rule of the mob.\nNeil Kinnock supported the call for a national ballot in April 1984. Scargill\u0027s response to the Orgreave incident was:\n\nWe\u0027ve had riot shields, we\u0027ve had riot gear, we\u0027ve had police on horseback charging into our people, we\u0027ve had people hit with truncheons and people kicked to the ground.... The intimidation and the brutality that has been displayed are something reminiscent of a Latin American state.\nAt the Battle of Orgreave on 18 June 1984, the NUM pickets failed to stop the movement of lorries amid police violence and subsequent retaliation by the pickets, with the footage controversially reversed by the BBC on their news broadcast. The violence was costing the NUM public support in the country as a whole, as a Gallup poll showed 79% disapproval of NUM methods. While it was now clear that the government had the equipment, the forces, the organisation, and the will to prevail against pickets, the strong pro-strike solidarity outside of the Midlands and the possibility of extended strike action by other trade unions, especially the NACODS which could shut down every pit in the country if NACODS members went on strike, was a constant threat for the government and had the outcome of who would be likely to win the miners\u0027 strike dispute hanging in the balance for many months.\nThe number of miners at work grew to 53,000 by late June.\n\n\n==== Votes for strike action by area ====\nThe table shows a breakdown by area of the results of strike ballots of January 1982, October 1982 and March 1983, and the results of area ballots in March 1984. The table is taken from Callinicos \u0026 Simons .  Cases from 1984 where lodges voted separately are not shown.\n\n\n=== Mobilisation of police ===\nThe government mobilised police forces from around Britain including the Metropolitan Police in an attempt to stop pickets preventing strikebreakers from working. They attempted to stop pickets travelling from Yorkshire to Nottinghamshire which led to many protests. On 26 March 1984, pickets protested against the police powers by driving very slowly on the M1 and the A1 around Doncaster. The government claimed the  actions were to uphold the law and safeguard individual civil rights. The police were given powers to halt and reroute traffic away from collieries, and some areas of Nottinghamshire became difficult to reach by road.\nIn the first 27 weeks of the strike, 164,508 \u0022presumed pickets\u0022 were prevented from entering the county.  When pickets from Kent were stopped at the Dartford Tunnel and preventing from travelling to the Midlands, the Kent NUM applied for an injunction against use of this power.  Sir Michael Havers initially denied the application outright, but Mr Justice Skinner later ruled that the power may only be used if the anticipated breach of the peace were \u0022in close proximity both in time and place\u0022.\nOn 16 July 1984, Thatcher convened a ministerial meeting to consider declaring a state of emergency, with the option to use 4,500 military drivers and 1,650 tipper trucks to keep coal supplies available. This backup plan was not needed and was not implemented.\nDuring the strike 11,291 people were arrested and 8,392 were charged with breach of the peace or obstructing the highway. In many former mining areas antipathy towards the police remained strong for many years. Bail forms for picketing offences set restrictions on residence and movement in relation to NCB property.  Tony Benn compared the powers to the racial pass laws in South Africa.\n\n\n=== No welfare benefit payments ===\nWelfare benefits had never been available to strikers but their dependents had been entitled to make claims in previous disputes. Clause 6 of the Social Security Act 1980 banned the dependents of strikers from receiving \u0022urgent needs\u0022 payments and applied a compulsory deduction from the benefits of strikers\u0027 dependents. The government viewed the legislation not as concerned with saving public funds but \u0022to restore a fairer bargaining balance between employers and trade unions\u0022 by increasing the necessity to return to work.  The Department of Social Security assumed that striking miners were receiving £15 per week from the union , based on payments early in the strike that were not made in the later months when funds had become exhausted.\n\n\n=== MI5 \u0022counter-subversion\u0022 ===\nThe Director General of MI5 from 1992 to 1996, Dame Stella Rimington, wrote in her autobiography in 2001 that MI5 \u0027counter-subversion\u0027 exercises against the NUM and striking miners included tapping union leaders\u0027 phones. She denied the agency had informers in the NUM, specifically denying its chief executive Roger Windsor had been an agent.\n\n\n=== Public opinion and the media ===\nAccording to John Campbell \u0022though there was widespread sympathy for the miners, faced with the loss of their livelihoods, there was remarkably little public support for the strike, because of Scargill\u0027s methods\u0022. When asked in a Gallup poll in July 1984 whether their sympathies lay mainly with the employers or the miners, 40% said employers; 33% were for the miners; 19% were for neither and 8% did not know. When asked the same question during 5–10 December 1984, 51% had most sympathy for the employers; 26% for the miners; 18% for neither and 5% did not know. When asked in July 1984 whether they approved or disapproved of the methods used by the miners, 15% approved; 79% disapproved and 6% did not know. When asked the same question during 5–10 December 1984, 7% approved; 88% disapproved and 5% did not know. In July 1984, when asked whether they thought the miners were using responsible or irresponsible methods, 12% said responsible; 78% said irresponsible and 10% did not know. When asked the same question in August 1984, 9% said responsible; 84% said irresponsible and 7% did not know.\n\nThe Sun newspaper took a very anti-strike position, as did the Daily Mail, and even the Labour Party-supporting Daily Mirror and The Guardian became hostile as the strike became increasingly violent. The Morning Star was the only national daily newspaper that consistently supported the striking miners and the NUM.\nSocialist groups saw the mainstream media as deliberately misrepresenting the miners\u0027 strike, with Mick Duncan of the Alliance for Workers\u0027 Liberty saying of The Sun\u0027s reporting of the strike: \u0022The day-to-day reporting involved more subtle attacks, or a biased selection of facts and a lack of alternative points of view. These things arguably had a far bigger negative effect on the miners\u0027 cause\u0022.\nWriting in the Industrial Relations Journal immediately after the strike in 1985, Professor Brian Towers of the University of Nottingham commented on the way the media had portrayed strikers, stating that there had been \u0022the obsessive reporting of the \u0027violence\u0027 of generally relatively unarmed men and some women who, in the end, offered no serious challenge to the truncheons, shields and horses of a well-organised, optimally deployed police force.\u0022\nThe stance of the Daily Mirror varied. Having initially been uninterested in the dispute, the paper\u0027s owner Robert Maxwell took a supportive stance in July 1984 by organising a seaside trip for striking miners and meeting with NUM officials to discuss tactics. However, Maxwell insisted that Scargill should condemn the violence directed against strike-breakers, which he was unwilling to do. The Daily Mirror then adopted a more critical stance, and journalist John Pilger published several articles on the violence directed against strike-breakers.\n\n\n=== NUM links with Libya and the Soviet Union ===\nAs the courts seized the NUM\u0027s assets, it began to look abroad for money, and found supplies in the Eastern bloc and, it was mistakenly thought, also from Libya. These countries were highly unpopular with the British public. The Soviet Union\u0027s All-Union Central Council of Trade Unions, donated £1.5 million to the NUM.\nMedia reports alleged that senior NUM officials were personally keeping some of the funds. In November 1984, it was alleged that senior NUM officials had travelled to Libya for money. Cash from the Libyan government was particularly damaging coming seven months after the murder of policewoman Yvonne Fletcher outside the Libyan embassy in London by Libyan agents. In 1990, the Daily Mirror and TV programme The Cook Report claimed that Scargill and the NUM had received money from the Libyan government. The allegations were based on allegations by Roger Windsor, who was the NUM official who had spoken to Libyan officials. Roy Greenslade, the editor of the Daily Mirror, said 18 years later he was \u0022now convinced that Scargill didn\u0027t misuse strike funds and that the union didn\u0027t get money from Libya.\u0022 This was long after an investigation by Seumas Milne described the allegations as wholly without substance and a \u0022classic smear campaign\u0022.\nMI5 surveillance on NUM vice-president Mick McGahey found he was \u0022extremely angry and embarrassed\u0022 about Scargill\u0027s links with the Libyan regime, but did not express his concerns publicly; however he was happy to take money from the Soviet Union. Stella Rimington, wrote, \u0022We in MI5 limited our investigations to those who were using the strike for subversive purposes.\u0022\nPolish trade union Solidarity criticised Scargill for \u0022going too far and threatening the elected government\u0022, which influenced some Polish miners in Britain to oppose the strike.  Scargill opposed Solidarity as an \u0022anti-socialist organisation which desires the overthrow of a socialist state\u0022.  The supply of Polish coal to British power stations during the strike led to a brief picket of the embassy of Poland in London.\n\n\n=== Violence ===\n\n\n==== Against strikebreakers ====\nThe strike was the most violent industrial dispute in Britain of the 20th century.  Strikes in the British coal industry had a history of violence, but the 1984–1985 strike exceeded even the 1926 strike in the levels of violence.  Nevertheless, the majority of pickets lines were non-violent. Instances of violence directed against working miners were reported from the start. The BBC reported that pickets from Polmaise Colliery had punched miners at Bilston Glen Colliery who were trying to enter their workplace on 12 March. Property, families and pets belonging to working miners were also attacked.  Ted McKay, the North Wales secretary who supported a national ballot before strike action, said he had received death threats and threats to kidnap his children.  The intimidation of working miners in Nottinghamshire, vandalism to cars and pelting them with stones, paint or brake fluid, was a major factor in the formation of the breakaway UDM.\nOccasionally, attacks were made on working members of NACODS and administrative staff. In March 1984 the NCB announced it would abandon Yorkshire Main Colliery after a deputy engineer suffered a split chin from being stoned and administrative staff had to be escorted out by the police. Some pits continued working without significant disruption. In Leicestershire only 31 miners went on strike for the full 12 months and in South Derbyshire only 17, but these areas were not targeted by pickets in the same way as Nottinghamshire.\nOn 9 July 1984 pickets at Rossington Colliery attempted to trap 11 NCB safety inspectors inside the colliery. Camera teams were present as two police vans arrived to assist the safety inspectors and were attacked by missiles from the pickets.\nFollowing the breakdown of relations between the NUM and the ISTC , NUM pickets threw bricks, concrete and eggs full of paint at lorries transporting coal and iron ore to South Wales. In September 1984, Viv Brook, assistant chief constable of South Wales Police, warned that throwing concrete from motorway bridges was likely to kill someone. Taxi driver, David Wilkie, was killed on 30 November 1984 while driving a non-striking miner to Merthyr Vale Colliery, in South Wales. Two striking miners dropped a concrete post onto his car from a road bridge and he died at the scene. The miners served a prison sentence for manslaughter. Police reported that the incident had a sobering effect on many of the pickets and led to a decrease in aggression.\nIn Airedale, Castleford where most miners were on strike, a working miner, Michael Fletcher, was savagely beaten in November 1984.  A masked gang waving baseball bats invaded his house and beat him for five minutes, whilst his pregnant wife and children hid upstairs.  Fletcher suffered a broken shoulder blade, dislocated elbow and two broken ribs.  Two miners from Wakefield were convicted of causing grievous bodily harm and four others were acquitted of riot and assault.\nScargill said in December 1984 that those who returned to work after taking the NCB\u0027s incentives for strikebreaking should be treated as \u0022lost lambs\u0022 rather than traitors. When questioned by the media, Scargill refused to condemn the violence, which he attributed to the hardship and frustration of pickets, with the one exception being the killing of David Wilkie.  There was criticism of picket-line violence from lodges at striking pits, such as the resolution by the Grimethorpe and Kellingley lodges in Yorkshire that condemned throwing bricks.\nEven amongst supporters, picketing steel plants to prevent deliveries of coal and coke caused great divisions. Local branches agreed to deals with local steel plants on the amounts to be delivered. In June 1984, the NUM area leader for South Wales, Emlyn Williams, defied orders from Scargill to stop deliveries of coal by rail to steel plants, but he capitulated after a vote by the national executive to end dispensations.\n\n\n==== Against strikers and pickets ====\nViolence in Nottinghamshire was directed towards strikers and supporters of the NUM national line. NUM secretary Jimmy Hood reported his car was vandalised and his garage set on fire.  In Leicestershire, scab was chanted by the working majority against the few who went on strike, on the grounds that they had betrayed their area\u0027s union.\nTwo pickets, David Jones and Joe Green, were killed in separate incidents, and three teenagers died picking coal from a colliery waste heap in the winter. The NUM names its memorial lectures after the pickets.  Jones\u0027s death raised tensions between strikers and those who continued to work. On 15 March 1984, he was hit in the chest by a half-brick thrown by a youth who opposed the strike when he confronted him for vandalising his car, but the post-mortem ruled that this had not caused his death and it was more likely to have been caused by being pressed against the pit gates earlier in the day.  News of his death led to hundreds of pickets staying in Ollerton town centre overnight.  At the request of Nottinghamshire Police, Scargill appeared and called for calm in the wake of the tragedy.  Several working miners in Ollerton reported that their gardens and cars had been vandalised during the night. Ollerton Colliery closed for a few days as a mark of respect for Jones.\nPolicing was extensive from the start, a policy to avoid the problems of 1972, when the police were overwhelmed by the number of pickets at the Battle of Saltley Gate.  Many families in South Yorkshire complained that the police were abusive and damaged property needlessly whilst pursuing pickets.\nDuring the Battle of Orgreave, television cameras caught a policeman repeatedly lashing out at a picket on his head with a truncheon but no charges were made against the officer, identified as a member of Northumbria Police.  The heavy-handed policing at Orgreave, including from some senior officers was criticised.  At the 1985 Police Federation conference, Ronald Carroll from West Yorkshire Police argued that, \u0022The police were used by the Coal Board to do all their dirty work. Instead of seeking the civil remedies under the existing civil law, they relied completely on the police to solve their problems by implementing the criminal law.\u0022 A motion at the 1984 Labour Party conference won heavy support for blaming all the violence in the strike on the police, despite opposition from Kinnock.\n\n\n=== Fundraising ===\nUnion funds struggled to cover the year-long strike, so strikers had to raise their own funds. The Kent area\u0027s effective fundraising from sympathisers in London and in continental Europe was resented by other areas.  The Yorkshire area\u0027s reliance on mass picketing led to a neglect of fundraising, and many Yorkshire strikers were living in poverty by the winter of 1984.  A soup kitchen opened in Yorkshire in April 1984, for the first time since the 1920s.  Wakefield Council provided free meals for children during school holidays.  The Labour-dominated councils of Barnsley, Doncaster, Rotherham and Wakefield reduced council-house rents and local tax rates for striking miners, but the Conservative Selby Council refused any assistance, although the Selby pits had higher numbers of commuters.\nIn Leicestershire, the area\u0027s NUM made no payments to the few who went on strike, on the grounds that the area had voted against industrial action.  Fundraising for the so-called \u0022Dirty Thirty\u0022 striking Leicestershire miners was extensive and they redirected some of their excess aid to other parts of the NUM. Many local businesses in pit villages donated money to NUM funds, although some claimed they were threatened with boycotts or vandalism if they did not contribute.\nLesbians and Gays Support the Miners held \u0022Pits and Perverts\u0022 concerts to raise money which led the NUM to become supportive of gay rights in subsequent years. Some groups prioritised aid to pits in South Wales, as they felt that Scargill was distributing donations to his most favoured pits in Kent and Yorkshire. The ISTC donated food parcels and toys during the summer, but gave no money as they did not want to be accused of financing the aggressive picketing.\nChesterfield FC gave discounted tickets to striking miners until the start of 1985, when it abandoned the policy as most North Derbyshire miners had returned to work.\nBruce Springsteen donated $20,000 to the Northumberland and Durham Miners Support Group in the aftermath of the strike.\nIn Wales, the Welsh Language Society , a Welsh language pressure group, organised various actions in support of the striking miners. Notably, the society organised door-to-door food collections in the Welsh-speaking heartlands for donation to the miners and their families in the South Wales valleys; this was done from the second week of the strike until its conclusion the following year. The organisation also facilitated dairy farmers from rural Wales to travel to the southern valleys to distribute free milk in support of the miners. At the time, the dairy industry was struggling due to the milk quotas imposed by the Thatcher government. In another show of solidarity, members of the society in Carmarthenshire paid for a fifty-seater coach to bring the children of striking miners from the valleys to the county for their holidays, with some members even offering spare rooms in their homes for the children to stay in.\n\n\n==== Women Against Pit Closures ====\nIn the early weeks of the strike, the media reported that miners\u0027 wives in Nottinghamshire were encouraging their husbands to defy the flying pickets and were against the strike.  In response, a group of miners\u0027 wives and girlfriends who supported the strike set up a network that became known as Women Against Pit Closures. The support groups organised collections outside supermarkets, communal kitchens, benefit concerts and other activities. The strike marked an important development in the traditional mining heartlands, where feminist ideas had not been strong.\r\n\r\n== Variation in observing the strike ==\nThe figures below are given in Richards . The figures of working and striking miners were an issue of controversy throughout the dispute, and some other sources give figures that contradict Richards\u0027s table.\n\nNo figures are available for the 1,000 NCB staff employees.\nSome of the above areas were large and had high internal variances. Within the large geographical Yorkshire area, there was still something of a regional variation in observing the strike despite the still high 97.3% overall Yorkshire solidarity rate in observing the strike in November 1984, as miners from South Yorkshire were considerably more militant than miners from North Yorkshire. This was something which became clearer still in the last three months of the strike with the number of North Yorkshire miners drifting back to work.\nAt the South Leicester colliery, there was reportedly only one miner who stayed on strike for the full 12 months.\n\n\n=== Analysis of the situation in Nottinghamshire ===\nA number of reasons have been advanced for the lack of support by the Nottinghamshire miners for the strike. It was compared to the return to work led by George Spencer in Nottinghamshire  during the 1926 coal strike, but Nottinghamshire had gone on strike alongside other regions in 1972 and 1974.  Other explanations include the perception that Nottinghamshire pits were safe from the threat of closure, as they had large reserves, and the area-level incentive scheme introduced by Tony Benn caused them to be amongst the best-paid in Britain.\nDavid Amos noted that some pits in Nottinghamshire closed in the early 1980s.  He argues that Nottinghamshire miners reacted in the same way in 1984 as they did to the unofficial strikes in 1969 and 1970, both of which saw blockading of Nottinghamshire pits by striking miners from South Yorkshire and both of which were regarded as unconstitutional under NUM rules.\nAs the Nottinghamshire collieries had attracted displaced miners from Scotland and the north-east in the 1960s, it has been argued that they were reluctant to strike to stop pit closures when there had been no action to save their home pits from closure.  A large Polish community in Nottinghamshire had been alienated by Scargill\u0027s policy of supporting the Communist government in Poland against the Solidarity union, which the NUM previously had supported.  David John Douglass, a branch delegate at Hatfield Colliery dismissed the suggestions as the Doncaster pits also had large numbers of displaced and Polish miners, yet it was amongst the most militant areas of the NUM.\nNottinghamshire NUM executive Henry Richardson argued that the Nottinghamshire miners would have probably voted for strike had they not been subjected to so much intimidation within days of the walk-out in Yorkshire, which prompted many to defy the Yorkshire pickets as a matter of principle.  At some pits, most miners initially refused to cross picket lines formed by Welsh miners but returned to work when more aggressive pickets arrived from Yorkshire.  After the strike, Mick McGahey, one of the most prominent voices against a national ballot, said that he accepted \u0022some responsibility\u0022 for alienating the Nottinghamshire miners through aggressive picketing.  Jonathan and Ruth Winterton have suggested that the greater success of picketing in Lancashire, a region with little tradition of mining militancy but where the majority of its miners were on strike for the majority of the 1984–85 national strike, might be ascribed to the more diplomatic tactics of the North Yorkshire NUM pickets that went to Lancashire, and to the North Yorkshire NUM officials who worked with the Lancashire NUM to coordinate more respectful picketing, in contrast to the aggressive tactics adopted by South Yorkshire pickets in Nottinghamshire. The Marxist academic Alex Callinicos has suggested that the NUM officials had failed to make the case to their members adequately and believes that the Nottinghamshire miners were simply ignorant of the issues.\r\n\r\n== Responses to the strike ==\nThe opposition Labour Party was divided in its attitude, its leader Neil Kinnock, whose late father had been a miner, was critical of the government\u0027s handling of the strike, but distanced himself from the leadership of the NUM over the issues of the ballot and violence against strikebreakers.  Kinnock later said that it was \u0022the greatest regret of [his] whole life\u0022 that he did not call for a national ballot at an earlier stage. He condemned the actions of pickets and police as \u0022violence\u0022, which prompted a statement from the Police Federation that some officers would struggle to work under a Labour government.  He appeared on a picket line on 3 January 1985, after having said in November that he was \u0022too busy\u0022.\nKinnock appeared at a Labour Party rally alongside Scargill in Stoke-on-Trent on 30 November 1984 – the day of the killing of David Wilkie. His speech developed into an argument with hecklers who saw him as having betrayed the NUM by failing to support the strike. Kinnock began by saying, \u0022We meet here tonight in the shadow of an outrage.\u0022  When interrupted, Kinnock accused the hecklers of \u0022living like parasites off the struggle of the miners.\u0022  As Kinnock denounced the lack of the ballot, violence against strikebreakers and Scargill\u0027s tactical approach, he was asked by hecklers what he had done for the striking miners. Kinnock shouted back, \u0022Well, I was not telling them lies. That\u0027s what I was not doing during that period.\u0022 It was a thinly veiled attack on Scargill, whom he later admitted he detested. Kinnock later blamed Scargill for the failure of the strike.\nFormer party leader and prime minister James Callaghan said that a ballot was needed to decide when to end the strike and return to work. Tony Benn was vocal in support of Scargill\u0027s leadership during the strike.  In addition, 12 left-wing MPs refused to sit down in the Commons in January in an attempt to force a debate on the strike.\nThe Communist Party supported the strike and opposed Thatcher\u0027s government, but expressed reservations about Scargill\u0027s tactics. Peter Carter said that Scargill had \u0022the idea that the miners could win the strike alone through a re-run of Saltley Gate\u0022.  The 39th congress of the party passed a motion that the strike could not succeed without sympathy from the wider public and other unions, and that the aggressive picketing was dividing the working class and alienating public support.\nIn contrast to the close cooperation with the TUC in the 1970s, the NUM never asked the TUC to support the strike and wrote at the outset to say that, \u0022No request is being made by this union for the intervention or assistance of the TUC.\u0022  Scargill disliked Len Murray and blamed the TUC for the failure of the 1926 General Strike. Part way through the strike, Norman Willis took over from Murray as general secretary of the TUC. He attempted to repair relations between Scargill and Kinnock, but to no avail.  When speaking in a miners\u0027 hall in November 1984, Willis condemned the violence and advocated a compromise, which led to a noose being lowered slowly from the rafters until it rested close to his head.\nThe NUM had a \u0022Triple Alliance\u0022 with the ISTC and the railway unions. Solidarity action was taken by railway workers and few crossed picket lines, but the NUM never asked the railway unions to strike.  In contrast, Scargill demanded that steel workers not cross miners\u0027 picket lines and only work to keep furnaces in order.  Bill Sirs of the ISTC felt that Scargill was reneging on an agreement to deliver coke. British Steel was planning to close a steel plant and steel workers feared that support for the strikers might make closure more likely.\n\nThe National Union of Seamen supported the strike and limited the transport of coal. The decision was taken by a delegates\u0027 conference and not authorised by an individual ballot. Transport leaders, Ross Evans and Ron Todd, supported the NUM \u0022without reservation\u0022, but an increasing proportion of drivers were not unionised and they failed to have much influence. The Electrical, Electronic, Telecommunications and Plumbing Union, actively opposed the strike; Ian MacGregor\u0027s autobiography detailed how its leaders supplied the government with information that allowed the strike to be defeated.  The EETPU was supportive of the breakaway Union of Democratic Mineworkers and met with its leaders before the TUC had extended formal recognition.\r\n\r\n== Long-term impact ==\nDuring the strike, many pits lost their customers and the immediate problem facing the industry was due to the economic recession of the early-1980s. There was extensive competition in the world coal market and a concerted move towards oil and gas for power production. The government\u0027s policy, the Ridley Plan, was to reduce Britain\u0027s reliance on coal on the grounds that it could be imported from Australia, the United States and Colombia more cheaply than it could be produced in Britain. The strike emboldened the NCB to accelerate the closure of pits on economic grounds.\nTensions between strikers and those who worked continued after the return to work. Many strikebreakers left the industry and were shunned or attacked by other miners. Almost all the strikebreakers in Kent had left the industry by April 1986, after suffering numerous attacks on their homes.  At Betteshanger Colliery, posters were put up with photographs and names of the thirty strikebreakers.  A wildcat strike at South Kirkby Colliery was supported by neighbouring Ferrymoor-Riddings on 30 April 1985 after four men were dismissed for attacks on strikebreakers, and another wildcat strike occurred at Hatfield Colliery in April 1986 after it emerged that there was a strikebreaker had not been transferred away from the pit.  In contrast, other pits that had been divided by the strike managed to work without any harassment.\nThe NCB was accused of deserting the strikebreakers, as abuse, threats and assaults continued, and requests for transfers to other pits were declined.  Michael Eaton argued that \u0022a decision to return to work was a personal decision on the part of the individual.\u0022\nMiners were demoralised and sought work in other industries. Scargill\u0027s authority in the NUM was challenged and his calls for another strike in 1986 were ignored. Mick McGahey, who was loyal to Scargill during the strike, became critical of him. McGahey claimed the leadership was becoming separated from its membership, the violence had gone too far and argued for reconciliation with the UDM. Scargill said that it was a \u0022tragedy that people from the far north should pontificate about what we should be doing to win back members for the NUM.\u0022 Scargill became president of the NUM for life in 1985.\nIn the aftermath of the strike, miners were offered large redundancy payments in ballots organised by the NCB and the  offers were accepted even at the most militant pits. The manager of the militant Yorkshire Main Colliery said at the time of the pit\u0027s vote to close in October 1985, \u0022I know people who abused us and threatened us on the picket line and then were the first to put in for redundancy.\u0022\nIn 1991, the South Yorkshire Police paid compensation of £425,000 to 39 miners who were arrested during the incident. This was for \u0022assault, false imprisonment and malicious prosecution\u0022.\nThe coal industry was privatised in December 1994 creating  \u0022R.J.B. Mining\u0022, subsequently known as UK Coal. Between the end of the strike and privatisation, pit closures continued with many closures in the early-1990s. There were 15 British Coal deep mines left in production at the time of privatisation, but by March 2005, there were only eight deep mines left. Since then, the last pit in Northumberland, Ellington Colliery has closed whilst pits at Rossington and Harworth have been mothballed. In 1983, Britain had 174 working collieries; by 2009 there were six. The last deep colliery in the UK, Kellingley Colliery, known locally as \u0022The Big K\u0022 closed for the last time on 18 December 2015, bringing an end to centuries of deep coal mining.\nThe 1994 European Union inquiry into poverty classified Grimethorpe in South Yorkshire as the poorest settlement in the country and one of the poorest in the EU. South Yorkshire became an Objective 1 development zone and every ward in the City of Wakefield district was classified as in need of special assistance.\nIn 2003, the reduced mining industry was reportedly more productive in terms of output per worker than the coal industries in France, Germany and the United States.\nA murder in Annesley, Nottinghamshire in 2004 was believed to be the result of an argument between former members of the NUM and UDM, indicating continued tensions, but was subsequently found to be unrelated.\nIn the 2016 Brexit referendum, cities and regions at the heart of the dispute voted by a majority to leave. Scargill, a supporter of leaving the EU, said that the Brexit vote presented an opportunity to re-open closed coal mines.\nIn 2021 Peter Fahy, the former chief constable of Greater Manchester Police, argued the policing of the strike was politically motivated and \u0022took policing a long time to recover\u0022 from, and warned that the proposed Police, Crime, Sentencing and Courts Bill risked drawing policing into politics once more.\n\n\n=== Pardons ===\nIn October 2020, the Scottish Government announced plans to introduce legislation to pardon Scottish miners convicted of certain offences during the strike. The announcement, by Humza Yousaf, the Scottish justice secretary, followed the recommendation of an independent review on the impact of policing on communities during the strike.\r\n\r\n== Historical assessments ==\nMany historians have provided interpretations and explanations of the defeat, largely centring on Scargill\u0027s decisions.\n\nNumerous scholars have concluded that Scargill\u0027s decisive tactical error was to substitute his famous flying picket for the holding of a national strike ballot. His policy divided the NUM membership, undermined his position with the leaders of the trade union movement, hurt the union\u0027s reputation in British public opinion, and led to violence along the picket line. That violence strengthened the stature of the Coal Board and  the Thatcher government.\nRobert Taylor depicts Scargill as an \u0027industrial Napoleon\u0027 who called a strike \u0027at the wrong time\u0027 on the \u0027wrong issue\u0027, and adopted strategies and tactics that were \u0027impossibilist\u0027, with \u0027an inflexible list of extravagant non-negotiable demands\u0027 that amounted to \u0027reckless adventurism\u0027 that was \u0027a dangerous, self-defeating delusion\u0027.\nJournalist Andrew Marr argues that:\nMany found Scargill inspiring; many others found him frankly scary. He had been a Communist and retained strong Marxist views and a penchant for denouncing anyone who disagreed with him as a traitor.... Scargill had indeed been elected by a vast margin and he set about turning the NUM\u0027s once moderate executive into a reliably militant group.... By adopting a position that no pits should be closed on economic grounds, even if the coal was exhausted...he made sure confrontation would not be avoided. Exciting, witty Arthur Scargill brought coalmining to a close in Britain far faster than would have happened had the NUM been led by some prevaricating, dreary old-style union hack.\nIn a book published by the National Coal Mining Museum for England, David John Douglass argues that too much focus has been put on the personality of Scargill and not enough on the decision of the Yorkshire NUM to invoke the area\u0027s 1981 ballot result to strike against economic closures.\nThere is a prevailing view that Arthur Scargill, the NUM National President, called the strike. He did not. The strike started in Yorkshire, and he was not present at the delegate Council meeting in Barnsley. He had no means of calling a strike in Yorkshire.\nIn January 2014, Prime Minister David Cameron stated, \u0022I think if anyone needs to make an apology for their role in the miners\u0027 strike it should be Arthur Scargill for the appalling way that he led the union.\u0022 This was in the Prime Minister\u0027s rejection of Labour calls for an apology for government actions during the 1984–1985 miners\u0027 strike. His comments followed a question in the Commons from Labour MP Lisa Nandy, who said the miners and their families deserved an apology for the mine closures.\r\n\r\n== Cultural references ==\n\n\n=== Films and television ===\nIndependent filmmakers documented the strike including the behaviour of the police, the role of miners\u0027 wives and the role of the media. The outcome was the Miner\u0027s Campaign Tapes.\nKen Loach made three films about the strike. Which Side Are You On? focussed on music and poetry was made for The South Bank Show but was rejected on the grounds that it was too politically partial for an arts programme. After winning an award at an Italian film festival, it was broadcast on Channel 4 on 9 January 1985. End of the Battle... Not the End of the War? suggested that the Conservative Party planned tactics for defeating the NUM from the early 1970s. The Arthur Legend, broadcast for Dispatches on Channel 4 in 1991, analysed allegations of financial impropriety and links with Libya against Arthur Scargill, and argued that the claims made by the Daily Mirror and The Cook Report were baseless.\nThe setting for the 1986 anime film Castle in the Sky was inspired by the Welsh strikes. Director Hayao Miyazaki was visiting Wales at the time, and was impressed by the way the Welsh miners fought to save their way of life, and their sense of community.\nThe 2000 film Billy Elliot, set in 1984, was based around mining communities in Easington Colliery and Seaham. The father and brother of the title character are striking miners. Several scenes depict the chaos at picket lines, clashes between armies of police and striking miners, and the shame associated with crossing the picket line. It showed the abject poverty associated with the strike and the harshness and desperation of not having coal for heat in winter. The film was turned into a musical, Billy Elliot the Musical with music by Elton John and book and lyrics by Lee Hall, who wrote the film\u0027s screenplay.\nThe 1996 film Brassed Off was set 10 years after the strike in the era when numerous pits closed before the privatisation of British Coal. The film refers to the strike and some of the dialogue contrasts the resistance in 1984 with the resignation with which most miners responded to the pit closures of the early 1990s. It was set in the fictional town of Grimley, a thin disguise for the hard-hit ex-mining village of Grimethorpe, where some of it was filmed.\nThe satirical Comic Strip Presents episode \u0022The Strike\u0022 depicts an idealistic Welsh screenwriter\u0027s growing dismay as his hard-hitting and grittily realistic script about the strike is mutilated by a Hollywood producer into an all-action thriller. The film parodies Hollywood films by overdramatising the strike and changing most of the important historic facts. It won a Golden Rose and Press Reward at the Montreux Festival.\nThe \u00221984\u0022 episode of the 1996 BBC television drama serial Our Friends in the North revolves around the strike, and scenes of clashes between the police and strikers were re-created using many men who had taken part in the real-life events on the miners\u0027 side. In 2005, BBC One broadcast the one-off drama Faith, written by William Ivory. Many of the social scenes were filmed in the former colliery town of Thorne, near Doncaster. It viewed the strike from the perspective of both the police and the miners.\nThe British film The Big Man casts Liam Neeson as a Scottish coalminer who has been unemployed since the strike. His character has been blacklisted due to striking a police officer and has served a six-month prison sentence for the offence.\nThe 2014 film Pride, directed by Matthew Warchus, is based on a true story of a group of LGBT activists who raised funds to assist and support families in a Welsh mining village.\nDavid Peace\u0027s novel GB84 is set during the strike.\nVal McDermid\u0027s novel A Darker Domain has a plotline set in the strike. Multiple reviewers gave the book acclaim for exploring its social and emotional repercussions.\nKay Sutcliffe, the wife of a striking miner at Aylesham, wrote the poem \u0022Coal not Dole\u0022, which became popular with the Women Against Pit Closures groups across the country and was later made into a song by Norma Waterson.\nThe verse novel Hope Now by A. L. Richards, published 2013 by Landfox Press, is set in the South Wales Valleys and is based on events during the strike.\nIn 2001, British visual artist Jeremy Deller worked with historical societies, battle re-enactors, and people who participated in the violent 1984 clashes between picketers and police to reconstruct and re-enact the Battle of Orgreave. A documentary about the re-enactment was produced by Deller and director Mike Figgis and was broadcast on British television; and Deller published a book called The English Civil War Part II documenting both the project and the historical events it investigates.\nOn 5 March 2010, the 25th anniversary of the strike, an artwork by visual artist Dan Savage was unveiled in Sunderland Civic Centre. Commissioned by Sunderland City Council, Savage worked with the Durham Miners Association to create the large scale commemorative window, which features images and symbols of the strike and the North East\u0027s mining heritage.\nIn August 1984, photographer Keith Pattison was commissioned by Sunderland\u0027s Artists\u0027 Agency to photograph the strike in Easington Colliery for a month. He remained there on and off until it ended in March 1985, photographing from behind the lines a community rallying together against implacable opposition. Twenty-five years later, on 6 May 2010, Election Day, Pattison took David Peace to Easington to interview three of the people caught up in the strike. A selection of the photographs together with the interviews were published in book form – \u0027No Redemption\u0027 .\nPremiering on 13 June 2022, the BBC One series Sherwood is a fictionalized murder mystery set both in 1984 and in the present day in the Ashfield area of Nottinghamshire surrounding deep divisions in the community between striking miners, police officers, non-striking miners, and their descendants.\nIn 2024 a documentary film about the strikes was shown on BBC Two, called Miners\u0027 Strike: A Frontline Story. The documentary was directed by Ben Anthony and presented both archive footage and stories from individuals directly involved in the strike.\n\n\n=== Music ===\nThe Clash staged two benefit concerts for the striking miners at Brixton Academy in London. The strike is the subject of songs by many music groups including the Manic Street Preachers\u0027 \u0022A Design for Life\u0022, and \u00221985\u0022, from the album Lifeblood; Pulp\u0027s \u0022Last Day of the Miners\u0027 Strike\u0022; Funeral for a Friend\u0027s \u0022History\u0022, and Ewan MacColl\u0027s cassette of pro-NUM songs Daddy, What Did You Do In The Strike?. Sting recorded a song about the strike called \u0022We Work the Black Seam\u0022 for his first solo album, The Dream of the Blue Turtles, in 1985.\nBilly Bragg\u0027s version of \u0022Which Side Are You On?\u0022, encapsulated the strikers\u0027 feeling of betrayal by the perceived indifference of wider elements within British society. Bragg raised awareness through his music and disagreement with the Thatcher government.\nCrowd sounds from the strike feature at the start of The Smiths\u0027 1987 song \u0022Last Night I Dreamt That Somebody Loved Me\u0022. However, this version only appears on the album Strangeways, Here We Come and not the single edit which has made subsequent compilation albums.\nThroughout the strike, the South London group Test Dept travelled on their \u0022battle bus\u0022 to Yorkshire, Durham, Northumberland, Paddington and Glasgow. They filmed images of the strike in one town and showed at their next gig, where they met the miners, joined pickets and raised funds. The songs of the South Wales Striking Miners\u0027 Choir and the speeches of Kent miner Alan Sutcliffe are included on their 1985 album Shoulder to Shoulder.\nChris Cutler, Tim Hodgkinson and Lindsay Cooper from Henry Cow, along with Robert Wyatt and poet Adrian Mitchell recorded The Last Nightingale in October 1984 to raise money for the strikers and their families.\n\u0022Red Hill Mining Town\u0022, by U2 is about the breakdown of relationships during the strike.\nThe storyline of Radio K.A.O.S., a 1987 album by Roger Waters, makes several references to the strike and its repercussions.\nThe strike saw the resurgence of traditional folk songs about coal mining. Dick Gaughan released a mixture of old and new songs on his LP True and Bold. An old Northumbrian folk song, \u0022Blackleg Miner\u0022 gained attention when recorded by Steeleye Span in 1970 and was played to show support for the NUM and intimidate strikebreakers.\nThe album Every Valley from Public Service Broadcasting is based on the history of the mining industry in Wales, more specifically chronicling the rise and decline of the country\u0027s coal industry, the miners\u0027 strike plays a huge role on the album.\n\u0022The Charge\u0022, from New Model Army compares the Miners\u0027 strike to \u0022The charge of the Light Brigade\u0022.\n\n\n=== Video games ===\nThe first entry in the Monty Mole series of games, Wanted: Monty Mole, published for the ZX Spectrum and Commodore 64 in 1984, was directly inspired by reports of miners\u0027 families\u0027 stealing coal during the strike: the game involves Monty Mole stealing coal to heat his home.\n\n\n=== Literature ===\nThe historical fiction novel \u0022Minor Miner\u0022 by Matthew Morgan is a conspiracy drama in which the Thatcher government intentionally escalates tensions with Libya in 1984 to draw attention away from the controversial UK Miners\u0027 Strikes in an attempt to improve the political party\u0027s approval ratings ahead of an election.\n\n\n=== Tabletop games ===\nThe miner\u0027s strike was satirized in the 1986 Warhammer Fantasy Battles scenario pack The Tragedy Of McDeath, which featured dwarf miners led by a dwarf named Arka Zargul, referencing Arthur Scargill. The enemy of the dwarf miners was a man called Een McWrecker, based on Ian MacGregor.",
  "imageNames": [
    "Hull_cranes_during_dockers_strike_1984.JPG",
    "KentNUMStrikeBadge.JPG",
    "Margaret_Thatcher_1983.jpg",
    "Miners_strike_rally_London_1984.jpg",
    "Premier_Thatcher_tijdens_een_persconferentie_Bestanddeelnr_932-7044.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1984,
  "end": 1985,
  "categoryId": "diwydiant",
  "id": "streic-glowyr",
  "label": "Miners\u0027 strike"
}