{
  "wikiSummary": "RMS Titanic was a British ocean liner that sank in the early hours of 15 April 1912 as a result of striking an iceberg on her maiden voyage from Southampton, England, to New York City, United States. Of the estimated 2,224 passengers and crew aboard, approximately 1,500 died , making the incident one of the deadliest peacetime sinkings of a single ship. Titanic, operated by White Star Line, carried some of the wealthiest people in the world, as well as hundreds of emigrants from the British Isles, Scandinavia, and elsewhere in Europe who were seeking a new life in the United States and Canada. The disaster drew public attention, spurred major changes in maritime safety regulations, and inspired a lasting legacy in popular culture. It was the second time White Star Line had lost a ship on her maiden voyage, the first being RMS Tayleur in 1854. \nTitanic was the largest ship afloat upon entering service and the second of three Olympic-class ocean liners built for White Star Line. The ship was built by the Harland and Wolff shipbuilding company in Belfast. Thomas Andrews Jr., the chief naval architect of the shipyard, died in the disaster. Titanic was under the command of Captain Edward John Smith, who went down with the ship. J. Bruce Ismay, White Star Line\u0027s chairman, managed to get into a lifeboat and survived.\nThe first-class accommodations were designed to be the pinnacle of comfort and luxury. They included a gymnasium, swimming pool, smoking rooms, fine restaurants and cafes, a Victorian-style Turkish bath, and hundreds of opulent cabins. A high-powered radiotelegraph transmitter was available to send passenger \u0022marconigrams\u0022 and for the ship\u0027s operational use. Titanic had advanced safety features, such as watertight compartments and remotely activated watertight doors, which contributed to the ship\u0027s reputation as \u0022unsinkable\u0022.\nTitanic was equipped with sixteen lifeboat davits, each capable of lowering three lifeboats, for a total capacity of 48 boats. Despite this capacity, the ship was scantly equipped with a total of only twenty lifeboats. Fourteen of these were regular lifeboats, two were cutter lifeboats, and four were collapsible and proved difficult to launch while the ship was sinking. Together, the lifeboats could hold 1,178 people - roughly half the number of passengers on board, and a third of the number of passengers the ship could have carried at full capacity . The British Board of Trade\u0027s regulations required fourteen lifeboats for a ship of 10,000 tonnes. Titanic carried six more than required, allowing 338 extra people room in lifeboats. When the ship sank, the lifeboats that had been lowered were only filled up to an average of 60%.",
  "wikiArticle": "RMS Titanic was a British ocean liner that sank in the early hours of 15 April 1912 as a result of striking an iceberg on her maiden voyage from Southampton, England, to New York City, United States. Of the estimated 2,224 passengers and crew aboard, approximately 1,500 died , making the incident one of the deadliest peacetime sinkings of a single ship. Titanic, operated by White Star Line, carried some of the wealthiest people in the world, as well as hundreds of emigrants from the British Isles, Scandinavia, and elsewhere in Europe who were seeking a new life in the United States and Canada. The disaster drew public attention, spurred major changes in maritime safety regulations, and inspired a lasting legacy in popular culture. It was the second time White Star Line had lost a ship on her maiden voyage, the first being RMS Tayleur in 1854. \nTitanic was the largest ship afloat upon entering service and the second of three Olympic-class ocean liners built for White Star Line. The ship was built by the Harland and Wolff shipbuilding company in Belfast. Thomas Andrews Jr., the chief naval architect of the shipyard, died in the disaster. Titanic was under the command of Captain Edward John Smith, who went down with the ship. J. Bruce Ismay, White Star Line\u0027s chairman, managed to get into a lifeboat and survived.\nThe first-class accommodations were designed to be the pinnacle of comfort and luxury. They included a gymnasium, swimming pool, smoking rooms, fine restaurants and cafes, a Victorian-style Turkish bath, and hundreds of opulent cabins. A high-powered radiotelegraph transmitter was available to send passenger \u0022marconigrams\u0022 and for the ship\u0027s operational use. Titanic had advanced safety features, such as watertight compartments and remotely activated watertight doors, which contributed to the ship\u0027s reputation as \u0022unsinkable\u0022.\nTitanic was equipped with sixteen lifeboat davits, each capable of lowering three lifeboats, for a total capacity of 48 boats. Despite this capacity, the ship was scantly equipped with a total of only twenty lifeboats. Fourteen of these were regular lifeboats, two were cutter lifeboats, and four were collapsible and proved difficult to launch while the ship was sinking. Together, the lifeboats could hold 1,178 people - roughly half the number of passengers on board, and a third of the number of passengers the ship could have carried at full capacity . The British Board of Trade\u0027s regulations required fourteen lifeboats for a ship of 10,000 tonnes. Titanic carried six more than required, allowing 338 extra people room in lifeboats. When the ship sank, the lifeboats that had been lowered were only filled up to an average of 60%.\r\n\r\n== Background ==\n\nThe name Titanic derives from the Titans of Greek mythology. Built in Belfast, Ireland, in what was then the United Kingdom of Great Britain and Ireland, RMS Titanic was the second of the three Olympic-class ocean liners—the lead vessel was RMS Olympic and the final ship in the class was HMHS Britannic.  They were by far the largest vessels of the British shipping company White Star Line\u0027s fleet, which comprised 29 steamers and tenders in 1912. The three ships had their genesis in a discussion in mid-1907 between the White Star Line\u0027s chairman, J. Bruce Ismay, and the American financier J. P. Morgan, who controlled the White Star Line\u0027s parent corporation, the International Mercantile Marine Co. .\nWhite Star faced an increasing challenge from its main rivals, Cunard Line—which, with the aid of the Admiralty, had recently launched the twin sister ships Lusitania and Mauretania, the fastest passenger ships then in service—and the German lines Hamburg America and Norddeutscher Lloyd. Ismay preferred to compete on size rather than speed and proposed to commission a new class of liners larger than anything that had come before, which would be the last word in comfort and luxury.  The new ships would have sufficient speed to maintain a weekly service with only three ships instead of the original four. Olympic and Titanic would replace RMS Teutonic of 1889, RMS Majestic of 1890 and RMS Adriatic of 1907. RMS Oceanic first departed from a new home port in June 1907 along with the Teutonic, Majestic, and the new Adriatic on the Southampton-New York run.\nThe ships were constructed by the Belfast shipbuilder Harland \u0026 Wolff, which had a long-established relationship with the White Star Line dating back to 1867. Harland and Wolff were given a great deal of latitude in designing ships for the White Star Line; the usual approach was for Wilhelm Wolff to sketch a general concept, which Edward James Harland would turn into a ship design. Cost considerations were a relatively low priority; Harland \u0026 Wolff were authorised to spend what it needed on the ships, plus a five per cent profit margin. In the case of the Olympic-class ships, a cost of £3 million for the first two ships was agreed, plus \u0022extras to contract\u0022 and the usual five per cent fee.\nHarland and Wolff put their leading designers to work designing Olympic-class vessels. The design was overseen by Lord Pirrie, a director of both Harland and Wolff and the White Star Line; naval architect Thomas Andrews, the managing director of Harland and Wolff\u0027s design department; Edward Wilding, Andrews\u0027s deputy and responsible for calculating the ship\u0027s design, stability and trim; and Alexander Carlisle, the shipyard\u0027s chief draughtsman and general manager. Carlisle\u0027s responsibilities included the decorations, equipment, and all general arrangements, including the implementation of an efficient lifeboat davit design.\nOn 29 July 1908, Harland and Wolff presented the drawings to J. Bruce Ismay and other White Star Line executives. Ismay approved the design and signed three \u0022letters of agreement\u0022 two days later, authorising the start of construction. At this point, the first ship—which was later to become Olympic—had no name but was referred to simply as \u0022Number 400\u0022, as it was Harland and Wolff\u0027s 400th hull. Titanic was based on a revised version of the same design and was given the number 401.\r\n\r\n== Dimensions and layout ==\n\nTitanic was 882 feet 9 inches long with a maximum breadth of 92 feet 6 inches .\nThe ship\u0027s total height, measured from the base of the keel to the top of the bridge, was 104 feet . Titanic measured 46,329 GRT and 21,831 NRT and with a draught of 34 feet 7 inches and displaced 52,310 tonnes.\nAll three of the Olympic-class ships had ten decks , eight of which were for passenger use. From top to bottom, the decks were:\n\nThe boat deck, on which the lifeboats were housed. It was from here during the early hours of 15 April 1912 that Titanic\u0027s lifeboats were lowered into the North Atlantic. The bridge and wheelhouse were at the forward end, in front of the captain\u0027s and officers\u0027 quarters. The bridge stood 8 feet above the deck, extending out to either side so that the ship could be controlled while docking. The wheelhouse stood within the bridge. The entrance to the First Class Grand Staircase and gymnasium were located midships along with the raised roof of the First Class lounge, while at the rear of the deck were the roof of the First Class smoke room and the Second Class entrance. Just forward of the Second Class entrance sat the kennels, where the First Class passengers\u0027 dogs would stay. The wood-covered deck was divided into four segregated promenades: for officers, First Class passengers, engineers, and Second Class passengers respectively. Lifeboats lined the side of the deck except in the First Class area, where there was a gap so that the view would not be spoiled.\nA Deck, also called the promenade deck, extended along the entire 546 feet length of the superstructure. It was reserved exclusively for First Class passengers and contained First Class cabins, the First Class reading and writing room, lounge, smoke room, and Palm Court.\nB Deck, the bridge deck, was the top weight-bearing deck and the uppermost level of the hull. More First Class passenger accommodations were located here with six palatial staterooms featuring their own private promenades. On Titanic, the à la carte restaurant and the Café Parisien provided luxury dining facilities to First Class passengers. Both were run by subcontracted chefs and their staff; all were lost in the disaster. The Second Class smoking room and entrance hall were both located on this deck. The raised forecastle of the ship was forward of the bridge deck, accommodating Number 1 hatch , numerous pieces of machinery and the anchor housings. Aft of the bridge deck was the raised poop deck, 106 feet long, used as a promenade by Third Class passengers. It was where many of Titanic\u0027s passengers and crew made their last stand as the ship sank. The forecastle and poop deck were separated from the bridge deck by well decks.\nC Deck, the shelter deck, was the highest deck to run uninterrupted from stem to stern. It included both well decks; the aft one served as part of the Third-Class promenade. Crew cabins were housed below the forecastle and Third-Class public rooms were housed below the poop deck. In between were the majority of First Class cabins and the Second-Class library.\nD Deck, the saloon deck, was dominated by three public rooms—the First-Class reception room, the First-Class dining saloon and the Second-Class dining saloon. The first- and second-class galleys were also located on this deck. An open space was provided for Third Class passengers. First, Second- and Third-Class passengers had cabins on this deck, with berths for firemen located in the bow. It was the highest level reached by the ship\u0027s watertight bulkheads .\nE Deck, the upper deck, was predominantly used for passenger accommodation for all three classes plus berths for cooks, seamen, stewards and trimmers. Along its length ran a long passageway nicknamed \u0027Scotland Road\u0027, in reference to a famous street in Liverpool. Scotland Road was used by Third Class passengers and crew members.\nF Deck, the middle deck, mainly accommodated Second- and Third-Class passengers and several departments of the crew. The Third Class dining saloon was located here, as was the First Class bath complex, containing the swimming pool and the Turkish bath.\nG Deck, the lower deck, had the lowest portholes, just above the waterline. The first-class squash court was located here along with the travelling post office where letters and parcels were sorted ready for delivery when the ship docked. Food was also stored here. The deck was interrupted at several points by orlop decks over the boiler, engine and turbine rooms.\nThe orlop deck, and the tank top below that, named because of the water tanks and ballast tanks stored in the ships double bottom,were on the lowest level of the ship, below the waterline. The orlop decks were used as cargo spaces, while the tank top—the inner bottom of the ship\u0027s hull—provided the platform on which the ship\u0027s boilers, engines, turbines and electrical generators were housed. This area of the ship was occupied by the engine and boiler rooms, areas which passengers would have been prohibited from seeing. They were connected with higher levels of the ship by two flights of stairs in the fireman\u0027s passage; twin spiral stairways near the bow provided access up to D Deck. Ladders in the boiler, turbine, and engine rooms provided access to higher decks in those compartments.\r\n\r\n== Features ==\n\n\n=== Power ===\n\nTitanic propulsion was supplied by three main engines—two reciprocating four-cylinder, triple-expansion steam engines and one centrally placed low-pressure Parsons turbine—each driving a propeller. The two reciprocating engines had a combined output of 30,000 horsepower . The output of the steam turbine was 16,000 horsepower . The White Star Line had used the same combination of engines on an earlier liner, Laurentic, where it had been a great success. It provided a good combination of performance and speed; reciprocating engines by themselves were not powerful enough to propel an Olympic-class liner at the desired speeds, while turbines were sufficiently powerful but caused uncomfortable vibrations, a problem that affected the all-turbine Cunard liners Lusitania and Mauretania. By combining reciprocating engines with a turbine, fuel usage could be reduced and motive power increased, while using the same amount of steam.\nThe two reciprocating engines were each 63 feet long and weighed 720 tonnes, with their bedplates contributing a further 195 tonnes. They were powered by steam produced in 29 boilers, 24 of which were double-ended and five single-ended, which contained a total of 159 furnaces. The boilers were 15 feet 9 inches in diameter and 20 feet long, each weighing 91.5 tonnes and capable of holding 48.5 tonnes of water.\nThey were fuelled by burning coal, 6,611 tonnes of which could be carried in Titanic\u0027s bunkers, with a further 1,092 tonnes in Hold 3. The furnaces required over 600 tonnes of coal a day to be shovelled into them by hand, requiring the services of 176 firemen working around the clock. 100 tonnes of ash a day had to be disposed of by ejecting it into the sea. The work was relentless, dirty and dangerous, and although firemen were paid relatively well, there was a high suicide rate among those who worked in that capacity.\nExhaust steam leaving the reciprocating engines was fed into the turbine, which was situated aft. From there it passed into a surface condenser, to increase the efficiency of the turbine and so that the steam could be condensed back into water and reused. The engines were attached directly to long shafts which drove the propellers. There were three, one for each engine; the outer propellers were the largest, each carrying three blades of manganese-bronze alloy with a total diameter of 23.5 feet . The middle propeller was slightly smaller at 17 feet in diameter, and could be stopped but not reversed.\nTitanic\u0027s electrical plant was capable of producing more power than an average city power station of the time. Immediately aft of the turbine engine were four 400 kW steam-driven electric generators, used to provide electrical power to the ship, plus two 30 kW auxiliary generators for emergency use. Their location in the stern of the ship meant they remained operational until the last few minutes before the ship sank.\nTitanic lacked a searchlight, in accordance with the ban on the use of searchlights in the merchant navy.\n\n\n=== Technology ===\n\n\n==== Compartments and funnels ====\nThe interiors of the Olympic-class ships were subdivided into 16 primary compartments divided by 15 bulkheads that extended above the waterline. The eleven vertically closing watertight doors on the orlop deck could be closed automatically via a switch on the bridge, by a lever next to the door itself, or by an automatic buoyancy mechanism that would activate in the event water reached six feet high in the compartment. There were also several other horizontally closing watertight doors along Scotland Road, and various crew and third class passenger spaces on the G, F, and E decks. These doors required a small key to be placed into a slot on the deck above. Once the key was turned, the watertight door would close. The ship\u0027s exposed decking was made of pine and teak, while interior ceilings were covered in painted granulated cork to combat condensation. Standing above the decks were four funnels, each painted in the White Star buff with black tops; only three were functional—the aftmost one was a dummy, installed for aesthetic purposes, and used for providing ventilation to the kitchen, as well as for the First and Second Class smoking rooms. Two masts, each 155 ft high, supported derricks for working cargo.\n\n\n==== Rudder and steering engines ====\nTitanic\u0027s rudder was 78 feet 8 inches high and 15 feet 3 inches long, weighing over 100 tonnes. Its size was such that it required steering engines to move it. Two steam-powered steering engines were installed, though only one was used at any given time, with the other one kept in reserve. They were connected to the short tiller through stiff springs, to isolate the steering engines from any shocks in heavy seas or during fast changes of direction. As a last resort, the tiller could be moved by ropes connected to two steam capstans. The capstans were also used to raise and lower the ship\u0027s five anchors .\n\n\n==== Water, ventilation and heating ====\nThe ship was equipped with waterworks capable of heating and pumping water to all parts of the vessel via a complex network of pipes and valves. The main water supply was taken aboard while Titanic was in port, but in an emergency, the ship could also distil fresh water from seawater. However, this was not a straightforward process as the distillation plant could quickly become clogged by salt deposits. A network of insulated ducts conveyed warm air around the ship with electric fans and First-Class cabins were fitted with additional electric heaters. The \u0022Sirocco Fan\u0022 a centrifugal fan was used after a deal with H\u0026W took place with Davidson and Co, Sirocco Works.\n\n\n==== Radio communications ====\n\nTitanic\u0027s radiotelegraph equipment was leased to the White Star Line by the Marconi International Marine Communication Company, which also supplied two of its employees, Jack Phillips and Harold Bride, as operators. The service maintained a 24-hour schedule, primarily sending and receiving passenger telegrams , but also handling navigation messages including weather reports and ice warnings.\nThe radio room was located on the Boat Deck, in the officers\u0027 quarters. A soundproofed \u0022Silent Room\u0022, next to the operating room, housed loud equipment, including the transmitter and a motor-generator used for producing alternating currents. The operators\u0027 living quarters were adjacent to the working office. The ship was equipped with a \u0027state of the art\u0027 5-kilowatt rotary spark-gap transmitter, with the wireless telegraph call sign MGY, and communication was in Morse code. This transmitter was one of the first Marconi installations to use a rotary spark-gap, which gave Titanic a distinctive musical tone that could be readily distinguished from other signals. The transmitter was one of the most powerful in the world and guaranteed to broadcast over a radius of 350 miles . An elevated T-antenna that spanned the length of the ship was used for transmitting and receiving. The normal operating frequency was 500 kHz ; however, the equipment could also operate on the \u0022short\u0022 wavelength of 1,000 kHz that was employed by smaller vessels with shorter antennas.\n\n\n=== Passenger facilities ===\n\nThe passenger facilities aboard Titanic aimed to meet the highest standards of luxury. According to Titanic\u0027s general arrangement plans, the ship could accommodate 833 First Class Passengers, 614 in Second Class and 1,006 in Third Class, for a total passenger capacity of 2,453. In addition, Titanic\u0027s capacity for crew members exceeded 900, as most documents of the original configuration have stated that the full carrying capacity for passengers and crew was approximately 3,547. The ship\u0027s interior design was a departure from that of other passenger liners, which had typically been decorated in the style of a manor house or an English country house.\nTitanic was laid out in a much lighter style similar to that of contemporary high-class hotels—the Ritz Hotel was a reference point—with First Class cabins finished in the Empire style. A variety of other decorative styles, ranging from the Renaissance to Louis XV, were used to decorate cabins and public rooms in First and Second Class areas of the ship. The aim was to convey an impression that the passengers were in a floating hotel rather than a ship. As one passenger recalled, on entering the ship\u0027s interior a passenger would \u0022at once lose the feeling that we are on board ship, and seem instead to be entering the hall of some great house on shore\u0022. Cabins in First Class also contained buttons that, when pressed, would signal for a steward to come to the cabin.\nAmong the more novel features available to first-class passengers was a 7 ft deep saltwater swimming pool, a gymnasium, a squash court, and a Victorian-style Turkish bath which comprised hot room, warm room, cooling-room, and two shampooing rooms. Complementing the Turkish bath, and within the same area, was a steam room and an electric bath. First-class common rooms were impressive in scope and lavishly decorated. They included a lounge in the style of the Palace of Versailles, an enormous reception room, a men\u0027s smoking room, and a reading and writing room. There was an à la carte restaurant in the style of the Ritz Hotel which was run as a concession by the famous Italian restaurateur Gaspare Gatti. A Café Parisien decorated in the style of a French pavement café, complete with ivy-covered trellises and wicker furniture, was run as an annex to the restaurant. For an extra cost, first-class passengers could enjoy the finest French haute cuisine in the most luxurious of surroundings. There was also a Verandah Café where tea and light refreshments were served that offered grand views of the ocean. At 114 ft long by 92 ft wide, the dining saloon on D Deck, designed by Charles Fitzroy Doll, was the largest room afloat and could seat almost 600 passengers at a time.\n\nThird Class accommodations aboard Titanic were not as luxurious as First or Second Class but were better than on many other ships of the time, where Third Class accommodations consisted of little more than open dormitories in which hundreds of people were confined, often without adequate food or toilet facilities. The White Star Line had long since broken that mould. As seen aboard Titanic, all White Star Line passenger ships divided their Third Class accommodations into two sections, always at opposite ends of the vessel from one another. The established arrangement was that single men were quartered in the forward areas, while single women, married couples and families were quartered aft. In addition, while other ships provided only open berth sleeping arrangements, White Star Line vessels provided their Third-Class passengers with private, small but comfortable cabins capable of accommodating two, four, six, eight and ten passengers. Third Class accommodations also included their own dining rooms, as well as public gathering areas including adequate open deck space. This was supplemented by the addition of a smoking room for men and a general room on C Deck which women could use for reading and writing.\nLeisure facilities were provided for all three classes to pass the time. As well as making use of the indoor amenities such as the library, smoking rooms, and gymnasium, it was also customary for passengers to socialise on the open deck, promenading or relaxing in hired deck chairs or wooden benches. A passenger list was published before the sailing to inform the public which members of the great and good were on board, and it was not uncommon for ambitious mothers to use the list to identify rich bachelors to whom they could introduce their marriageable daughters during the voyage.\nOne of Titanic\u0027s most distinctive features was the First Class staircase, known as the Grand Staircase or Grand Stairway. Built of solid English oak with a sweeping curve, the staircase descended through seven decks of the ship, between the boat deck to E deck, before terminating in a simplified single flight on F Deck. It was capped with a dome of wrought iron and glass that admitted natural light to the stairwell. Each landing off the staircase gave access to ornate entrance halls panelled in the William \u0026 Mary style and lit by ormolu and crystal light fixtures.\nAt the uppermost landing was a large carved wooden panel containing a clock, with figures of \u0022Honour and Glory Crowning Time\u0022 flanking the clock face. The Grand Staircase was destroyed during the sinking and is now just a void in the ship which modern explorers have used to access the lower decks. During the filming of James Cameron\u0027s Titanic in 1997, his replica of the Grand Staircase was ripped from its foundations by the force of the inrushing water on the set. It has been suggested that during the real event, the entire Grand Staircase was ejected upwards through the dome.\n\n\n=== Mail and cargo ===\n\nAlthough Titanic was primarily a passenger liner, the ship also carried a substantial amount of cargo. Under the designation of Royal Mail Ship , Titanic carried mail under contract with the Royal Mail . For the storage of letters, parcels and specie , 26,800 cubic feet of space was allocated. The Sea Post Office on G Deck was manned by five postal clerks , who worked 13 hours a day, seven days a week, sorting up to 60,000 items daily.\nThe ship\u0027s passengers brought with them a huge amount of baggage; another 19,455 cubic feet was taken up by first- and second-class baggage. In addition, there was a considerable quantity of regular cargo, ranging from furniture to foodstuffs, and a 1912 Renault Type CE Coupe de Ville motor car. Despite later myths, the cargo on Titanic\u0027s maiden voyage was fairly mundane; there was no gold, exotic minerals or diamonds, and one of the more famous items lost in the shipwreck, a jewelled copy of the Rubaiyat of Omar Khayyam, was valued at only £405 . According to the claims for compensation filed with Commissioner Gilchrist, following the conclusion of the Senate Inquiry, the single most highly valued item of luggage or cargo was a large neoclassical oil painting entitled La Circassienne au Bain by French artist Merry-Joseph Blondel. The painting\u0027s owner, first-class passenger Mauritz Håkan Björnström-Steffansson, filed a claim for $100,000 in compensation for the loss of the artwork. Other intriguing items in the manifest included 12 cases of ostrich feathers, 76 cases of \u0022Dragon\u0027s Blood,\u0022 and 16 cases of calabashes.\nTitanic was equipped with eight electric cranes, four electric winches and three steam winches to lift cargo and baggage in and out of the holds. It is estimated that the ship used some 415 tonnes of coal whilst in Southampton, simply generating steam to operate the cargo winches and provide heat and light.\n\n\n=== Lifeboats ===\n\nLike Olympic, Titanic carried a total of 20 lifeboats: 14 standard wooden Harland and Wolff lifeboats with a capacity of 65 people each and four Engelhardt \u0022collapsible\u0022 lifeboats with a capacity of 47 people each. In addition, Titanic had two emergency cutters with a capacity of 40 people each. Olympic carried at least two collapsible boats on either side of the number one funnel. All of the lifeboats were stowed securely on the boat deck and, except for collapsible lifeboats A and B, connected to davits by ropes. Those on the starboard side were odd-numbered 1–15 from bow to stern, while those on the port side were even-numbered 2–16 from bow to stern.\nBoth cutters were kept swung out, hanging from the davits, ready for immediate use, while collapsible lifeboats C and D were stowed on the boat deck immediately inboard of boats 1 and 2 respectively. A and B were stored on the roof of the officers\u0027 quarters, on either side of number 1 funnel. There were no davits to lower them and their weight would make them difficult to launch by hand. Each boat carried food, water, blankets, and a spare life belt. Lifeline ropes on the boats\u0027 sides enabled them to save additional people from the water if necessary.\nTitanic had 16 sets of davits, each able to handle three lifeboats, as Carlisle had hoped. This gave Titanic the ability to carry up to 48 wooden lifeboats. However, the White Star Line decided that only 16 wooden lifeboats and four collapsibles would be carried, which could accommodate 1,178 people, only one-third of Titanic\u0027s total capacity. At the time, the Board of Trade\u0027s regulations required British vessels over 10,000 tonnes to carry only 16 lifeboats with a capacity of 990 occupants.\nTherefore, the White Star Line actually provided more lifeboat accommodation than was legally required. At the time, lifeboats were intended to ferry survivors from a sinking ship to a rescuing ship—not keep afloat the whole population or power them to shore. Had SS Californian responded to Titanic\u0027s distress calls, the lifeboats might have been able to ferry all passengers to safety as planned.\r\n\r\n== Building and preparing the ship ==\n\n\n=== Construction, launch and fitting-out ===\n\nThe sheer size of the Olympic class vessels posed a major engineering challenge for Harland and Wolff; no shipbuilder had ever before attempted to construct vessels this size. The ships were constructed on Queen\u0027s Island, now known as the Titanic Quarter, in Belfast Harbour. Harland and Wolff had to demolish three existing slipways and build two new ones, the largest ever constructed up to that time, to accommodate both ships. Their construction was facilitated by an enormous gantry built by Sir William Arrol \u0026 Co., a Scottish firm responsible for the building of the Forth Bridge and London\u0027s Tower Bridge. The Arrol Gantry stood 228 feet high, was 270 feet wide and 840 feet long and weighed more than 6,000 tonnes. It accommodated a number of mobile cranes. A separate floating crane, capable of lifting 200 tonnes, was brought in from Germany.\nThe construction of Olympic and Titanic took place virtually in parallel, with Olympic\u0027s keel laid down first on 16 December 1908 and Titanic\u0027s on 31 March 1909. Both ships took about 26 months to build and followed much the same construction process. They were designed essentially as an enormous floating box girder, with the keel acting as a backbone and the frames of the hull forming the ribs. At the base of the ships, a double bottom 5 feet 3 inches deep supported 300 frames, each between 24 and 36 inches apart and measuring up to about 66 feet long. They terminated at the bridge deck and were covered with steel plates which formed the outer skin of the ships.\nThe 2,000 hull plates were single pieces of rolled steel plate, mostly up to 6 feet wide and 30 feet long and weighing between 2.5 and 3 tonnes. Their thickness varied from 1 to 1.5 inches . The plates were laid in a clinkered fashion from the keel to the bilge. Above that point they were laid in the \u0022in and out\u0022 fashion, where strake plating was applied in bands with the gaps covered by the \u0022out strakes\u0022, overlapping on the edges. Commercial oxy-fuel and electric arc welding methods, ubiquitous in fabrication today, were still in their infancy. Like most other iron and steel structures of the era, the hull was held together with over three million iron and steel rivets, which by themselves weighed over 1,200 tonnes. They were fitted using hydraulic machines or were hammered in by hand. In the 1990s, material scientists concluded that the steel plate used for the ship was subject to being especially brittle when cold, and that this brittleness exacerbated the impact damage and hastened the sinking. It is believed that, by the standards of the time, the steel plate\u0027s quality was good, not faulty, but that it was inferior to what would be used for shipbuilding purposes in later decades, owing to advances in the metallurgy of steelmaking. As for the rivets, considerable emphasis has also been placed on their quality and strength.\nTwo side anchors and a centre anchor were among the last items to be fitted on Titanic before it launched. The anchors were a challenge to make; the centre anchor was the largest ever forged by hand. The head weighed nearly 16 tonnes and the shank another 8. Twenty Clydesdale draught horses were needed to haul the centre anchor by wagon from the Noah Hingley \u0026 Sons Ltd forge shop in Netherton, near Dudley, United Kingdom to the Dudley railway station two miles away. It was then shipped by rail to Fleetwood in Lancashire before boarding a ship to Belfast.\nConstructing the ships was difficult and dangerous. Safety precautions were rudimentary at best for the 15,000 men who worked at Harland and Wolff at the time. Much of the work was carried out without safety equipment like hard hats or hand guards on machinery. 246 injuries were recorded during Titanic\u0027s construction, including 28 severe injuries, such as arms severed by machines or legs crushed under falling pieces of steel. Six people died on the ship during construction and fitting out, and another two died in the shipyard workshops and sheds. Just before the launch, a worker was killed when a piece of wood fell on him.\nTitanic was launched at 12:15 pm on 31 May 1911 in the presence of Lord Pirrie, J. Pierpont Morgan, J. Bruce Ismay and 100,000 onlookers. Twenty-two tonnes of soap and tallow were spread on the slipway to lubricate the ship\u0027s passage into the River Lagan. In keeping with the White Star Line\u0027s traditional policy, the ship was not formally named or christened with champagne. The ship was towed to a fitting-out berth where, over the course of the next year, the engines, funnels and superstructure were installed and interior was fitted out.\nAlthough Titanic was virtually identical to the class\u0027s lead ship Olympic, a few changes were made to distinguish both ships. The most noticeable exterior difference was that Titanic had a steel screen with sliding windows installed along the forward half of the A Deck promenade. This was installed as a last-minute change at the personal request of Bruce Ismay and was intended to provide additional shelter to First Class passengers. Extensive changes were made to B Deck on Titanic as the promenade space in this deck, which had proven unpopular on Olympic, was converted into additional First-Class cabins, including two opulent parlour suites with their own private promenade spaces. The À la Carte restaurant was also enlarged and the Café Parisien, an entirely new feature which did not exist on Olympic, was added. These changes made Titanic slightly heavier than Olympic and allowed claim to be the largest ship afloat. The work took longer than expected due to design changes requested by Ismay and a temporary pause in work occasioned by the need to repair Olympic, which had been in a collision in September 1911. Had Titanic been finished earlier, the ship might well have missed colliding with an iceberg.\nOn 3 February 1912, Titanic was pulled into Thompson Graving Dock. It was the largest dry dock of the world and had been built with an eye to building ships of the size of the Olympic class. Here, Titanic would receive its propellers and final red hull coating. However, on 6 March 1912, Titanic was moved out again to allow Olympic in, which had lost a propeller blade.\n\n\n=== Sea trials ===\n\nTitanic\u0027s sea trials began at 6 am on Tuesday, 2 April 1912, just two days after the fitting out was finished and eight days before departure from Southampton on the maiden voyage. The trials were delayed for a day due to bad weather, but by Monday morning it was clear and fair. Aboard were 78 stokers, greasers and firemen, and 41 members of crew. No domestic staff appear to have been aboard. Representatives of various companies travelled on Titanic\u0027s sea trials: Thomas Andrews and Edward Wilding of Harland and Wolff, and Harold A. Sanderson of IMM. Bruce Ismay and Lord Pirrie were too ill to attend. Jack Phillips and Harold Bride served as radio operators and performed fine-tuning of the Marconi equipment. Francis Carruthers, a surveyor from the Board of Trade, was also present to see that everything worked and that the ship was fit to carry passengers.\nThe sea trials consisted of a number of tests of handling characteristics, carried out first in Belfast Lough and then in the open waters of the Irish Sea. Over the course of about 12 hours, Titanic was driven at different speeds, turning ability was tested, and a \u0022crash stop\u0022 was performed in which the engines were reversed full ahead to full astern, bringing the ship to a stop in 850 yd or 3 minutes and 15 seconds. Titanic covered a distance of about 80 nautical miles , averaging 18 knots and reaching a maximum speed of just under 21 knots .\nOn returning to Belfast at about 7 pm, the surveyor signed an \u0022Agreement and Account of Voyages and Crew\u0022, valid for 12 months, which declared the ship seaworthy. An hour later, Titanic departed Belfast to head to Southampton, a voyage of about 570 nautical miles . After a journey lasting about 28 hours, Titanic arrived about midnight on 4 April and was towed to the port\u0027s Berth 44, ready for the arrival of passengers and the remainder of the crew.\r\n\r\n== Maiden voyage ==\n\nBoth Olympic and Titanic registered Liverpool as their home port. The offices of the White Star Line, as well as Cunard, were in Liverpool, and up until the introduction of the Olympic, most British ocean liners for both Cunard and White Star, such as Lusitania and Mauretania, sailed from Liverpool followed by a port of call in Queenstown, Ireland. Since the company\u0027s founding in 1845, a vast majority of their operations had taken place from Liverpool. However, in 1907 White Star Line established another service from Southampton on England\u0027s south coast, which became known as White Star\u0027s \u0022Express Service\u0022. Southampton had many advantages over Liverpool, the first being its proximity to London.\n\nIn addition, Southampton, being on the south coast, allowed ships to easily cross the English Channel and make a port of call on the northern coast of France, usually at Cherbourg. This allowed British ships to pick up clientele from continental Europe before recrossing the channel and picking up passengers at Queenstown. The Southampton-Cherbourg-New York run would become so popular that most British ocean liners began using the port after World War I. Out of respect for Liverpool, ships continued to be registered there until the early 1960s. Queen Elizabeth 2 was one of the first ships registered in Southampton when introduced into service by Cunard in 1969.\nTitanic\u0027s maiden voyage was intended to be the first of many trans-Atlantic crossings between Southampton and New York via Cherbourg and Queenstown on westbound runs, returning via Plymouth in England while eastbound. The entire schedule of voyages through to December 1912 still exists. When the route was established, four ships were assigned to the service. In addition to Teutonic and Majestic, RMS Oceanic and the brand new RMS Adriatic sailed the route. When the Olympic entered service in June 1911, the ship replaced Teutonic, which after completing a last run on the service in late April was transferred to the Dominion Line\u0027s Canadian service. The following August, Adriatic was transferred to White Star Line\u0027s main Liverpool-New York service, and in November, Majestic was withdrawn from service pending the arrival of Titanic in the coming months and was mothballed as a reserve ship.\nWhite Star Line\u0027s initial plans for Olympic and Titanic on the Southampton run followed the same routine as their predecessors had done before them. Each would sail once every three weeks from Southampton and New York, usually leaving at noon each Wednesday from Southampton and each Saturday from New York, thus enabling the White Star Line to offer weekly sailings in each direction. Special trains were scheduled from London and Paris to convey passengers to Southampton and Cherbourg respectively. The deep-water dock at Southampton, then known as the \u0022White Star Dock\u0022, had been specially constructed to accommodate the new Olympic-class liners, and had opened in 1911.\n\n\n=== Crew ===\n\nTitanic had about 885 crew members on board for the maiden voyage. Like other vessels of the time, Titanic did not have a permanent crew, and the vast majority of crew members were casual workers who only came aboard the ship a few hours before sailing from Southampton. The process of signing up recruits began on 23 March and some were sent to Belfast, where they served as a skeleton crew on Titanic\u0027s sea trials and passage to England in early April.\nCaptain Edward John Smith, the most senior of the White Star Line\u0027s captains, was transferred from Olympic to take command of Titanic. Henry Tingle Wilde also came across from Olympic to take the post of chief mate. Titanic\u0027s previously designated chief mate and first officer, William McMaster Murdoch and Charles Lightoller, were downgraded to the ranks of first and second officer respectively, and the original second officer, David Blair, was dropped altogether. The third officer, Herbert Pitman, was the only deck officer not a member of the Royal Naval Reserve. Pitman was the second-to-last surviving officer.\nTitanic\u0027s crew were divided into three principal departments: Deck, with 66 crew; Engine, with 325; and Victualling, with 494. The vast majority of the crew were thus not seamen but were either engineers, firemen, or stokers, responsible for looking after the engines, or stewards and galley staff, responsible for the passengers. Of these, over 97% were male; just 23 of the crew were female, mainly stewardesses. The rest represented a variety of professions—bakers, chefs, butchers, fishmongers, dishwashers, stewards, gymnasium instructors, laundrymen, waiters, bed-makers, cleaners, and even a printer, who produced a daily newspaper for passengers called the Atlantic Daily Bulletin with the latest news received by the ship\u0027s wireless operators.\nMost of the crew signed on in Southampton on 6 April; in all, 699 of the crew came from there, and 40% were natives of the town. A few specialist staff were self-employed or subcontractors, including: five postal clerks who worked for the Royal Mail and the United States Post Office Department, the staff of the First Class À La Carte Restaurant and the Café Parisien, the radio operators and the eight musicians, who were employed by an agency and travelled as second-class passengers. Crew pay varied greatly, from Captain Smith\u0027s £105 a month to the £3 10s that stewardesses earned. The lower-paid victualling staff could, however, supplement their wages substantially through tips from passengers.\n\n\n=== Passengers ===\n\nTitanic\u0027s passengers numbered approximately 1,317 people: 324 in First Class, 284 in Second Class, and 709 in Third Class. Of these, 869 were male and 447 female. There were 107 children aboard, the largest number of whom were in Third Class. The ship was considerably under-capacity for the maiden voyage and could have accommodated 2,453 passengers—833 First Class, 614 Second Class, and 1,006 Third Class.\nUsually, a high-prestige vessel like Titanic could expect to be fully booked on a maiden voyage. However, a national coal strike in the UK had caused considerable disruption to shipping schedules in the spring of 1912, causing many crossings to be cancelled. Many would-be passengers chose to postpone their travel plans until the strike was over. The strike had finished a few days before Titanic sailed; however, that was too late to have much of an effect. Titanic was able to sail on the scheduled date only because coal was transferred from other vessels which were tied up at Southampton, such as SS City of New York and RMS Oceanic, as well as coal that Olympic had brought back from a previous voyage to New York, which had been stored at the White Star Dock.\nSome of the most prominent people of the day booked a passage aboard Titanic, travelling in First Class. Among them were the American millionaire John Jacob Astor IV† and his wife, Madeleine Force Astor ; industrialist Benjamin Guggenheim†; painter and sculptor Francis Davis Millet†; Macy\u0027s owner Isidor Straus† and his wife, Ida†; millionaire Margaret \u0022Molly\u0022 Brown; Sir Cosmo Duff Gordon and his wife, Lucy ; Lieut. Col. Arthur Peuchen; writer and historian Archibald Gracie; cricketer and businessman John B. Thayer† with his wife, Marian, and son Jack; George Dunton Widener† with his wife, Eleanor, and son Harry†; Noël Leslie, Countess of Rothes; Mr.† and Mrs. Charles M. Hays; Mr. and Mrs. Henry S. Harper; Mr.† and Mrs. Walter D. Douglas; Mr.† and Mrs. George D. Wick; Mr.† and Mrs. Henry B. Harris; Mr.† and Mrs. Arthur L. Ryerson; Mr.† and Mrs.† Hudson J. C. Allison; Mr. and Mrs. Dickinson Bishop; noted architect Edward Austin Kent†; brewery heir Harry Molson†; tennis players Karl Behr and Dick Williams; author and socialite Helen Churchill Candee; future lawyer and suffragette Elsie Bowerman and her mother Edith; journalist and social reformer William Thomas Stead†; journalist and fashion buyer Edith Rosenbaum; socialite Edith Corse Evans†; wealthy divorcée Charlotte Drake Cardeza; French sculptor Paul Chevré; author Jacques Futrelle† with his wife May; silent film actress Dorothy Gibson with her mother Pauline; President of the Swiss Bankverein, Col. Alfons Simonius-Blumer; James A. Hughes\u0027s daughter Eloise; banker Robert Williams Daniel; the chairman of the Holland America Line, Johan Reuchlin; Arthur Wellington Ross\u0027s son John H. Ross; Washington Roebling\u0027s nephew Washington A. Roebling II; Andrew Saks\u0027s daughter Leila Saks Meyer with her husband Edgar Joseph Meyer† ; William A. Clark\u0027s nephew Walter M. Clark with his wife, Virginia; a great-great-grandson of soap manufacturer Andrew Pears, Thomas C. Pears, with wife; John S. Pillsbury\u0027s grandson John P. Snyder and wife Nelle; and Dorothy Parker\u0027s uncle Martin Rothschild with his wife, Elizabeth.\nTitanic\u0027s owner J. P. Morgan was scheduled to travel on the maiden voyage but cancelled at the last minute. Also aboard the ship were the White Star Line\u0027s managing director J. Bruce Ismay and Titanic\u0027s designer Thomas Andrews†, who was on board to observe any problems and assess the general performance of the new ship.\nThe exact number of people aboard is not known, as not all of those who had booked tickets made it to the ship; about 50 people cancelled for various reasons, and not all of those who boarded stayed aboard for the entire journey. Fares varied depending on class and season. Third Class fares from London, Southampton, or Queenstown cost £7 5s while the cheapest First Class fares cost £23 . The most expensive First Class suites were to have cost up to £870 in high season .\n\n\n=== Collecting passengers ===\n\nTitanic\u0027s maiden voyage began on Wednesday, 10 April 1912. Following the embarkation of the crew, the passengers began arriving at 9:30 am, when the London and South Western Railway\u0027s boat train from London Waterloo station reached Southampton Terminus railway station on the quayside, alongside Titanic\u0027s berth. The large number of Third Class passengers meant they were the first to board, with First and Second Class passengers following up to an hour before departure. Stewards showed them to their cabins, and First Class passengers were personally greeted by Captain Smith. Third Class passengers were inspected for ailments and physical impairments that might lead to their being refused entry to the United States – a prospect the White Star Line wished to avoid, as it would have to carry anyone who failed the examination back across the Atlantic. In all, 920 passengers boarded Titanic at Southampton – 179 First Class, 247 Second Class, and 494 Third Class. Additional passengers were to be picked up at Cherbourg and Queenstown.\n\nThe maiden voyage began at noon, as scheduled. An accident was narrowly averted only a few minutes later, as Titanic passed the moored liners SS City of New York of the American Line and Oceanic of the White Star Line, the latter of which would have been a running mate on the service from Southampton. The ship\u0027s displacement caused both of the smaller ships to be lifted by a bulge of water and dropped into a trough. New York\u0027s mooring cables could not take the sudden strain and snapped, swinging around stern-first towards Titanic. A nearby tugboat, Vulcan, came to the rescue by taking New York under tow, and Captain Smith ordered Titanic\u0027s engines to be put \u0022full astern\u0022. The two ships avoided a collision by a distance of about 4 feet . The incident delayed Titanic\u0027s departure for about an hour, while the drifting New York was brought under control.\nAfter making it safely through the complex tides and channels of Southampton Water and the Solent, Titanic disembarked the Southampton pilot at the Nab Lightship and headed out into the English Channel. The ship headed for the French port of Cherbourg, a journey of 77 nautical miles . The weather was windy, very fine but cold and overcast. Because Cherbourg lacked docking facilities for a ship the size of Titanic, tenders had to be used to transfer passengers from shore to ship. The White Star Line operated two tenders at Cherbourg: SS Traffic and SS Nomadic . Both had been designed specifically as tenders for the Olympic-class liners and launched shortly after Titanic. Four hours after leaving Southampton, Titanic arrived at Cherbourg and was met by the tenders where 274 additional passengers were taken aboard . Twenty-four passengers had booked a cross-Channel passage only and were left aboard the tenders to be conveyed to shore, a process completed within 90 minutes. At 8 pm, Titanic weighed anchor and left for Queenstown with the weather remaining cold and windy.\n\nAt 11:30 am on Thursday 11 April, Titanic arrived at Cork Harbour on the south coast of Ireland. It was a partly cloudy but relatively warm day, with a brisk wind. Again, the dock facilities were not suitable for a ship of Titanic\u0027s size, and the tenders America and Ireland were used to bring passengers aboard. In all, 123 passengers boarded Titanic at Queenstown – three First Class, seven Second Class and 113 Third Class. In addition to the 24 cross-Channel passengers who had disembarked at Cherbourg, another seven passengers had booked an overnight passage from Southampton to Queenstown. Among the seven was Francis Browne, a Jesuit trainee who was a keen photographer and took many photographs aboard Titanic, including one of the last known photographs of the ship. The very last one was taken by another cross-channel passenger, Kate Odell. A decidedly unofficial departure was that of a crew member, stoker John Coffey, a Queenstown native who sneaked off the ship by hiding under mail bags being transported to shore. Titanic weighed anchor for the last time at 1:30 pm and departed on the westward journey across the Atlantic.\n\n\n=== Atlantic crossing ===\n\nTitanic was planned to arrive at New York Pier 59 on the morning of 17 April. After leaving Queenstown, Titanic followed the Irish coast as far as Fastnet Rock, a distance of some 55 nautical miles . From there the voyage of 1,620 nautical miles along a Great Circle route across the North Atlantic, reached a spot in the ocean known as \u0022the corner\u0022, southeast of Newfoundland, where westbound steamers carried out a change of course. Titanic sailed only a few hours past the corner on a rhumb line leg of 1,023 nautical miles to Nantucket Shoals Light when making fatal contact with an iceberg. The final leg of the journey would have been 193 nautical miles to Ambrose Light and finally to New York Harbor.\nFrom 11 April to local apparent noon the next day, Titanic covered 484 nautical miles ; the following day, 519 nautical miles ; and by noon on the final day of the voyage, 546 nautical miles . From then until the time of sinking, the ship travelled another 258 nautical miles , averaging about 21 knots .\nThe weather cleared as Titanic left Ireland under cloudy skies with a headwind. Temperatures remained fairly mild on Saturday 13 April, but the following day Titanic crossed a cold weather front with strong winds and waves of up to 8 feet . These died down as the day progressed until, by the evening of Sunday 14 April, it became clear, calm, and very cold.\nThe first three days of the voyage from Queenstown had passed without apparent incident. A fire had begun in Titanic\u0027s forward most coal bunker approximately 10 days prior to the ship\u0027s departure, and continued to burn for several days into its voyage, but passengers were unaware of this situation. Fires occurred frequently on board steamships at the time, due to spontaneous combustion of the coal. The fires had to be extinguished with fire hoses by moving the coal on top to another bunker and by removing the burning coal and feeding it into the furnace. The fire was finally extinguished on 14 April. There has been some speculation and discussion as to whether this fire and attempts to extinguish it may have made the ship more vulnerable to sinking.\nTitanic received a series of warnings from other ships of drifting ice in the area of the Grand Banks of Newfoundland, but Captain Smith ignored them. One of the ships to warn Titanic was the Atlantic Line\u0027s Mesaba. Nevertheless, Titanic continued to steam at full speed, which was standard practice at the time. Although not trying to set a speed record, timekeeping was a priority, and under prevailing maritime practices, ships were often operated at close to full speed; ice warnings were seen as advisories, and reliance was placed upon lookouts and the watch on the bridge. It was generally believed that ice posed little danger to large vessels. Close calls with ice were not uncommon, and even head-on collisions had not been disastrous. In 1907, SS Kronprinz Wilhelm, a German liner, had rammed an iceberg but still completed the voyage, and Captain Smith said in 1907 that he \u0022could not imagine any condition which would cause a ship to founder. Modern shipbuilding has gone beyond that.\u0022\n\n\n=== Sinking ===\n\nAt 11:40 pm on 14 April, lookout Frederick Fleet spotted an iceberg immediately ahead of Titanic and alerted the bridge. First Officer William Murdoch ordered the ship to be steered around the iceberg and the engines to be reversed, but it was too late. The starboard side of Titanic struck the iceberg, creating a series of holes below the waterline. The hull was not punctured, but rather dented such that the steel plates of the hull buckled and separated, allowing water to rush in. Five of the sixteen watertight compartments were heavily breached and a sixth was slightly compromised. It soon became clear that Titanic would sink, as the ship could not remain afloat with more than four compartments flooded. Titanic began sinking bow-first, with water spilling from compartment to compartment over the top of each watertight bulkhead as the ship\u0027s angle in the water became steeper.\n\nThose aboard Titanic were ill-prepared for such an emergency. In accordance with accepted practices of the time, as ships were seen as largely unsinkable and lifeboats were intended to transfer passengers to nearby rescue vessels, Titanic only had enough lifeboats to carry about half of those on board; if the ship had carried the full complement of about 3,339 passengers and crew, only about a third could have been accommodated in the lifeboats. The crew had not been trained adequately in carrying out an evacuation. The officers did not know how many they could safely put aboard the lifeboats and launched many of them barely half-full. Third-class passengers were largely left to fend for themselves, causing many of them to become trapped below decks as the ship filled with water. The \u0022women and children first\u0022 protocol was generally followed when loading the lifeboats, and most of the male passengers and crew were left aboard. Women and children survived at rates of about 75 per cent and 50 per cent, while only 20 per cent of men survived.\nBetween 2:10 and 2:15 am, a little over two and a half hours after Titanic struck the iceberg, the rate of sinking suddenly increased as the boat deck dipped underwater, and the sea poured in through open hatches and grates, following which the electrical power supply on board stopped after the circuit breakers tripped and the lights flickered and went out. As the ship\u0027s unsupported stern rose out of the water, exposing the propellers, the ship broke in two main pieces between the second and third funnels, due to the immense forces on the keel. With the bow underwater, and air trapped in the stern, the stern remained afloat and buoyant for a few minutes longer, rising to a nearly vertical angle with hundreds of people still clinging to it, before foundering at 2:20 am. It was believed that Titanic sank in one piece, but the 1985 discovery of the wreck revealed that the ship had broken in two. All remaining passengers and crew were immersed in water at a temperature of −2 °C . Only five who were in the water were helped into the lifeboats, though the lifeboats had room for almost 500 more people.\nDistress signals were sent by wireless, rockets, and lamp, but none of the ships that responded were near enough to reach Titanic before sinking. A radio operator on board SS Birma, for instance, estimated that it would be 6 am before the liner could arrive at the scene. Meanwhile, SS Californian, which was the last to have been in contact before the collision, saw Titanic\u0027s flares but failed to assist. Around 4 am, RMS Carpathia arrived on the scene in response to Titanic\u0027s earlier distress calls.\nWhen the ship sank, the lifeboats that had been lowered were only filled up to an average of 60%. The number of survivors have been variously reported as between 705-708. While estimates, both official and otherwise, vary; it is generally accepted that approximately 1,500 persons died in the disaster.\r\n\r\n== Aftermath of sinking ==\n\n\n=== Immediate aftermath ===\n\nRMS Carpathia took three days to reach New York after leaving the scene of the disaster with a journey slowed by pack ice, fog, thunderstorms and rough seas. Carpathia was, however, able to pass news to the outside world by wireless about what had happened. The initial reports were confusing, leading the American press to report erroneously on 15 April that Titanic was being towed to port by SS Virginian. Late on the night of 15 April White Star reported a message was received saying Titanic had sunk, but all passengers and crew had been transferred to another vessel. Later that day, confirmation came through that Titanic had been lost and that most of the passengers and crew had died. The news attracted crowds of people to the White Star Line\u0027s offices in London, New York, Montreal, Southampton, Liverpool and Belfast. It hit hardest in Southampton, whose people suffered the greatest losses from the sinking; four out of every five crew members came from this town.\nCarpathia docked at 9:30 pm on 18 April at New York\u0027s Pier 54 and was greeted by some 40,000 people waiting at the quayside in heavy rain. Immediate relief in the form of clothing and transportation to shelters was provided by the Women\u0027s Relief Committee, the Travelers Aid Society of New York, and the Council of Jewish Women, among other organisations. Many of Titanic\u0027s surviving passengers did not linger in New York but headed onwards immediately to relatives\u0027 homes. Some of the wealthier survivors chartered private trains to take them home, and the Pennsylvania Railroad laid on a special train free of charge to take survivors to Philadelphia. Titanic\u0027s 214 surviving crew members were taken to the Red Star Line\u0027s steamer SS Lapland, where they were accommodated in passenger cabins.\nCarpathia was hurriedly restocked with food and provisions before resuming the journey to Fiume, Austria-Hungary. The crew were given a bonus of a month\u0027s wages by Cunard as a reward for their actions, and some of Titanic\u0027s passengers joined to give them an additional bonus of nearly £900 , divided among the crew members.\nThe ship\u0027s arrival in New York led to a frenzy of press interest, with newspapers competing to be the first to report the survivors\u0027 stories. Some reporters bribed their way aboard the pilot boat New York, which guided Carpathia into harbour, and one even managed to get onto Carpathia before docking. Crowds gathered outside newspaper offices to see the latest reports being posted in the windows or on billboards. It took another four days for a complete list of casualties to be compiled and released, adding to the agony of relatives waiting for news of those who had been aboard Titanic.\n\n\n=== Insurance, aid for survivors and lawsuits ===\n\nIn January 1912, the hulls and equipment of Titanic and Olympic had been insured through Lloyd\u0027s of London and London Marine Insurance. The total coverage was £1,000,000 per ship. The policy was to be \u0022free from all average\u0022 under £150,000, meaning that the insurers would only pay for damage in excess of that sum. The premium, negotiated by brokers Willis Faber \u0026 Company , was 15 s per £100, or £7,500 for the term of one year. Lloyd\u0027s paid the White Star Line the full sum owed to them within 30 days.\nMany charities were set up to help the survivors and their families, many of whom lost their sole wage earner, or, in the case of many Third-Class survivors, everything they owned. In New York City, for example, a joint committee of the American Red Cross and Charity Organization Society formed to disburse financial aid to survivors and dependents of those who died. On 29 April, opera stars Enrico Caruso and Mary Garden and members of the Metropolitan Opera raised $12,000 in benefits for victims of the disaster by giving special concerts in which versions of \u0022Autumn\u0022 and \u0022Nearer My God To Thee\u0022 were part of the programme. In Britain, relief funds were organised for the families of Titanic\u0027s lost crew members, raising nearly £450,000 . One such fund was still in operation as late as the 1960s.\nIn the United States and Britain, more than 60 survivors combined to sue the White Star Line for damages connected to loss of life and baggage. The claims totalled $16,804,112 , which was far in excess of what White Star argued it was responsible for as a limited liability company under American law. Because the bulk of the litigants were in the United States, White Star petitioned the United States Supreme Court in 1914, which ruled in its favour that it qualified as an LLC and found that the causes of the ship\u0027s sinking were largely unforeseeable, rather than due to negligence. This sharply limited the scope of damages survivors and family members were entitled to, prompting them to reduce their claims to some $2.5 million. White Star only settled for $664,000 , about 27% of the original total sought by survivors. The settlement was agreed to by 44 of the claimants in December 1915, with $500,000 set aside for the American claimants, $50,000 for the British, and $114,000 to go towards interest and legal expenses.\n\n\n=== Investigations into the disaster ===\n\nEven before the survivors arrived in New York, investigations were being planned to discover what had happened, and what could be done to prevent a recurrence. Inquiries were held in both the United States and the United Kingdom, the former more robustly critical of traditions and practices, and scathing of the failures involved, and the latter broadly more technical and expert-orientated.\nThe US Senate\u0027s inquiry into the disaster was initiated on 19 April, a day after Carpathia arrived in New York. The chairman, Senator William Alden Smith, wanted to gather accounts from passengers and crew while the events were still fresh in their minds. Smith also needed to subpoena all surviving British passengers and crew while they were still on American soil, which prevented them from returning to the UK before the American inquiry was completed on 25 May. The British press condemned Smith as an opportunist, insensitively forcing an inquiry as a means of gaining political prestige and seizing \u0022his moment to stand on the world stage\u0022. Smith, however, already had a reputation as a campaigner for safety on US railroads, and wanted to investigate any possible malpractices by railroad tycoon J. P. Morgan, Titanic\u0027s ultimate owner.\nThe British Board of Trade\u0027s inquiry into the disaster was headed by Lord Mersey, and took place between 2 May and 3 July. Being run by the Board of Trade, who had previously approved the ship, it was seen by some as having little interest in its own or White Star\u0027s conduct being found negligent.\nEach inquiry took testimony from both passengers and crew of Titanic, crew members of Leyland Line\u0027s Californian, Captain Arthur Rostron of Carpathia and other experts. The British inquiry also took far greater expert testimony, making it the longest and most detailed court of inquiry in British history up to that time. The two inquiries reached broadly similar conclusions: the regulations on the number of lifeboats that ships had to carry were out of date and inadequate, Captain Smith had failed to take proper heed of ice warnings, the lifeboats had not been properly filled or crewed, and the collision was the direct result of steaming into a dangerous area at too high a speed.\nNeither inquiry\u0027s findings listed negligence by IMM or the White Star Line as a factor. The American inquiry concluded that since those involved had followed standard practice, the disaster was an act of God. The British inquiry concluded that Smith had followed long-standing practice that had not previously been shown to be unsafe, noting that British ships alone had carried 3.5 million passengers over the previous decade with the loss of just 10 lives, and concluded that Smith had done \u0022only that which other skilled men would have done in the same position\u0022. Lord Mersey did, however, find fault with the \u0022extremely high speed which was maintained\u0022 following numerous ice warnings, noting that \u0022what was a mistake in the case of the Titanic would without doubt be negligence in any similar case in the future\u0022.\nThe recommendations included strong suggestions for major changes in maritime regulations to implement new safety measures, such as ensuring that more lifeboats were provided, that lifeboat drills were properly carried out and that wireless equipment on passenger ships was manned around the clock. An International Ice Patrol was set up to monitor the presence of icebergs in the North Atlantic, and maritime safety regulations were harmonised internationally through the International Convention for the Safety of Life at Sea; both measures are still in force today.\nOn 18 June 1912, Guglielmo Marconi gave evidence to the Court of Inquiry regarding the telegraphy. Its final report recommended that all liners carry the system and that sufficient operators maintain a constant service.\nThe way the Titanic sank brought to light serious design issues with the Olympic-class. As a result, the Olympic went through a major refit and design changes for the construction of the Britannic.\nIn August 1912, the liner Corsican struck an iceberg in the Atlantic, severely damaging the bow. However, because the weather was hazy at the time, speed had been reduced to \u0027dead slow\u0027, which limited further damage. While the lifeboats had been deployed, they were not boarded.\n\n\n==== Role of SS Californian ====\n\nOne of the most controversial issues examined by the inquiries was the role played by SS Californian, which had been only a few miles from Titanic but had not picked up distress calls or responded to signal rockets. Californian had stopped for the night because of icy conditions and its wireless operator, Cyril Evans, informed Titanic by radio: \u0022Hey old man, we\u0027re stopped for the night and surrounded by ice.\u0022 He was told to stop transmitting by Titanic\u0027s senior wireless operator, Jack Phillips, who was busy clearing a backlog of messages with Cape Race, whose signals were faint.\nTestimony before the British inquiry revealed that at 10:10 pm, Californian observed the lights of a ship to the south; it was later agreed between Captain Stanley Lord and Third Officer C.V. Groves that this was a passenger liner. At 11:50 pm, the officer watched that ship\u0027s lights flash out, as if shutting down or turning sharply, and noted that the port light was visible. Morse light signals to the ship, upon Lord\u0027s order, were made between 11:30 pm and 1:00 am, but were not acknowledged. If Titanic was as far from the Californian as Lord claimed Morse signals would not have been visible. A reasonable and prudent course of action would have been to awaken the wireless operator and to instruct him to attempt to contact Titanic by that method. Had Lord done so, it is possible he could have reached Titanic in time to save additional lives.\nCaptain Lord had gone to the chart room at 11:00 pm. Second Officer Herbert Stone, now on duty, notified Lord at 1:10 am that the ship had fired five rockets. Lord wanted to know if they were company signals, that is, coloured flares used for identification. Stone said that he did not know and that the rockets were all white. Captain Lord instructed the crew to continue to signal the other vessel with the Morse lamp, and went back to sleep. Three more rockets were observed at 1:50 am and Stone noted that the ship looked strange in the water, as if the ship were listing. At 2:15 am, Lord was notified that the ship could no longer be seen. Lord asked again if the lights had had any colours in them, and he was informed that they were all white.\nCalifornian eventually responded. At around 5:30 am, Chief Officer George Stewart awakened wireless operator Cyril Furmstone Evans, informed him that rockets had been seen during the night, and asked that he try to communicate with any ship. He got news of Titanic\u0027s loss, Captain Lord was notified, and the ship set out to render assistance, arriving well after Carpathia had already picked up all the survivors.\nThe inquiries found that the ship seen by Californian was in fact Titanic and that it would have been possible for Californian to aid rescue; therefore, Captain Lord had acted improperly in failing to do so.\n\n\n=== Survivors and victims ===\n\nThe number of casualties of the sinking is unclear, because of a number of factors. These include confusion over the passenger list, which included some names of people who cancelled their trip at the last minute, and the fact that several passengers travelled under aliases for various reasons and were therefore double-counted on the casualty lists. The death toll has been put at between 1,490 and 1,635 people. The tables below use figures from the British Board of Trade report on the disaster. While the use of the Marconi wireless system did not achieve the result of bringing a rescue ship to Titanic before it sank, the use of wireless did bring Carpathia in time to rescue some of the survivors who otherwise would have perished due to exposure.\nThe water temperature was well below normal in the area where Titanic sank. It also contributed to the rapid death of many passengers during the sinking. Water temperature readings taken around the time of the accident were reported to be −2 °C . Typical water temperatures were normally around 7 °C during mid-April. The coldness of the water was a critical factor, often causing death within minutes for many of those in the water.\nFewer than a third of those aboard Titanic survived the disaster. Some survivors died shortly afterwards; injuries and the effects of exposure caused the deaths of several of those brought aboard Carpathia. The figures show stark differences in the survival rates of the different classes aboard Titanic. Although only 3% of first-class women were lost, 54% of those in third-class died. Similarly, five of six first-class and all second-class children survived, but 52 of the 79 in third-class perished. The differences by gender were even bigger: nearly all female crew members, first- and second-class passengers were saved. Men from the First Class died at a higher rate than women from the Third Class. In total, 50% of the children survived, 20% of the men and 75% of the women.\nThomas Andrews, the chief naval architect of the shipyard, died in the disaster.\nThe last living survivor, Millvina Dean from England, who, at only nine weeks old, was the youngest passenger on board, died aged 97 on 31 May 2009. Two special survivors were the stewardess Violet Jessop and the stoker Arthur John Priest, who survived the sinkings of both Titanic and HMHS Britannic and were aboard RMS Olympic when the ship was rammed in 1911. Aforementioned tennis player Richard N. Williams survived as a first class male passenger by swimming to a life boat. He almost had his legs amputated from frostbite but managed to keep them and continue his sports career. His father, who was beside him in the water, was on the other hand killed by a funnel.\n\n\n=== Retrieval and burial of the dead ===\n\nOnce the massive loss of life became known, White Star Line chartered the cable ship CS Mackay-Bennett from Halifax, Nova Scotia, Canada, to retrieve bodies. Three other Canadian ships followed in the search: the cable ship Minia, lighthouse supply ship Montmagny and sealing vessel Algerine. Each ship left with embalming supplies, undertakers, and clergy. Of the 333 victims who were eventually recovered, 328 were retrieved by the Canadian ships and five more by passing North Atlantic steamships.\nThe first ship to reach the site of the sinking, the CS Mackay-Bennett, found so many bodies that the embalming supplies aboard were quickly exhausted. Health regulations required that only embalmed bodies could be returned to port. Captain Larnder of the Mackay-Bennett and undertakers aboard decided to preserve only the bodies of first-class passengers, justifying their decision by the need to visually identify wealthy men to resolve any disputes over large estates. As a result, many third-class passengers and crew were buried at sea. Larnder identified many of those buried at sea as crew members by their clothing, and stated that as a mariner, he himself would be content to be buried at sea.\nBodies of passengers of the Titanic were numbered as they were brought aboard. Physical characteristics, clothing, identifying marks, and personal effects were all documented. Personal effects were stored separately, labelled with the same body number, and valuables were locked up by the purser. Without enough material or space to handle bodies and their belongings, the crew had to triage.\nBodies recovered were preserved for transport to Halifax, the closest city to the sinking with direct rail and steamship connections. The Halifax Registrar of Vital Statistics, John Henry Barnstead, developed a detailed system to identify bodies and safeguard personal possessions. Relatives from across North America came to identify and claim bodies. A large temporary morgue was set up in the curling rink of the Mayflower Curling Club and undertakers were called in from all across eastern Canada to assist. Some bodies were shipped to be buried in their home towns across North America and Europe. About two-thirds of the bodies were identified. Unidentified victims were buried with simple numbers based on the order in which their bodies were discovered. The majority of recovered victims, 150 bodies, were buried in three Halifax cemeteries, the largest being Fairview Lawn Cemetery followed by the nearby Mount Olivet and Baron de Hirsch cemeteries.\nIn mid-May 1912, RMS Oceanic recovered three bodies over 200 miles from the site of the sinking who were among the original occupants of Collapsible A. When Fifth Officer Harold Lowe and six crewmen returned to the wreck site sometime after the sinking in a lifeboat to pick up survivors, they rescued a dozen men and one woman from Collapsible A, but left the dead bodies of three of its occupants. After their retrieval from Collapsible A by Oceanic, the bodies were buried at sea.\nThe last Titanic body recovered was steward James McGrady, Body No. 330, found by the chartered Newfoundland sealing vessel Algerine on 22 May and buried at Fairview Lawn Cemetery in Halifax on 12 June.\n333 bodies of Titanic victims were recovered, which amounted to one in five of the over 1,500 victims. Some bodies sank with the ship while currents quickly dispersed bodies and wreckage across hundreds of miles, making them difficult to recover. By June, one of the last search ships reported that life jackets supporting bodies were coming apart and releasing bodies to sink.\r\n\r\n== Wreck ==\n\nTitanic was long thought to have sunk in one piece and, over the years, many schemes were put forward for raising the wreck. None came to fruition. The fundamental problem was the sheer difficulty of finding and reaching a wreck that lies over 12,000 feet below the surface, where the water pressure is over 5,300 pounds per square inch , about 370 standard atmospheres. A number of expeditions were mounted to find Titanic but it was not until 1 September 1985 that a Franco-American expedition led by Jean-Louis Michel and Robert Ballard succeeded.\nThe team discovered that Titanic had in fact split apart, probably near or at the surface, before sinking to the seabed. The separated bow and stern sections lie about a one-third of a mile apart in Titanic Canyon off the coast of Newfoundland. They are located 13.2 miles from the inaccurate coordinates given by Titanic\u0027s radio operators on the night of the ship\u0027s sinking, and approximately 715 miles from Halifax and 1,250 miles from New York.\nBoth sections struck the seabed at considerable speed, causing the bow to crumple and the stern to collapse entirely. The bow is by far the more intact section and still contains some surprisingly intact interiors. In contrast, the stern is completely wrecked; its decks have pancaked down on top of each other and much of the hull plating was torn off and lies scattered across the sea floor. The much greater level of damage to the stern is probably due to structural damage incurred during the sinking. Thus weakened, the remainder of the stern was flattened by the impact with the sea bed.\nThe two sections are surrounded by a debris field measuring approximately 5 by 3 miles . It contains hundreds of thousands of items, such as pieces of the ship, furniture, dinnerware and personal items, which fell from the ship while sinking or ejected when the bow and stern impacted on the sea floor. The debris field was also the last resting place of a number of Titanic\u0027s victims. Most of the bodies and clothes were consumed by sea creatures and bacteria, leaving pairs of shoes and boots—which have proved to be inedible—as the only sign that bodies once lay there.\nSince its initial discovery, the wreck of Titanic has been revisited on numerous occasions by explorers, scientists, filmmakers, tourists and salvagers, who have recovered thousands of items from the debris field for conservation and public display. The ship\u0027s condition has deteriorated significantly over the years, particularly from accidental damage by submersibles but mostly because of an accelerating rate of growth of iron-eating bacteria on the hull. In 2006, it was estimated that within 50 years the hull and structure of Titanic would eventually collapse entirely, leaving only the more durable interior fittings of the ship intermingled with a pile of rust on the sea floor.\n\nMany artefacts from Titanic have been recovered from the seabed by RMS Titanic Inc., which exhibits them in touring exhibitions around the world and in a permanent exhibition at the Luxor Las Vegas hotel and casino in Las Vegas, Nevada. A number of other museums exhibit artefacts either donated by survivors or retrieved from the floating bodies of victims of the disaster.\nOn 16 April 2012, the day after the 100th anniversary of the sinking, photos were released showing possible human remains resting on the ocean floor. The photos, taken by Robert Ballard during an expedition led by NOAA in 2004, show a boot and a coat close to Titanic\u0027s stern which experts called \u0022compelling evidence\u0022 that it is the spot where somebody came to rest, and that human remains could be buried in the sediment beneath them. The wreck of the Titanic falls under the scope of the 2001 UNESCO Convention on the Protection of the Underwater Cultural Heritage. This means that all states party to the convention will prohibit the pillaging, commercial exploitation, sale and dispersion of the wreck and its artefacts. Because of the location of the wreck in international waters and the lack of any exclusive jurisdiction over the wreckage area, the convention provides a state co-operation system, by which states inform each other of any potential activity concerning ancient shipwreck sites, like the Titanic, and co-operate to prevent unscientific or unethical interventions.\nSubmersible dives in 2019 have found further deterioration of the wreck, including loss of the captain\u0027s bathtub. Between 29 July and 4 August 2019, a two-person submersible vehicle that was conducting research and filming a documentary crashed into the wreck. EYOS Expeditions executed the dives. It reported that the strong currents pushed the submersible into the wreck, leaving a red rust stain on the submersible\u0027s side. The report did not mention if the Titanic sustained damage.\nIn May 2023, Magellan Ltd., a deep-water seabed-mapping company, announced that they had created a \u0022digital twin\u0022 of the Titanic, showing the wreckage in a level of detail that had never been captured before. The company created the model from some 715,000 3D images, captured over the course of a six-week expedition in the summer of 2022, using two submersibles, named Romeo and Juliet. They mapped \u0022every millimetre\u0022 of the wreckage as well as the entire three-nautical-mile debris field. Creating the model took about eight months.\nOn 18 June 2023, the submersible Titan, operated by OceanGate Expeditions, imploded in the North Atlantic Ocean off the coast of Newfoundland. The submersible was carrying an expedition of tourists to view the wreckage of the Titanic.\nOn 15 July 2024, RMS Titanic Inc. held their first expedition to the wreck in 14 years, with the objective of examining its status in high-resolution photography for future scientific studies, likewise with identifying and searching for on-site artefacts. The event received coverage from the BBC, who interviewed numerous figures involved, such as co-leader David Gallo, who said \u0022We want to see the wreck with a clarity and precision that\u0027s never before been achieved\u0022. A magnetometer was utilised to produce metal detection – whether visible or not – for the first time in the history of Titanic expeditions.\r\n\r\n== Legacy ==\n\n\n=== Safety ===\n\nAfter the disaster, recommendations were made by both the British and American Boards of Inquiry stating that ships should carry enough lifeboats for all aboard, mandatory lifeboat drills would be implemented, lifeboat inspections would be conducted, etc. Many of these recommendations were incorporated into the International Convention for the Safety of Life at Sea passed in 1914. The convention has been updated by periodic amendments, with a completely new version adopted in 1974. Signatories to the Convention followed up with national legislation to implement the new standards. For example, in Britain, new \u0022Rules for Life Saving Appliances\u0022 were passed by the Board of Trade on 8 May 1914 and then applied at a meeting of British steamship companies in Liverpool in June 1914.\nFurther, the United States government passed the Radio Act of 1912. This Act, along with the International Convention for the Safety of Life at Sea, stated that radio communications on passenger ships would be operated 24 hours a day, along with a secondary power supply, so as not to miss distress calls. Also, the Radio Act of 1912 required ships to maintain contact with vessels in their vicinity as well as coastal onshore radio stations. In addition, it was agreed in the International Convention for the Safety of Life at Sea that the firing of red rockets from a ship must be interpreted as a sign of need for help. Once the Radio Act of 1912 was passed, it was agreed that rockets at sea would be interpreted as distress signals only, thus removing any possible misinterpretation from other ships. In the same year, the Board of Trade chartered the barque Scotia to act as a weather ship in the Grand Banks of Newfoundland, keeping a look-out for icebergs. A Marconi wireless telegraph was installed to enable her to communicate with stations on the coast of Labrador and Newfoundland.\nFinally, the disaster led to the formation and international funding of the International Ice Patrol, an agency of the U.S. Coast Guard that to the present day monitors and reports on the location of North Atlantic Ocean icebergs that could pose a threat to transatlantic sea traffic. Coast Guard aircraft conduct the primary reconnaissance. In addition, information is collected from ships operating in or passing through the ice area. Except for the years of the two World Wars, the International Ice Patrol has worked each season since 1913. During the period, there has not been a single reported loss of life or property due to collision with an iceberg in the patrol area.\n\n\n=== Cultural legacy ===\n\nThe story of Titanic has been remembered in history as a tragedy and cautionary tale, particularly because the ship had been considered unsinkable. Titanic has inspired fiction, been the subject of documentaries, and commemorated in monuments for the dead and museum exhibitions. Shortly after sinking, memorial postcards sold in huge numbers together with memorabilia ranging from tin candy boxes to plates, whiskey jiggers, and even mourning teddy bears. The sinking inspired ballads such as \u0022The Titanic\u0022. Several survivors wrote books about their experiences, but it was not until 1955 that the first historically accurate book – A Night to Remember – was published.\nThe first film about the disaster, Saved from the Titanic, was released only 29 days after the ship sank and had an actual survivor as its star—the silent film actress Dorothy Gibson. This film is considered lost. The British film A Night to Remember is still widely regarded as the most historically accurate movie portrayal of the sinking. The most financially successful by far has been James Cameron\u0027s Titanic , which became the highest-grossing film in history up to that time, as well as the winner of 11 Oscars at the 70th Academy Awards, including Best Picture and Best Director for Cameron.\nThe Titanic disaster was commemorated through a variety of memorials and monuments to the victims, erected in several English-speaking countries and in particular in cities that had suffered notable losses. These included Southampton and Liverpool in England; New York and Washington, D.C. in the United States; and Belfast and Cobh in Ireland. A number of museums around the world have displays on Titanic; the most prominent is in Belfast, the ship\u0027s birthplace .\nRMS Titanic Inc., which is authorised to salvage the wreck site, has a permanent Titanic exhibition at the Luxor Las Vegas hotel and casino in Nevada which features a 22-tonne slab of the ship\u0027s hull. It also runs an exhibition which travels around the world. In Nova Scotia, Halifax\u0027s Maritime Museum of the Atlantic displays items that were recovered from the sea a few days after the disaster. They include pieces of woodwork such as panelling from the ship\u0027s First Class Lounge and an original deckchair, as well as objects removed from the victims. In 2012 the centenary was marked by plays, radio programmes, parades, exhibitions and special trips to the site of the sinking together with commemorative stamps and coins. Royal Mail Titanic) issued ten 1st class UK postage stamps, each with the \u0022crown seal\u0022, to mark the centenary of the disaster.\nIn a frequently commented-on literary coincidence, Morgan Robertson authored a novel called Futility in 1898 about a fictional British passenger liner with the plot bearing a number of similarities to the Titanic disaster. In the novel, the ship is SS Titan, a four-stacked liner, the largest in the world and considered unsinkable; like the Titanic, sinks in April after hitting an iceberg and does not have enough lifeboats.\n\n\n==== In Northern Ireland ====\nIt took many decades before the significance of Titanic was promoted in Northern Ireland, where it was built by Harland and Wolff in Belfast. While the rest of the world embraced the glory and tragedy of Titanic, it remained a taboo subject throughout the 20th century in its birth city. The sinking brought tremendous grief and was a blow to Belfast\u0027s pride. Its shipyard was also a place many Catholics regarded as hostile. In the latter half of the century, during a 30-year sectarian conflict, Titanic was a reminder of the lack of civil rights that in part contributed towards the Troubles. While the fate of Titanic remained a well-known story within local households throughout the 20th century, commercial investment in projects recalling RMS Titanic\u0027s legacy was modest because of these issues.\nAfter the Troubles and Good Friday Agreement, the number of overseas tourists visiting Northern Ireland increased. It was subsequently identified in the Northern Ireland Tourism Board\u0027s Strategic Framework for Action 2004–2007 that the significance of and interest in Titanic globally was not being fully exploited as a tourist attraction. Thus, Titanic Belfast was spearheaded, along with some smaller projects, such as a Titanic memorial.\nIn 2012 on the ship\u0027s centenary, the Titanic Belfast visitor attraction was opened on the site of the shipyard where Titanic was built. It was Northern Ireland\u0027s second most visited tourist attraction with almost 700,000 visitors in 2016.\nDespite over 1,600 ships being built by Harland and Wolff in Belfast Harbour, Queen\u0027s Island became renamed after its most famous ship, Titanic Quarter in 1995. Once a sensitive story, Titanic is now considered one of Northern Ireland\u0027s most revered and uniting symbols.\nIn late August 2018, several groups were vying for the right to purchase the 5,500 Titanic relics that were an asset of the bankrupt Premier Exhibitions. Eventually, Titanic Belfast, Titanic Foundation Limited and the National Museums Northern Ireland joined with the National Maritime Museum as a consortium that was raising money to purchase the 5,500 artefacts. The group intended to keep all of the items together as a single exhibit. Oceanographer Robert Ballard said he favoured this bid since it would ensure that the memorabilia would be permanently displayed in Belfast and in Greenwich. The museums were critical of the bid process set by the Bankruptcy court in Jacksonville, Florida. The minimum bid for the 11 October 2018 auction was set at US$21.5 million and the consortium did not have enough funding to meet that amount. On 17 October 2018, The New York Times reported that a consortium of three hedge funds—Apollo Global Management, Alta Fundamental Advisers, and PacBridge Capital Partners—had paid US$19.5 million for the collection.  At the time of the purchase, the consortium agreed to continued oversight by the court concerning new exploration or salvage expedition must receive approval from NOAA and the court. Further, the purchase price gives Premier\u0027s unsecured creditors an 80% recovery.\r\n\r\n== Diagrams and timeline ==\r\n\r\n== Replicas ==\n\nThere have been several proposals and studies for a project to build a replica ship based on the Titanic.\nA Chinese shipbuilding company known as Wuchang Shipbuilding Industry Group Co., Ltd commenced construction in November 2016 to build a replica ship of the Titanic for use in a resort. The vessel was to house many features of the original, such as a ballroom, dining hall, theatre, first-class cabins, economy cabins and swimming pool. Tourists were to be able to reside inside the Titanic during their time at the resort. It was to be permanently docked at the resort and feature an audiovisual simulation of the sinking, which has caused some criticism.  As of 2022, however, it was reportedly only 25% complete, and its website and Twitter account are offline.",
  "location": {
    "lat": 41.7325,
    "long": -49.94694444
  },
  "imageNames": [
    "19120415_New_Liner_Titanic_Hits_an_Iceberg_-_The_New_York_Times.png",
    "19120415_Titanic_and_Olympic_advertisement_-_The_New_York_Times.png",
    "19120416_The_Vessel_Unsinkable_-_Titanic_-_Manchester_Guardian_quoting_Intl_Mercantile_Marine_Co.jpg",
    "19120420_J._Bruce_Ismay_Testifying_at_the_Senate_Inquiry_-_The_New_York_Times.png",
    "1912_voyages_planned_for_Olympic_and_Titanic.png"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "date": 1912,
  "categoryId": "pwynt-cyfeirio",
  "id": "titanic",
  "label": "Titanic"
}