{
  "wikiSummary": "The Tryweryn flooding, or Tryweryn drowning , was the 1965 flooding of the Tryweryn valley in Gwynedd , Wales, to create the Llyn Celyn reservoir. The flooding of the valley, located to the north west of Bala, submerged the rural community of Capel Celyn. The project was developed by Liverpool Corporation, to supply Liverpool and Wirral with water for industry.\nThe flooding was and remains controversial in Wales. Capel Celyn was one of the last Welsh-only speaking communities in the area. The flooding was opposed by 125 local authorities. Protests were held on site and at Liverpool. The parliamentary bill establishing permission for the reservoir received no support from Wales\u0027 36 members of Parliament, with members mainly opposing and a few abstaining, however the bill passed overall.\nFailed efforts to prevent the flooding despite strong opposition in Wales has attributed the flooding with leading to a rise in support for the Welsh nationalist party Plaid Cymru, and increasing powers and responsibility to Wales, culminating in Welsh devolution, although water is not fully devolved to Wales.\nThe event has inspired various media, particularly the Cofiwch Dryweryn mural. Liverpool City Council formally apologised in 2005.",
  "wikiArticle": "The Tryweryn flooding, or Tryweryn drowning , was the 1965 flooding of the Tryweryn valley in Gwynedd , Wales, to create the Llyn Celyn reservoir. The flooding of the valley, located to the north west of Bala, submerged the rural community of Capel Celyn. The project was developed by Liverpool Corporation, to supply Liverpool and Wirral with water for industry.\nThe flooding was and remains controversial in Wales. Capel Celyn was one of the last Welsh-only speaking communities in the area. The flooding was opposed by 125 local authorities. Protests were held on site and at Liverpool. The parliamentary bill establishing permission for the reservoir received no support from Wales\u0027 36 members of Parliament, with members mainly opposing and a few abstaining, however the bill passed overall.\nFailed efforts to prevent the flooding despite strong opposition in Wales has attributed the flooding with leading to a rise in support for the Welsh nationalist party Plaid Cymru, and increasing powers and responsibility to Wales, culminating in Welsh devolution, although water is not fully devolved to Wales.\nThe event has inspired various media, particularly the Cofiwch Dryweryn mural. Liverpool City Council formally apologised in 2005.\r\n\r\n== History ==\n\nThe villagers first knew about the proposal a few days before Christmas 1955, from reading about it in the Welsh edition of the Liverpool Daily Post. The villagers created the Capel Celyn Defence Committee, which debated and denounced the scheme all over Wales through newspapers, radio and television. The villagers marched to Liverpool twice in 1956 to make their objections known. However, Liverpool councillors voted overwhelmingly to proceed.\nIn 1957, a private bill sponsored by Liverpool City Council was brought before Parliament to develop a water reservoir in the Tryweryn Valley. The development would include the flooding of Capel Celyn. By obtaining authority via the Liverpool Corporation Act 1957 , an act of Parliament, Liverpool City Council would not require planning consent from the relevant Welsh local authorities and would also avoid a planning inquiry at Welsh level at which arguments against the proposal could be expressed. This, together with the fact that the village was one of the last Welsh-only speaking communities in the area, ensured that the proposals became deeply controversial; 35 out of 36 Welsh Members of Parliament opposed the bill , but in 1962 it was passed. The members of the community waged an eight-year effort, ultimately unsuccessful, to prevent the destruction of their homes.\nThe Tryweryn flooding was opposed locally by the Capel Celyn Defence Committee led by Dafydd Roberts and Elizabeth May Watkin Jones. Altogether, 125 local authorities opposed the plan, and 27 of 36 Welsh MPs voted against the second reading of the bill with none voting for it.\nWhen the valley was flooded in 1965, the village and its buildings—including the post office, the school, and a chapel with cemetery—were all lost. Twelve houses and farms were submerged, and 48 people of the 67 who lived in the valley lost their homes. In all, some 800 acres of land were submerged. A new reservoir, Llyn Celyn, was formed.\nThe water in the reservoir is used to maintain the flow of the River Dee so that water may be abstracted downstream, and additionally to improve the quality of white-water sports on Afon Tryweryn.\nA full list of the submerged properties is as follows:\n\nStones from the chapel and other buildings in the village were used in the construction of Capel Celyn Memorial Chapel, designed by the Welsh sculptor R. L. Gapper with the Liverpool City architect Ronald Bradbury, which was completed in 1967 and overlooks the reservoir at the north-west end. It is a Grade II* listed building.\nFamilies who had relatives buried in the cemetery were given the option of moving them to another cemetery. Eight bodies were disinterred and the remainder untouched. All headstones were supposed to be removed, and the cemetery was to be covered in layers of gravel, then concrete, but this was not done.\nWhen the reservoir dried due to a drought in the 1980s and early 1990s, the village became visible.\n\n\n=== Hafod Fadog ===\nOne of the farmsteads covered was Hafod Fadog, a Quaker meeting place. It is recorded on a bronze plaque in a lay-by near to the dam:Under these waters and near this stone stood Hafod Fadog, a farmstead where in the seventeenth and eighteenth centuries Quakers met for worship. On the hillside above the house was a space encircled by a low stone wall where larger meetings were held, and beyond the house was a small burial ground. From this valley came many of the early Quakers who emigrated to Pennsylvania, driven from their homes by persecution to seek freedom of worship in the New World.\r\n\r\n== Political effects ==\n\nAlmost unanimous Welsh political opposition had failed to stop approval of the scheme, a fact that seemed to underline Plaid Cymru\u0027s argument that the Welsh national community was powerless. At the subsequent general election, the party\u0027s support increased from 3.1% to 5.2%.\nOf perhaps greater significance, however, was the impetus the episode gave to Welsh devolution. The Council for Wales recommended the creation of a Welsh Office and Secretary of State for Wales early in 1957, a time when the governance of Wales on a national level was so demonstrably lacking in many people\u0027s eyes. By 1964 the Wilson government gave effect to these proposals.\nThe flooding of Capel Celyn also sharpened debate within Plaid Cymru about the use of direct action. While the party emphasised its constitutional approach to stopping the development, it also sympathised with the actions of two party members who attempted to sabotage the power supply at the site of the Tryweryn dam in 1962.\nA more militant response was the formation of Mudiad Amddiffyn Cymru , abbreviated as MAC, which blew up a transformer on the dam construction site in February 1963. MAC went on to carry out a number of other bombings over the following six years.\nIn October 1965, the Llyn Celyn reservoir opened with a ceremony by the Liverpool Corporation, and there was a sizeable Plaid Cymru-organised demonstration. A year later, Gwynfor Evans won Plaid Cymru\u0027s first parliamentary seat in Carmarthen. But according to some commentators, Capel Celyn did not play a major part in Gwynfor Evans\u0027s victory: in addition to Carmarthen\u0027s long distance from Tryweryn, they claim that Plaid Cymru\u0027s victory owed as much to an anti-Labour backlash in the constituency\u0027s mining communities as it did to Plaid\u0027s successful depiction of Labour\u0027s policies as a threat to the viability of small Welsh communities. The demonstrations at Tryweryn soon devolved into brawls between demonstrators and police as they attempted to block the vehicles of Liverpool Corporation officials and invited guests, impeding them from reaching the opening ceremony. For the first time, three uniformed members of the Free Wales Army made a public appearance at the demonstration, including the organisation\u0027s leader, Julian Cayo-Evans. According to eyewitness accounts, the FWA were responsible for rallying the crowd to charge down in to the escarpment and into the grandstand set up for the opening ceremony, defying pleas for restraint from Plaid Cymru officials.\nThere are also claims that it was the FWA men who disconnected the microphone that was being used for the ceremony, leading to the ceremony coming to an early end as the Liverpool Corporation officials were drowned out by the demonstrators singing Hen Wlad Fy Nhadau. A Union Flag was burned by the demonstrators on the high stone parapet of the reservoir outlet during the scuffles.\nOn 19 October 2005, Liverpool City Council issued a formal apology for the flooding. Some in the town of Bala welcomed the move, though others said the apology was a \u0022useless political gesture\u0022 and came far too late.\r\n\r\n== Impact on Welsh law ==\nThe flooding is often cited in discussions around devolving powers to the Welsh Government, such as those following the Government of Wales Act 2006 and the Wales Act 2014. The 2015 United Kingdom election took place during the flooding\u0027s 50 year anniversary, and saw the UK Conservative Party campaign on the St David\u0027s Day Agreement which would give further powers to the Welsh government.\nThe agreement\u0027s proposals effectively meant that any Welsh laws on water could be overruled by UK ministers if they judged it would have a serious adverse effect on the water supply in England. As such, the proposals were heavily criticised in Wales; both the Welsh Government and Plaid Cymru stated that a new agreement was needed to address the issues around devolved, reserved and excepted matters, especially on the emotive subject of water.\nIn backing the UK government\u0027s proposals, Secretary of State for Wales Alun Cairns directly referenced the Tryweryn flooding, stating that the UK proposals were \u0022about righting a wrong from 50 years ago\u0022, adding that UK Government proposed settlement \u0022sends a strong message\u0022 on how the UK and Welsh governments relate to each other.\nThe discussions would eventually lead the UK government losing the power to intervene in any laws relating to water enacted by the Welsh Government, with supporters of the new Wales Act 2017 describing it as \u0022preventing another Tryweryn\u0022. Alun Cairns again backed the amended act, stating that the new arrangement showed \u0022how far we have come from the events of 52 years ago, which resulted in the flooding of the Tryweryn Valley\u0022.\r\n\r\n== Cultural references ==\n\n\n=== Theatre ===\nThe flooding of the village was dramatised in a joint production by Theatr Clwyd and Theatr Genedlaethol Cymru in 2007. The original title was Porth y Byddar and the revival in 2008 was titled Drowned Out.\n\n\n=== Music ===\nThe flooding of the village inspired a Manic Street Preachers song \u0022Ready for Drowning\u0022 and Enya\u0027s song \u0022Dan y Dŵr\u0022 from her self-titled album of 1987. It is referenced in the Los Campesinos! song \u0022For Flotsam\u0022 on their 2013 album No Blues. To commemorate the 50th anniversary of the event, English composer Michael Stimpson released an album entitled Dylan \u0026 The Drowning of Capel Celyn, which featured a work for solo pedal harp, inspired by the flooding. Electronic musician Bibio released a song called \u0022Capel Celyn\u0022 on his 2017 album Phantom Brickworks.\n\n\n=== TV and film ===\nIn the 2010 Welsh-Argentine drama film Patagonia by Welsh director Marc Evans, Capel Celyn is the place of origin of one of the film\u0027s protagonists. Scenes near the end of the film include a visit to the reservoir. The history of the villages provide inspiration for the 11th episode \u0022Achub Y Morfilod\u0022 in Season 6 of the American animation series Archer, first broadcast in 2015. Guest-starring Matthew Rhys, a native Welshman, the episode was the result of a story told by Rhys on a night out with the show\u0027s creators . Capel Celyn and the reservoir also play a part in the 2016 Welsh film Yr Ymadawiad . The flooding of the valley seems to provide inspiration for the film\u0027s plot, and the movie is better understood and takes on a deeper level of poignancy when the history of the flooding is known. It is also referenced in The Crown, Season 3 Episode 6 \u0022Tywysog Cymru\u0022. A young Prince Charles stays in Wales to learn the Welsh language at University of Wales, Aberystwyth. His tutor, Edward Millward, and his wife Silvia are members of Plaid Cymru and briefly tell him about the village. Capel Celyn is also featured in the Rank film series ‘Look at Life’ in the episode ‘Running Dry’. The short film, shot in colour, includes shots of the post office, the school, the chapel and the local councillor Dave Roberts.\n\n\n=== Literature ===\nReservoirs by R. S. Thomas appeared in Not That He Brought Flowers, published in 1968. It was written soon after the opening of Llyn Celyn and Llyn Clywedog.\n\n\n=== Visual art ===\nCapel Celyn is a floor piece made up of 5,000 cast wax nails inspired by the discovery of one rusty five inch nail which Welsh artist Tim Davies reclaimed one rainless summer from the dried up bed of the Tryweryn reservoir.\r\n\r\n== Cofiwch Dryweryn ==\n\nCofiwch Dryweryn is a motto referring to the drowning of Capel Celyn in 1965. It urges Welsh speakers to remember the destruction of a Welsh-speaking community and to safeguard the language. One instance of this motto is a graffito on the wall of a ruined stone cottage by the A487 at Llanrhystud, outside Aberystwyth which has come to be regarded as a \u0022national landmark\u0022. Meic Stephens claimed to have been the first to paint the wall in the 1960s, with the slogan Cofiwch Tryweryn . Since then, a number of people have repainted the wall, and the word Tryweryn has been corrected to Dryweryn.\nIn 2010, a fundraising campaign was launched to preserve the wall by Llanrhystud Community Council. £80,000 was needed, with Cadw declaring that it would contribute £30,000 to the fund.\nThe wall has been vandalised over on a number of occasions. In May 2008, the words were altered to \u0022Angofiwch Dryweryn\u0022 . The monument was defaced in April 2010, and a spokesperson for the Welsh Government said they were \u0022disappointed\u0022 by the incident. Incidents of vandalism also occurred throughout the years, e.g. in 2013 and 2014. In 2017, the words Cofiwch Aberfan 1966 were added underneath the original message. This message was referring to the Aberfan disaster of 1966, when the collapse of a colliery spoil tip above the village of Aberfan led to the deaths of 144 people, 116 of them children. The original message was repainted in August 2018 but was again defaced in February 2019, when it was painted over with the name Elvis, a reference to the American rock-and-roll singer Elvis Presley, or perhaps in reference to Elvis Rock, a similarly sized rock on the nearby A44 also painted with the artist\u0027s name. After the memorial was repainted, vandals knocked over parts of the wall. In response to the vandalism a wave of Cofiwch Dryweryn memorials were painted throughout Wales and further afield also.\nThe monument is featured in the music video for the Manic Street Preachers\u0027 single \u0022Distant Colours\u0022.",
  "imageNames": [
    "Cofiwch_Dryweryn_ac_Aberfan_Awst_2017.jpg",
    "Llyn_Celyn_Tryweryn_1492972.jpg",
    "Protest_in_Liverpool_attempting_to_stop_the_flooding_of_the_Tryweryn_Valley_10977794533.jpg",
    "Tryweryn_memorial_chapel_w.JPG"
  ],
  "includeMainMenu": false,
  "amDdim": true,
  "date": 1965,
  "categoryId": "cymdeithasol",
  "id": "tryweryn",
  "label": "Tryweryn flooding"
}