{
  "wikiSummary": "Twm Siôn Cati is a prominent figure in Welsh folklore. While many tales of cunning and trickery have been associated with Twm, he is also said to have been a respected antiquary, genealogist and poet and to have risen to the position of magistrate and mayor of Brecon as well as being a relative of the occultist John Dee.\nDue to legends of Twm stealing from the rich and powerful and helping the poor and needy, he became known in the 19th century as \u0022The Welsh Robin Hood\u0022 and \u0022The Welsh Rob Roy\u0022.",
  "wikiArticle": "Twm Siôn Cati is a prominent figure in Welsh folklore. While many tales of cunning and trickery have been associated with Twm, he is also said to have been a respected antiquary, genealogist and poet and to have risen to the position of magistrate and mayor of Brecon as well as being a relative of the occultist John Dee.\nDue to legends of Twm stealing from the rich and powerful and helping the poor and needy, he became known in the 19th century as \u0022The Welsh Robin Hood\u0022 and \u0022The Welsh Rob Roy\u0022.\r\n\r\n== Historicity ==\nThe character of Twm Siôn Cati is based on a real person named Thomas Jones . Jones was said to be a landowner, an antiquary, genealogist and bard, whose manuscripts are kept at the National Library of Wales. He is also recorded as marrying Joan, the daughter of John Price an advisor to Thomas Cromwell during the dissolution of the monasteries. Price was also an antiquarian and a collector of rare Welsh documents, such as the Black Book of Carmarthen. Jones is said to have been a steward who \u0022often had recourse to the law\u0022. He is also said to have been pardoned of his offences in 1559, being named as \u0022Thomas Johns alias Catty\u0022.\n\nVarious manuscripts ascribed to Thomas Jones begin around 1570 and he is known to have assisted George Owen and Lewys Dwnn and the officers of the Heralds College. Thomas Jones is known to have visited Dee in London in 1590 and at his home in Mortlake six years later, the two also corresponded with each other in 1597 in which Dee referred to him as \u0022my cousin\u0022. Jones was also steward of Caron in 1601 and died in 1609, when his will was proved at Carmarthen.\nIt is considered unlikely however, that the numerous tales attributed to Twm Siôn Cati were the exploits of this one man but rather a number of raiders and highwaymen who operated in the Tregaron area.\r\n\r\n== Biography ==\n\n\n=== Early life ===\nTwm is said to have been born at Porth y Ffynnon on the outskirts of Tregaron.\nAlthough John Dee recorded Twm\u0027s date of birth as 1532 , there is little written record of his birth and childhood, suggesting he may have been illegitimate. While his mother was Cati Jones of Tregaron, his father is sometimes stated to be Siôn ap Dafydd ap Madog ap Hywel Moetheu of Porth-y-ffin, Tregaron.\nAs an illegitimate son, he unofficially took both his father and mother\u0027s names, becoming known as Thomas Jones in English, but as Twm Siôn Cati in common Welsh convention.\nIn the tale told by Llewelyn Prichard, Twm is the illegitimate son of Cati Jones following attentions from John Wynn of Gwydir ; the Welsh forms of the names of his parents became incorporated into his name.\n\n\n=== Robber and exile ===\nIn the tale told by Llewelyn Prichard, he grows up in Tregaron and after a spell working for a farmer, he works for a local landowner. He is trusted to take a large sum of the squire\u0027s money to England. The journey is fraught with encounters with highwaymen, footpads, and villains, all of whom Twm is able to best.\nGeorge Borrow disapproved of the veneer of respectability in Prichard\u0027s book: \u0022Its grand fault is endeavouring to invest Twm Shon with a character of honesty, and to make his exploits appear rather those of a wild young waggish fellow than of a robber.\u0022 According to the stories which Borrow picked up around Tregaron, Twm\u0027s career was more straightforward. \u0022Between eighteen and nineteen, in order to free himself and his mother from poverty which they had long endured, he adopted the profession of a thief, and soon became celebrated through the whole of Wales for the cleverness and adroitness which he exercised in his calling\u0022.\nHe was supposedly a Protestant by faith at a time when Mary I of England, a Catholic monarch, ruled and he had to gain an income as best he could, choosing robbery as his trade as his religion had him marked out as a rebel already and his low status meant that he could not rely on any advantage or protection from others. As a young man he fled to Geneva in 1557 to escape the law. After the accession of the Protestant Queen Elizabeth I, he was able to obtain a pardon for his thievery, enabling his return to Wales in 1559.\n\n\n=== Marriages and children ===\nTwm was active in west Wales, with forays into England, in the late sixteenth century. Stories centre on his tricks, with which he outwitted law-abiding people and criminals alike.\nIn the tale told by Llewelyn Prichard, Twm woos and eventually marries the Lady of Ystrad-ffin and subsequently becomes a magistrate and mayor of Brecon.\nThe name of his first wife is unknown; his second, whom he married in 1607, was Joan, widow of Thomas Williams of Ystrad-ffin and daughter of Sir John Price of Brecon Priory .\nIt is rumoured that Twm had a number of illegitimate children during his time as a highway man. To hide the true identity of their father, the children were given religious or biblical surnames.\r\n\r\n== Legends ==\nBorrow recounted a story in which a farmer is hunting Twm over the theft of a bullock. The farmer reaches Twm\u0027s mother\u0027s house and asks whether Twm Shone Catti lives there. A beggar answers that he does, and agrees to hold the farmer\u0027s horse and whip for him. As the farmer goes into the house, the beggar jumps onto the horse: it is Twm. He gallops to the house of the farmer and tells the farmer\u0027s wife that the farmer is in trouble, needs money urgently, and has sent Twm to fetch it, with the horse and whip to prove that the message really came from the farmer. The farmer\u0027s wife pays up. Twm, now in possession of the farmer\u0027s money and horse, hastily departs for London, later selling the horse.\nA tale recounted by Meyrick recalls how Twm was asked by a poor man to steal a pitcher for him. They went together to a merchant where Twm started belittling the man\u0027s wares. Having told his friend secretly to take the pitcher of his choice, Twm distracted the merchant by telling him there was a hole in one of the pitchers, which the man denied. Twm desired him to put his hand in the pitcher to test it and the man still denied there was a hole. Twm then asked him how, if there was no hole, could he have put his hand inside? By this time his friend had disappeared with his pitcher, undetected.\nA tale from Prichard\u0027s book involves an occasion when Twm is staying in an inn overnight and realises other people are planning to rob him the following day after he sets off. He has a large sum of money with him. The following morning he behaves as though his money is in the pack-saddle of his horse. When the highwayman catches up, Twm drops the saddle in the middle of a pool. The highwayman wades into the pool to fetch it. Twm takes the opportunity to make off with the highwayman\u0027s horse. A complication arises because the horse responds to the voice of the highwayman crying \u0022Stop!\u0022 Luckily Twm, in terror, happens to shout a word which makes the horse gallop on again, and he is conveyed to safety.\nAnother tale recounts how Twm waylaid a rich squire, who was accompanied by his daughter, Twm was so smitten with her that he returned her jewellery to her and attempted to woo her, against her father\u0027s opposition and, initially, her own. One full moon shortly after the robbery, he crept to her window, roused her from sleep, caught her hand at the window and kissed it, refusing to let her go until she promised to marry him. She wouldn\u0027t promise so Twm drew his dagger, drew blood on her wrist and threatened to sever her hand unless she assented to marriage forthwith. She agreed to marry him and she kept her hand. Their marriage followed soon after, despite her father\u0027s views and the directness of Twm\u0027s courtship methods. The girl was supposedly the widow of the sheriff of Carmarthen. Through this marriage Twm is supposed to have gained respectability, eventually becoming a justice of the peace, sitting in judgement on others, a position he held until his death aged 79.\r\n\r\n== Literature ==\nIt is likely that a corpus of oral tales had existed for some time before the eighteenth century, when the character begins to appear in literature. There are a number of similarities between the legends of Twm Siôn Cati and the lead character of Henry Fielding\u0027 1749 novel, The History of Tom Jones, a Foundling. These include the circumstances of his birth, a noble father, a bucolic setting in the \u0022far west\u0022, romantic liaisons followed by the meeting and wooing of a lady, exile from their home country, a rags-to-riches narrative structure and even the character\u0027s names .\nEnglish-language pamphlet, Tomshone Catty\u0027s Tricks was printed in 1763. However, it wasn\u0027t until the early nineteenth century that Twm became a feature of literary works. Another pamphlet, Y Digrifwr was published in 1811. Which was subtitled as \u0022The jokester: a collection of feats and tricks of Thomas Jones of Tregaron, Cardiganshire, he who is generally known under the name Twm Sion Catti\u0022. The journalist William Frederick Deacon dedicated a chapter of his 1823 work, The Innkeeper’s Album to \u0022Twm John Catty: The Welch Rob Roy\u0022. While the collection is of South Wales folklore, the chapter title was a clear attempt to copy Sir Walter Scott\u0027s success in repurposing the Scottish hero for nineteenth century British readers.\nThis was soon followed in 1828 by the initial publication of TJ Llewelyn Prichard\u0027s The Adventures and Vagaries of Twm Shon Catti, descriptive of Life in Wales. George Borrow, walking through Wild Wales in 1854, heard several tales about Twm from a fellow-walker on the way to Tregaron and later read what was probably Prichard\u0027s book.\nThis verse shows how much fear the local residents had of him:\nThere is a great cheer and shout\nin Ystrad-ffin this year,\nAnd the snakestones melt into lead\nBy the osom of Twm Siôn Cati.\nH. Parry-Williams , Old Penitentiary , pgs. 159.\nT. Llew Jones has published three Welsh-language novels about him namely Y Ffordd Dangerous, Amongst Thieves and Dial at Last.\r\n\r\n== Television ==\n\nThe 1978 BBC drama Hawkmoor is based on the activities of Twm Siôn Cati. Created by Lynn Hughes and starring John Ogwen as Twm and Jane Asher as Lady Johane Williams, the drama depicted Twm as a Welsh freedom fighter protecting Welsh people from the repression of the English Sheriff John Stedman and the cruel Vicar Davyd .\nA paperback also written by Lynn Hughes was released in the same year to accompany the television series.\r\n\r\n== Landscape ==\n\nA number of areas have been associated with Twm Sion Cati\u0027s hideouts, including two caves, one on the outskirts of Tregaron at Ystrad-ffin and another at Rhandir-mwyn near Llandovery.\nTwm Siôn Cati\u0027s Cave at Ystrad-ffin became popular with nineteenth century tourists, wishing to trace the footsteps of Twm who was said to have hidden in the cave while wooing Joan , and again when escaping from Llandovery fair.\nThere is a steep ascent to the cave, which is surrounded by trees and boulders, and it is necessary to crawl inside. Part of the cave roof has collapsed but the cave itself has obviously been visited over many years, as evidenced by the carvings – one reads 1832. It overlooks the confluence of the River Tywi with the River Pysgotwr. The Oxford Companion to the Literature of Wales notes that Prichard\u0027s vivid descriptions of Twm\u0027s cave suggest the author knew the area around Rhandir-mwyn well. Historical accounts have been published by Lynne Hughes and three by Welsh-language children\u0027s author T. Llew Jones.\nToday, the cave is part of the Gwenffrwd-Dinas RSPB reserve.\r\n\r\n== Festivals ==\nThe community of Tregaron held a year of activities to commemorate the 400th anniversary of the death of Twm Siôn Cati in 2009.\nThe year saw activities such as an exhibition at Tregaron Kite Centre , a charity walk from his cave to his birthplace and the launching of four books. Local artists created souvenir items. A wood-carving of Twm created by Grace Young Monaghan was placed on Tregaron Square.\nAn international Twm Siôn Cati Day is held each 17 May. A Twm Siôn Cati Community Prize is presented annually to a Tregaron Primary School pupil for doing a good deed in Tregaron. A Twm Town Trail, designed by the school\u0027s pupils, is walked by hundreds of people every year.",
  "imageNames": [
    "Afon_Tywi_and_Craig_Clungwyn_-_geograph.org.uk_-_1457928.jpg",
    "Cwmni_Theatr_Cymrus_production_of_Saunders_Lewis_new_drama_Cymru_Fydd_at_Bala_Eisteddfod_1451485.jpg",
    "Graffiti_in_Twm_Sion_Catis_cave_-_geograph.org.uk_-_522192.jpg",
    "John_Dee_Ashmolean.jpg",
    "Twm_Sion_Cati_-_geograph.org.uk_-_6025919.jpg"
  ],
  "includeMainMenu": false,
  "amDdim": false,
  "start": 1530,
  "end": 1609,
  "categoryId": "unigolion-nodedig",
  "id": "twm-sion-cati",
  "label": "Twm Síon Cati"
}