{
  "wikiSummary": "Nest ferch Rhys was the daughter of Rhys ap Tewdwr, last King of Deheubarth in Wales, by his wife, Gwladys ferch Rhiwallon ap Cynfyn of Powys. Her family is of the House of Dinefwr.  Nest was the wife of Gerald de Windsor , Constable of Pembroke Castle and son of the Constable of Windsor Castle in Berkshire, by whom she was the ancestress of the FitzGerald dynasty.\nNest had two younger brothers, Gruffydd ap Rhys and Hywel, and, possibly, an older sister named Marared, as well as several older illegitimate half-brothers and half-sisters. After their father\u0027s death in battle in 1093, \u0022the Kingdom of the Britons fell\u0022 and was overrun by Normans. Nest\u0027s younger brother Gruffydd was spirited into Ireland for safety; their brother Hywel may have been captured by Arnulf de Montgomery, along with their mother, unless, as appears likelier, their mother was captured with Nest; their fate is unknown. Two older brothers, illegitimate sons of Rhys, one of them named Goronwy, were captured and executed.",
  "wikiArticle": "Nest ferch Rhys was the daughter of Rhys ap Tewdwr, last King of Deheubarth in Wales, by his wife, Gwladys ferch Rhiwallon ap Cynfyn of Powys. Her family is of the House of Dinefwr.  Nest was the wife of Gerald de Windsor , Constable of Pembroke Castle and son of the Constable of Windsor Castle in Berkshire, by whom she was the ancestress of the FitzGerald dynasty.\nNest had two younger brothers, Gruffydd ap Rhys and Hywel, and, possibly, an older sister named Marared, as well as several older illegitimate half-brothers and half-sisters. After their father\u0027s death in battle in 1093, \u0022the Kingdom of the Britons fell\u0022 and was overrun by Normans. Nest\u0027s younger brother Gruffydd was spirited into Ireland for safety; their brother Hywel may have been captured by Arnulf de Montgomery, along with their mother, unless, as appears likelier, their mother was captured with Nest; their fate is unknown. Two older brothers, illegitimate sons of Rhys, one of them named Goronwy, were captured and executed.\r\n\r\n== First marriage and issue ==\nNest was brought as a prized hostage to the court of William II of England, where she came to the attention of his younger brother Henry Beauclerc , to whom she may have borne one of his illegitimate children, Henry FitzHenry .\nSome time after the rebellions of Robert of Normandy and Robert of Belesme, head of the powerful Montgomery family of Normandy and England, the King married Nest to Gerald FitzWalter of Windsor, Arnulf de Montgomery\u0027s former lieutenant and constable for Pembroke Castle. In 1102, for siding with the Montgomerys against the King, Gerald had been removed from control of Pembroke, and one Saher, a knight loyal to Henry, installed in his place. When Saher proved untenable in his new position, the King restored Gerald to Pembroke in 1105, along with Nest as his wife. By Gerald, Nest is the maternal progenitor of the FitzGerald dynasty, a prominent Cambro-Norman noble family.\nNest bore Gerald at least five children, three sons and two daughters.\n\nWilliam FitzGerald, Lord of Carew and Emlyn . William\u0027s children included Raymond FitzGerald le Gros.\nMaurice FitzGerald, Lord of Llanstephan, Naas and Maynooth, . His children included Gerald FitzMaurice, 1st Lord of Offaly.\nDavid FitzGerald, Archdeacon of Cardigan and Bishop of St David\u0027s.\nAngharad, who married William Fitz Odo de Barry, by whom she was the mother of Robert de Barry, Philip de Barry, founder of Ballybeg Abbey at Buttevant in Ireland, and of Gerald de Barry, better known as Gerald of Wales.\nGwladys, mother of Milo de Cogan\r\n\r\n== Second marriage and issue ==\nAfter Gerald\u0027s death, Nest\u0027s sons married her to Stephen, her husband\u0027s constable of Cardigan, by whom she had another son, Robert Fitz-Stephen , one of the Norman conquerors of Ireland.\r\n\r\n== Rape and abduction ==\n\nThe details of this most famous episode of Nest\u0027s life, thought to have occurred in 1106 or 1109, are obscure and differ from one account to another. The most common alternative narratives are:\n\nNest and Gerald were present at an eisteddfod given, during a truce, by Cadwgan ap Bleddyn, prince of Powys\nNest and her husband were \u0022visited\u0022 by her second cousin Owain ap Cadwgan, one of Cadwgan\u0027s sons, at Carew Castle, Gerald escaping down the latrine shaft.\nThe castle of Cenarth Bychan , home of Nest and her husband, was attacked by Owain ap Cadwgan and his men\nThe earliest account, that of Caradoc of Llancarfan, relates that \u0022At the instigation of the Devil, he [Owain] was moved by passion and love for the woman, and with a small company with him...he made for the castle by night.\u0022\nThe story that takes place at Carew Castle says Nest urged her husband to escape via a lavatory chute, while she stayed to face Owain. Owain took Nest and her children to a hunting lodge by the Eglwyseg Rocks north of the Vale of Llangollen.\nThe abduction of Nest, whether or not it was with her consent, aroused the wrath of the Normans, as well as of the Welsh. The Norman lords, the Justiciar of Salop, and at least one bishop, bribed Owain\u0027s Welsh enemies to attack him and his father, which they promptly did. Owain\u0027s father tried to persuade him to return Nest, but to no avail. According to Caradoc, Nest told Owain, \u0022If you would have me stay with you and be faithful to you, then send my children home to their father.\u0022 She secured the return of the children. Owain and his father were driven to seek exile in Ireland. Nest was returned to her husband.\nIn recent years, Nest has been given two specious children by her rapist, Llywelyn and Einion. In fact, Owain had a brother, but not a son, named Einion, and Welsh genealogies do not name the mother of Owain\u0027s son Llywelyn. The omission of the name of a mother with the highborn status of Nest is startling, if it were true.\nIn the 19th century, this \u0022abduction\u0022, as well as the fighting which followed, earned Nest the nickname \u0022Helen of Wales\u0022. She was depicted at having connived with Owain at her rape and abduction, given more children than she had borne, along with more lovers than she had had.\nIn 1112, her brother Gruffydd returned from Ireland, spending most of his time with Gerald and Nest. When he was denied his inheritance from his father, and accused by the King of conspiring against him, he allied with the prince of Gwynedd, and war broke out. Owain ap Cadwgan had, by now, been pardoned by the King, and was prince of Powys; in 1111, his father had been assassinated by Owain\u0027s cousin and former comrade-in-arms, Madog ap Rhiryd, whom Owain captured, castrated, and blinded. Being then on the King\u0027s good side, Owain was ordered to rendezvous with a Norman force to proceed against Gruffydd. En route, he and his force chanced to run into none other than Gerald FitzWalter. Despite Owain being a royal ally, Gerald chose to avenge his wife\u0027s rape, and killed Owain.",
  "imageNames": [
    "Cilgerran_Castle.JPG",
    "Laws_of_Hywel_Dda_f.1.v_King_Hywel_cropped.jpg"
  ],
  "includeMainMenu": true,
  "amDdim": false,
  "start": 1085,
  "end": 1136,
  "categoryId": "milwrol",
  "id": "tywysoges-nest",
  "label": "Y Dywysoges Nest"
}